--[[
file:	TreasureChestConfig.lua
author:	Jonson
update:	2015-05-13
desc:萌斗三国的宝箱相关的配置
]]--

--[[
------------------------------------------------------------------------
	NOTE：掉落的物品，请严格按照如下声明方式，实现细节可以看神秘宝箱的具体掉落
	NOTE：铜钱、砖石、荣誉、军功、体力的ID位----必为0-----
	GoodsType.money--铜钱
	GoodsType.diamond--钻石
	GoodsType.honor--荣誉
	GoodsType.exploit--军功
	GoodsType.endurance--体力
	GoodsType.item --道具或者装备
	GoodsType.hero --英雄
}
------------------------------------------------------------------------
]]--

MysteriousChestConfig = {--神秘宝箱会开出的物品的配置
	MaxRandomCount = 1,--开了该宝箱，最多可以计算随机掉落的物品多少次(程序端已经限死最大值为9)
	totalWeight = 10000,--当前掉落的所有物品的权重之和(万分比)
	--子集合的元素说明：[1]掉落该物品的权重(比如本子集合中的第一个集合中的权重为361(万分比)),[2]掉落物品ID(比如本子集合中的第一个集合中的掉落的物品的ID为20015)，可为空（比如元宝就没有ID）,[3]掉落物品个数
	[1] = {
		[1] = 700,
		[2] = {GoodsType.item, 20014, 2} --蓝装宝箱
	},
	[2] = {
		[1] = 3500,
		[2] = {GoodsType.item, 20013, 5}--绿装宝箱
	},
	[3] = {
		[1] = 5700,
		[2] = {GoodsType.item,20004,1} --夜明珠
	},
	[4] = {
		[1] = 6700,
		[2] = {GoodsType.item,20009,10} --紫金
	},
	[5] = {
		[1] = 7000,
		[2] = {GoodsType.diamond,0,100}--元宝
	},
	[6] = {
		[1] = 9200,
		[2] = {GoodsType.item,20002,5} --灵芝
	},
	[7] = {
		[1] = 10000,
		[2] = {GoodsType.item,20011,1} --烤肉
	},
}

PurpleEquipmentChestConfig = {--绿色宝箱会开出的物品的配置
	MaxRandomCount = 1,--开了该宝箱，最多可以计算随机掉落的物品多少次(程序端已经限死最大值为9)
	totalWeight = 10000,--当前掉落的所有物品的权重之和(万分比)
	--子集合的元素说明：[1]掉落该物品的权重(比如本子集合中的第一个集合中的权重为333(万分比)),[2]掉落物品ID(比如本子集合中的第一个集合中的掉落的物品的ID为11104)，可为空（比如元宝就没有ID）,[3]掉落物品个数
	[1] = {
		[1] = 444,
		[2] = {GoodsType.item,11102,1}--贯石斧
	},
	[2] = {
		[1] = 666,
		[2] = {GoodsType.item,11103,1}--青釭剑
	},
	[3] = {
		[1] = 1100,
		[2] = {GoodsType.item,11202,1}--荆棘铠
	},
	[4] = {
		[1] = 1332,
		[2] = {GoodsType.item,11203,1}--裂石铠
	},
	[5] = {
		[1] = 1776,
		[2] = {GoodsType.item,11302,1}--紫缨盔
	},
	[6] = {
		[1] = 1998,
		[2] = {GoodsType.item,11303,1}--铁骑盔
	},
	[7] = {
		[1] = 2442,
		[2] = {GoodsType.item,11402,1}--龙泉镯
	},
	[8] = {
		[1] = 2886,
		[2] = {GoodsType.item,11502,1}--蚀日戒
	},
	[9] = {
		[1] = 3330,
		[2] = {GoodsType.item,11602,1}--逐月靴
	},
	[10] = {
		[1] = 3774,
		[2] = {GoodsType.item,12102,1}--秋水扇
	},
	[11] = {
		[1] = 4218,
		[2] = {GoodsType.item,12103,1}--凤羽扇
	},
	[12] = {
		[1] = 4662,
		[2] = {GoodsType.item,12202,1}--混元袍
	},
	[13] = {
		[1] = 4884,
		[2] = {GoodsType.item,12203,1}--七星道袍
	},
	[14] = {
		[1] = 5328,
		[2] = {GoodsType.item,12302,1}--黑绸冠
	},
	[15] = {
		[1] = 5772,
		[2] = {GoodsType.item,12303,1}--凤翼冠
	},
	[16] = {
		[1] = 5994,
		[2] = {GoodsType.item,12402,1}--赤星环
	},
	[17] = {
		[1] = 6438,
		[2] = {GoodsType.item,12502,1}--裂云戒
	},
	[18] = {
		[1] = 6892,
		[2] = {GoodsType.item,12602,1}--绝尘靴
	},
	[19] = {
		[1] = 7114,
		[2] = {GoodsType.item,13102,1}--万石弓
	},
	[20] = {
		[1] = 7336,
		[2] = {GoodsType.item,13103,1}--游龙弓
	},
	[21] = {
		[1] = 7780,
		[2] = {GoodsType.item,13202,1}--藤甲
	},
	[22] = {
		[1] = 8002,
		[2] = {GoodsType.item,13203,1}--鹿皮铠衣
	},
	[23] = {
		[1] = 8446,
		[2] = {GoodsType.item,13302,1}--方士帽
	},
	[24] = {
		[1] = 8668,
		[2] = {GoodsType.item,13303,1}--圆铜帽
	},
	[25] = {
		[1] = 9112,
		[2] = {GoodsType.item,13402,1}--苍穹腕
	},
	[26] = {
		[1] = 9556,
		[2] = {GoodsType.item,13502,1}--碧玉戒
	},
	[27] = {
		[1] = 10000,
		[2] = {GoodsType.item,13602,1}--风行靴
	},
}

BlueEquipmentChestConfig = {--蓝色宝箱会开出的物品的配置
	MaxRandomCount = 1,--开了该宝箱，最多可以计算随机掉落的物品多少次(程序端已经限死最大值为9)
	totalWeight = 10000,--当前掉落的所有物品的权重之和(万分比)
	--子集合的元素说明：[1]掉落该物品的权重(比如本子集合中的第一个集合中的权重为444(万分比)),[2]掉落物品ID(比如本子集合中的第一个集合中的掉落的物品的ID为11102)，可为空（比如元宝就没有ID）,[3]掉落物品个数
	[1] = {
		[1] = 333,
		[2] = {GoodsType.item,11104,1}--古锭刀
	},
	[2] = {
		[1] = 499,
		[2] = {GoodsType.item,	11105,1}--丈八蛇矛
	},
	[3] = {
		[1] = 832,
		[2] = {GoodsType.item,11204,1}--龙鳞铠
	},
	[4] = {
		[1] = 998,
		[2] = {GoodsType.item,11205,1}--寒铁战铠
	},
	[5] = {
		[1] = 1331,
		[2] = {GoodsType.item,11304,1}--麟角盔
	},
	[6] = {
		[1] = 1497,
		[2] = {GoodsType.item,11305,1}--龙吟盔
	},
	[7] = {
		[1] = 1830,
		[2] = {GoodsType.item,11403,1}--伏龙镯
	},
	[8] = {
		[1] = 2163,
		[2] = {GoodsType.item,11404,1}--盘龙镯
	},
	[9] = {
		[1] =2496,
		[2] = {GoodsType.item,11503,1}--龙渊戒
	},
	[10] = {
		[1] = 2829,
		[2] = {GoodsType.item,11504,1}--龙纹戒
	},
	[11] = {
		[1] = 3162,
		[2] = {GoodsType.item,11603,1}--天罡靴
	},
	[12] = {
		[1] = 3328,
		[2] = {GoodsType.item,11604,1}--混元靴
	},
	[13] = {
		[1] = 3661,
		[2] = {GoodsType.item,12104,1}--琉璃扇
	},
	[14] = {
		[1] = 3827,
		[2] = {GoodsType.item,12105,1}--逍遥扇
	},
	[15] = {
		[1] = 4160,
		[2] = {GoodsType.item,12204,1}--天地灵衫
	},
	[16] = {
		[1] = 4326,
		[2] = {GoodsType.item,12205,1}--浑天衣
	},
	[17] = {
		[1] = 4659,
		[2] = {GoodsType.item,12304,1}--鹤翎冠
	},
	[18] = {
		[1] = 4992,
		[2] = {GoodsType.item,12305,1}--鬼才冠
	},
	[19] = {
		[1] = 5325,
		[2] = {GoodsType.item,12403,1}--琥珀环
	},
	[20] = {
		[1] = 5491,
		[2] = {GoodsType.item,12404,1}--圣芒环
	},
	[21] = {
		[1] = 5824,
		[2] = {GoodsType.item,12503,1}--圣芒戒
	},
	[22] = {
		[1] = 6157,
		[2] = {GoodsType.item,12504,1}--蓝月戒
	},
	[23] = {
		[1] = 6506,
		[2] = {GoodsType.item,12603,1}--覆雨靴
	},
	[24] = {
		[1] = 6839,
		[2] = {GoodsType.item,12604,1}--鹤翼靴
	},
	[25] = {
		[1] = 7005,
		[2] = {GoodsType.item,13104,1}--震天弓
	},
	[26] = {
		[1] = 7171,
		[2] = {GoodsType.item,13105,1}--落炎弓
	},
	[27] = {
		[1] = 7504,
		[2] = {GoodsType.item,13204,1}--流云衫
	},
	[28] = {
		[1] = 7670,
		[2] = {GoodsType.item,13205,1}--磐龙甲
	},
	[29] = {
		[1] = 8003,
		[2] = {GoodsType.item,13304,1}--寒玉帽
	},
	[30] = {
		[1] = 8336,
		[2] = {GoodsType.item,13305,1}--琉璃帽
	},
	[31] = {
		[1] = 8669,
		[2] = {GoodsType.item,13403,1}--风蚀腕
	},
	[32] = {
		[1] = 8835,
		[2] = {GoodsType.item,13404,1}--闪灵腕
	},
	[33] = {
		[1] = 9168,
		[2] = {GoodsType.item,13503,1}--迅灵戒
	},
	[34] = {
		[1] = 9501,
		[2] = {GoodsType.item,13504,1}--迷离戒
	},
	[35] = {
		[1] = 9834,
		[2] = {GoodsType.item,13603,1}--神行靴
	},
	[36] = {
		[1] = 10000,
		[2] = {GoodsType.item,13604,1}--风扬靴
	},
}

GreenEquipmentChestConfig = {--紫色宝箱会开出的物品的配置
	MaxRandomCount = 1,--开了该宝箱，最多可以计算随机掉落的物品多少次(程序端已经限死最大值为9)
	totalWeight = 10000,--当前掉落的所有物品的权重之和(万分比)
	--子集合的元素说明：[1]掉落该物品的权重(比如本子集合中的第一个集合中的权重为666(万分比)),[2]掉落物品ID(比如本子集合中的第一个集合中的掉落的物品的ID为11101)，可为空（比如元宝就没有ID）,[3]掉落物品个数
	[1] = {
		[1] = 133,
		[2] = {GoodsType.item,11106,1}--龙胆枪
	},
	[2] = {
		[1] = 266,
		[2] = {GoodsType.item,	11107,1}--青龙偃月
	},
	[3] = {
		[1] = 532,
		[2] = {GoodsType.item,11108,1}--方天画戟
	},
	[4] = {
		[1] = 665,
		[2] = {GoodsType.item,11206,1}--尚武战铠
	},
	[5] = {
		[1] = 798,
		[2] = {GoodsType.item,11207,1}--血啸链甲
	},
	[6] = {
		[1] = 1064,
		[2] = {GoodsType.item,11208,1}--战神铠甲
	},
	[7] = {
		[1] = 1330,
		[2] = {GoodsType.item,11306,1}--骁血盔
	},
	[8] = {
		[1] = 1463,
		[2] = {GoodsType.item,11307,1}--玄龙盔
	},
	[9] = {
		[1] = 1729,
		[2] = {GoodsType.item,11308,1}--白银狮子
	},
	[10] = {
		[1] = 1995,
		[2] = {GoodsType.item,11405,1}--杀戮镯
	},
	[11] = {
		[1] = 2261,
		[2] = {GoodsType.item,11406,1}--炙焰镯
	},
	[12] = {
		[1] = 2527,
		[2] = {GoodsType.item,11505,1}--盘龙戒
	},
	[13] = {
		[1] = 2793,
		[2] = {GoodsType.item,11506,1}--惊鸿戒
	},
	[14] = {
		[1] = 3059,
		[2] = {GoodsType.item,11605,1}--朱雀靴
	},
	[15] = {
		[1] = 3192,
		[2] = {GoodsType.item,11606,1}--天覆靴
	},
	[16] = {
		[1] = 3458,
		[2] = {GoodsType.item,12106,1}--雨潇扇
	},
	[17] = {
		[1] = 3591,
		[2] = {GoodsType.item,12107,1}--灵霄扇
	},
	[18] = {
		[1] = 3857,
		[2] = {GoodsType.item,12108,1}--仙帝扇
	},
	[19] = {
		[1] = 3990,
		[2] = {GoodsType.item,12206,1}--鬼纹云衫
	},
	[20] = {
		[1] = 4123,
		[2] = {GoodsType.item,12207,1}--金芒战衣
	},
	[21] = {
		[1] = 4389,
		[2] = {GoodsType.item,12208,1}--凤凰羽衣
	},
	[22] = {
		[1] = 4655,
		[2] = {GoodsType.item,12306,1}--天禀冠
	},
	[23] = {
		[1] = 4921,
		[2] = {GoodsType.item,12307,1}--七星冠
	},
	[24] = {
		[1] = 5187,
		[2] = {GoodsType.item,12308,1}--涅槃冠
	},
	[25] = {
		[1] = 5453,
		[2] = {GoodsType.item,12405,1}--玛瑙环
	},
	[26] = {
		[1] = 5586,
		[2] = {GoodsType.item,12406,1}--乌玉环
	},
	[27] = {
		[1] = 5852,
		[2] = {GoodsType.item,12505,1}--冷月戒
	},
	[28] = {
		[1] = 6118,
		[2] = {GoodsType.item,12506,1}--嗜灵戒
	},
	[29] = {
		[1] = 6384,
		[2] = {GoodsType.item,12605,1}--白虎靴
	},
	[30] = {
		[1] = 6650,
		[2] = {GoodsType.item,12606,1}--鹰翎靴
	},
	[31] = {
		[1] = 6783,
		[2] = {GoodsType.item,13106,1}--麒麟弓
	},
	[32] = {
		[1] = 6916,
		[2] = {GoodsType.item,13107,1}--龙舌弓
	},
	[33] = {
		[1] = 7182,
		[2] = {GoodsType.item,13108,1}--轩辕弓
	},
	[34] = {
		[1] = 7315,
		[2] = {GoodsType.item,13206,1}--神武皮甲
	},
	[35] = {
		[1] = 7448,
		[2] = {GoodsType.item,13207,1}--伏虎战甲
	},
	[36] = {
		[1] = 7739,
		[2] = {GoodsType.item,13208,1}--九皇神铠
	},
	[37] = {
		[1] = 8005,
		[2] = {GoodsType.item,13306,1}--落英帽
	},
	[38] = {
		[1] = 8271,
		[2] = {GoodsType.item,13307,1}--天义帽
	},
	[39] = {
		[1] = 8537,
		[2] = {GoodsType.item,13308,1}--洛神帽
	},
	[40] = {
		[1] = 8803,
		[2] = {GoodsType.item,13405,1}--迅灵腕
	},
	[41] = {
		[1] = 8936,
		[2] = {GoodsType.item,13406,1}--凤翎腕
	},
	[42] = {
		[1] = 9202,
		[2] = {GoodsType.item,13505,1}--潜龙戒
	},
	[43] = {
		[1] = 9468,
		[2] = {GoodsType.item,13506,1}--凌云戒
	},
	[44] = {
		[1] = 9734,
		[2] = {GoodsType.item,13605,1}--青龙靴
	},
	[45] = {
		[1] = 10000,
		[2] = {GoodsType.item,13606,1}--游龙靴
	},
	
}

QqunChestConfig = {--q群宝箱会开出的物品配置
	[1] = {GoodsType.diamond,0,100},--元宝
	[2] = {GoodsType.item,20011,2},--烤肉
	[3] = {GoodsType.money,0,20000},--金币
}
	
HeroSoulChestConfig = {--将魂宝箱会开出的物品配置
	MaxRandomCount = 1,--开了该宝箱，最多可以计算随机掉落的物品多少次(程序端已经限死最大值为9)
	totalWeight = 10000,--当前掉落的所有物品的权重之和(万分比)
	--子集合的元素说明：[1]掉落该物品的权重(比如本子集合中的第一个集合中的权重为2000(万分比)),[2]掉落物品ID(比如本子集合中的第一个集合中的掉落的物品的ID为90101)，可为空（比如元宝就没有ID）,[3]掉落物品个数
	[1] = {
		[1] = 400,
		[2] = {GoodsType.item,90103,1}
	},
	[2] = {
		[1] = 800,
		[2] = {GoodsType.item,90104,1}
	},
	[3] = {
		[1] = 1200,
		[2] = {GoodsType.item,90106,1}
	},
	[4] = {
		[1] = 1600,
		[2] = {GoodsType.item,90107,1}
	},
	[5] = {
		[1] = 2000,
		[2] = {GoodsType.item,90108,1}
	},
	[6] = {
		[1] = 2400,
		[2] = {GoodsType.item,90109,1}
	},
	[7] = {
		[1] = 2800,
		[2] = {GoodsType.item,90110,1}
	},
	[8] = {
		[1] = 3200,
		[2] = {GoodsType.item,90112,1}
	},
	[9] = {
		[1] = 3600,
		[2] = {GoodsType.item,90115,1}
	},
	[10] = {
		[1] = 4000,
		[2] = {GoodsType.item,90117,1}
	},
	[11] = {
		[1] = 4400,
		[2] = {GoodsType.item,90118,1}
	},
	[12] = {
		[1] = 4800,
		[2] = {GoodsType.item,90120,1}
	},
	[13] = {
		[1] = 5200,
		[2] = {GoodsType.item,90125,1}
	},
	[14] = {
		[1] = 5600,
		[2] = {GoodsType.item,90127,1}
	},
	[15] = {
		[1] = 6000,
		[2] = {GoodsType.item,90129,1}
	},
	[16] = {
		[1] = 6400,
		[2] = {GoodsType.item,90130,1}
	},
	[17] = {
		[1] = 6800,
		[2] = {GoodsType.item,90131,1}
	},
	[18] = {
		[1] = 7200,
		[2] = {GoodsType.item,90133,1}
	},
	[19] = {
		[1] = 7600,
		[2] = {GoodsType.item,90135,1}
	},
	[20] = {
		[1] = 8000,
		[2] = {GoodsType.item,90137,1}
	},
	[21] = {
		[1] = 8400,
		[2] = {GoodsType.item,90138,1}
	},	
	[22] = {
		[1] = 8800,
		[2] = {GoodsType.item,90140,1}
	},
	[23] = {
		[1] = 9200,
		[2] = {GoodsType.item,90141,1}
	},
	[24] = {
		[1] = 9600,
		[2] = {GoodsType.item,90142,1}
	},
	[25] = {
		[1] = 10000,
		[2] = {GoodsType.item,90143,1}
	},
}
MidAutumnChestConfig = {--中秋宝箱会开出的物品配置
	MaxRandomCount = 1,--开了该宝箱，最多可以计算随机掉落的物品多少次(程序端已经限死最大值为9)
	totalWeight = 10000,--当前掉落的所有物品的权重之和(万分比)
	--子集合的元素说明：[1]掉落该物品的权重(比如本子集合中的第一个集合中的权重为2000(万分比)),[2]掉落物品ID(比如本子集合中的第一个集合中的掉落的物品的ID为90101)，可为空（比如元宝就没有ID）,[3]掉落物品个数
	[1] = {
		[1] = 1000,
		[2] = {GoodsType.item,90106,1}
	},
	[2] = {
		[1] = 1100,
		[2] = {GoodsType.item,20004,1}
	},
	[3] = {
		[1] = 3000,
		[2] = {GoodsType.item,20003,2}
	},
	[4] = {
		[1] = 5000,
		[2] = {GoodsType.item,20002,2}
	},
	[5] = {
		[1] = 7000,
		[2] = {GoodsType.item,20008,5}
	},
	[6] = {
		[1] = 8000,
		[2] = {GoodsType.item,20011,1}
	},
	[7] = {
		[1] = 10000,
		[2] = {GoodsType.item,20018,1}
	},
}
FledglingChestConfig = {--初出茅庐宝箱会开出的物品配置
	MaxRandomCount = 1,--开了该宝箱，最多可以计算随机掉落的物品多少次(程序端已经限死最大值为9)
	totalWeight = 10000,--当前掉落的所有物品的权重之和(万分比)
	--子集合的元素说明：[1]掉落该物品的权重(比如本子集合中的第一个集合中的权重为2000(万分比)),[2]掉落物品ID(比如本子集合中的第一个集合中的掉落的物品的ID为90101)，可为空（比如元宝就没有ID）,[3]掉落物品个数
	[1] = {
		[1] = 800,
		[2] = {GoodsType.item,90108,1}
	},
	[2] = {
		[1] = 3100,
		[2] = {GoodsType.item,90110,1}
	},
	[3] = {
		[1] = 5400,
		[2] = {GoodsType.item,90141,1}
	},
	[4] = {
		[1] = 7700,
		[2] = {GoodsType.item,90105,1}
	},
	[5] = {
		[1] = 10000,
		[2] = {GoodsType.item,90137,1}
	},
}