RankListData_Path = tostring("Script\\Global\\RankListData.ldb")      --用于保存固定时间刷新后的排行数据。

BackRankIntervalTime = 30 * 60      --备份排行榜数据的间隔时间

RankRefreshIntervalTime = 60    --排行榜刷新间隔时间    秒

RankResetTime = 3 * 60 * 60     --排行榜重置时间  秒    X* 60 *60   X为刷新时间  0-24 取值范围

ShowTopN = 10       --显示排行榜最高的N个玩家

ShowMineTopN = 3    --显示玩家自己和自己前面的N-1个玩家，如果前面不足N - 1个玩家，有多少显示多少个玩家

TopNAward = 12   --排名前N个领取对应的奖励，其它领取类型为0的奖励

-------------先修改奖励最大位   然后修改可取的的奖励范围   最后配置实际奖励

PowerAwardMaxNum =  12      --战斗力奖励最大区间范围 1到PowerAwardMaxLevel
LevelAwardMaxNum =  12      --战斗力奖励最大区间范围 LevelAwardMaxNum
GlodAwardMaxNum =  12      --战斗力奖励最大区间范围 LevelAwardMaxNum


RankAwardRange = 
{
    --参数依次为: ( ID，最高排名（包含），最低排名（包含） )   
    {1, 1 , 1,},          --- ID 奖励总数量    ， 可以取的奖励的最高等级    ，可以取得奖励的最低等级
    {2, 2 , 2,},
    {3, 3 , 3,},
    {4, 4 , 4,},
    {5, 5 , 5,},
    {6, 6 , 10,},
    {7, 11 , 50,},
    {8, 51 , 100,},
    {9, 101 , 500,},
    {10, 501 , 1000,},
    {11, 1001 , 1500,},
    {12, 1501 , 2000,},
}


RandAwardCfg = 
{
    --参数依次为：排名范围ID、类型（1表示战斗力、2表示等级、3表示金币数）、道具ID、道具数量...
    {1, 1, {910023, 5,},}, 
    {2, 1, {910023, 2,},},	
    {3, 1, {910022, 5,},},
    {4, 1, {910022, 3,},},
    {5, 1, {910022, 2,},},
    {6, 1, {910021, 5,},},
    {7, 1, {910021, 3,},},
    {8, 1, {910021, 2,},},
	{9, 1, {910021, 1,},},
	{10, 1, {910021, 1,},},
	{11, 1, {910021, 1,},},
	{12, 1, {910021, 1,},},

-------------------------------------------------------------------	
	
    {1, 2, {910023, 5,},}, 
    {2, 2, {910023, 2,},},	
    {3, 2, {910022, 5,},},
    {4, 2, {910022, 3,},},
    {5, 2, {910022, 2,},},
    {6, 2, {910021, 5,},},
    {7, 2, {910021, 3,},},
    {8, 2, {910021, 2,},},
	{9, 2, {910021, 1,},},
	{10, 2, {910021, 1,},},
	{11, 2, {910021, 1,},},
	{12, 2, {910021, 1,},},
	
------------------------------------------------------------------------	
	
    {1, 3, {910023, 5,},}, 
    {2, 3, {910023, 2,},},	
    {3, 3, {910022, 5,},},
    {4, 3, {910022, 3,},},
    {5, 3, {910022, 2,},},
    {6, 3, {910021, 5,},},
    {7, 3, {910021, 3,},},
    {8, 3, {910021, 2,},},
	{9, 3, {910021, 1,},},
	{10, 3, {910021, 1,},},
	{11, 3, {910021, 1,},},
	{12, 3, {910021, 1,},},
}

