ActivenessResetTime = 2 * 60 * 60  --活跃度重置时间

--活跃度配置
ActivenessTaskCfg = 
{
    --参数依次为：任务类型、最多完成次数、单次获得的活跃度
    {1, 5, 2, "通关关卡"},  --通关关卡
    {2, 3, 5, "通关活动副本"},  --通关活动副本
    {3, 10, 2, "强化装备"}, --强化装备
    {4, 5, 3, "装备升星"},  --装备升星
    {5, 5, 3, "装备刻印"},  --装备刻印
    {6, 1, 5, "使用小喇叭"},  --使用小喇叭
    {7, 1, 10, "商城购买"}, --商城购买
}

--活跃度达到某个等级时获得的奖励配置
ActivenessAwardCfg = 
{
    --参数依次为：活跃度值、奖励类型（0为道具 1为银币，2为经验，3为真气）、奖励道具ID、道具数量... 
    {20, {{0, 910031, 1},}, },
    {40, {{0, 910011, 2},{0, 910021, 1},}, },
    {60, {{0, 190201, 1},{0, 910031, 2},{0, 910011, 2},{0, 910021, 2},}, },
    {80, {{0, 890001, 1},{0, 910031, 4},{0, 910011, 4},{0, 910021, 4},}, },
    {90, {{0, 890002, 1},{0, 190201, 2},{0, 890001, 1},{0, 910012, 1},{0, 910022, 1},}, },
}