--角色属性枚举
PlayerProperty = PlayerProperty or {
	账号ID=0,
	等级=1,
	门派=2,
	名称=3,
	经验=4,
	气运=5,
	体魄=6,
	身法=7,
	活力=8,
	悟性=9,
	杀孽=10,
	性别=11,
	组队编号=12,
	是否队长=13,
	名望=14,
	账号=15,
	全局编号=16,
	全局静态编号=17,
	消费点数=18,
	IP=19,
	是否存在2级密码=20,
	不带前綴账号=21,
	穴位点数=22,
	帮派编号=23,
	HP=25,
	MaxHP=26,
	积分=27,
	心魔=33,
	结义名=34,
	武功层数=36,
	心法=37,
	BUFF=38,
	MP=39,
	SP=40,
	外功基础=43,
	内功基础=44,
	外防基础=45,
	内防基础=46,
	杀气=47,
	金钱=48,
}
MountProperty = MountProperty or{
	饥饿度=1,
	经验=2,
}
--SendLuaMsg中使用的消息id
IDS=IDS or {
	副本任务={4,50},
	副本仓库={4,100},
	副本任务完成={4,51},
	副本任务计时={4,52},
	副本任务追踪={4,53},
	取副本仓库道具={4,1000},
	删除副本仓库道具={4,1001},
	显示MessageBox={5,1},
	强制进副本确认={3,2},
}
playerCSState = playerCSState or {
	没有副本任务 	= 0,
	接受副本任务 	= 1,
	准备进入副本	= 2,
	副本中				= 3,
	副本中锁定		= 4,
}

--在与NPC对话时,SendMessage中使用的菜单ID. c/c++程序会回调至 ClickMenu .. id()
MENU=MENU or {
	打开副本界面=80001,
	--打开副本仓库=80002
}
LUA_EVENT_TIMER={
	CopySceneClearTimer=1000,
}