--幸运摩天轮数据配置信息
FerrisWheelDataCfg = 
{
    --参数依次为：序号ID，奖励道具ID，奖励道具数量，权重
    {1, 910011, 2, 10},
	{2, 910021, 2, 10},
	{3, 910031, 2, 10},
	{4, 890001, 2, 1},
    {5, 910012, 2, 5},
	{6, 910022, 2, 5},
	{7, 910032, 2, 5},
	{8, 890002, 2, 1},
    {9, 910013, 2, 1},
    {10, 910023, 2, 1},
    {11, 910033, 2, 1},
    {12, 730105, 2, 1},
}

--每次充值当前金币数可以获得1次进入幸运摩天轮
FerrisWheelConsumeGlodNum = 100

--幸运摩天轮开放时间倒计时
FerrisWheelOpenTime = 7 * 24 * 60 * 60  --当前为7天

--显示玩家在幸运摩天轮中获得的道具最新的记录信息数量
FerriWheelShowMaxNum = 5