--[[
file:	DessertConfig.lua
author:	Jonson
update:	2015-04-23
desc:三国的小型奖励的配置信息
]]--

DessertConfig = {
	CountLimitted = 5, --每天限制的次数
	probability = { -- 小型奖励的各种奖励物品的对应的几率值
		[1] = 90,--发放金钱的几率，以100来算
		[2] = 10,--发放元宝的几率，以100来算
	},
	[1] = {--金钱奖励类型
		nums = {--该类型奖励会发放的不同的个数列表，用于随机发放不同的个数
			6666,8888,10000,
		},
		unitWeight = {--该类型奖励会发放的个数对应的几率值，以100来算
			30,25,20,
		},
	},
	[2] = {--元宝奖励类型
		nums = {--该类型奖励会发放的不同的个数列表，用于随机发放不同的个数
			10,10,10,
		},
		unitWeight = {--该类型奖励会发放的个数对应的几率值，以100来算
			30,25,20,
		},
	},
}