
	-- "#1","#2"  号 代表要替换的的值  最多只能替换到 "#5"  也就是最多只能替换5个值
TipConfig=
{
--练武场最高排名奖励邮件
--“#1”玩家当前排名，“#2”玩家相对上一次排名提升的名次
	[1]="练武场最高排名奖励",--竞技场邮件标题
	[2]="主公,现在您的最高排名是#1名，比之前提高了#2名哦，要继续加油哈。",--竞技场邮件内容
	[3]="炫游",--邮件署名
	
--练武场每日排名奖励邮件
--“#1”玩家当前在练武场的最新排名,使用[3]的邮件署名
	[4]="练武场每日排名奖励",--竞技场邮件标题
	[5]="主公，到今天24:00为止，您在练武场的排名是#1,要继续努力哟。",--竞技场邮件内容
	[6]="zyu_01", --默认的头像ICon名,用周瑜的头像
	
--军团解散邮件
	[7]="系统提示",--竞技场邮件标题
	[8]="主公，很遗憾。您的公会已经解散~o(╯□╰)o",--竞技场邮件内容
	[9]="GM",--默认的头像ICon名,用周瑜的头像
	[10]="主公，很遗憾。您已被公会已经开除~o(╯□╰)o",--竞技场邮件内容
	
--国战奖励
	[11]="国战胜利奖励", --标题
	[12]="国战发奖励时您未在线,请邮件领取",  --内容
	[13]="国战管理员", --邮件署名
}





