FactionSceneMap = {}  --军团副本以及关卡配置
FACTIONDUTY = {1,2,3,4}  --军团职务 普通成员到军团长
FACTIONDUTYNUM = {4,1,1} --军团职位的个数 普通成员不在其中
FactionMapOpenCount = {2,2,2,3,3,3,4,4,4,4}  --军团副本开启每天最大数量
FactionMapAllCount = {1,2,3,4,5,6,7,8,9,10,} --军团副本开启最大数量
FACTIONMEMBERMAX = {15,17,19,21,23,25,27,29,31,33} --军团最多成员数量
FACTIONEXPUPDATE = {2000,3000,6000,13000,2200,33000,46000,61000,78000,97000} --军团升级所需经验
FactionSceneResetTime = 5    --军团数据重置时间
FactionMemberCount = 3 --军团成员关卡每日挑战次数
FACTIONKICKJOINTIME = 48 * 60 * 60   --军团被踢成员再次加入同一军团时间 n小时
FACTIONACTIVITYVALUE = {3.0,1}  --扣除体力增加活跃度
FACTIONOPERATENUM = 100  --军团操作日志数量
FACTIONEMAILSENDMAN = 5 --军团群邮件每日发送最大数量
FACTIONOPERATE =  --军团操作日志类型
{
	ADDMEMBER = 1,	--增加成员
	KICKMEMBER = 2, --踢出成员
	UPDATETITLE = 3, --成员职务变更
	SCENEOPEN = 4,   --军团副本开启
	SCENEPASS = 5,   --军团副本通关
	NOTICECHANGE = 6,   --军团更改公告
	GOTSALARY = 7,  --领取到俸禄
	GOTEQUIPMENT = 8,  --领取到申请的装备
	SENDEMAILALL = 9,  --发送了群发邮件

}
QUESTFACTIONMAX = 3	--最多申请军团数量
QUESTLISTMAX = 20      --军团最多接受的申请数量
FactionSceneMap[920000] = 
{
itemlist = --通关后的奖励道具列表
{
 {range = {1,1},reward = {0,800},},
 {range = {2,2},reward = {0,500},},
 {range = {3,3},reward = {0,300},},
 {range = {4,4},reward = {0,270},},
 {range = {5,5},reward = {0,240},},
 {range = {6,6},reward = {0,210},},
 {range = {7,7},reward = {0,180},},
 {range = {8,8},reward = {0,150},},
 {range = {9,9},reward = {0,120},},
 {range = {10,50},reward = {0,100},},
}, 
   -- itemlist = {11101,11102,11103,11105}, --通关后的奖励道具列表
LimitLevel = 1,    --军团等级限制
LimitPlayerLevel = 30,    --玩家等级限制
LimitContorl = {},        --条件限制，副本ID
ActiveValue = 3000,--活跃度
[1] =    --每个关卡信息 1
{
BossInfo = {1999000,1141921.5}, --Boss 信息 ID 和血量
Equipment = {11606,12606,13606}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[2] =    --每个关卡信息 2
{
BossInfo = {1999001,1390099.46}, --Boss 信息 ID 和血量
Equipment = {11308,12308,13308}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[3] =    --每个关卡信息 3
{
BossInfo = {1999002,1451118.56}, --Boss 信息 ID 和血量
Equipment = {11108,12108,13108}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[4] =    --每个关卡信息 4
{
BossInfo = {1999003,1600620.82}, --Boss 信息 ID 和血量
Equipment = {11208,12208,13208}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[5] =    --每个关卡信息 5
{
BossInfo = {1999004,1444074.29}, --Boss 信息 ID 和血量
Equipment = {11506,12506,13506}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[6] =    --每个关卡信息 6
{
BossInfo = {1999005,1249598.46}, --Boss 信息 ID 和血量
Equipment = {11406,12406,13406}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[7] =    --每个关卡信息 7
{
BossInfo = {1999006,1480432.71}, --Boss 信息 ID 和血量
Equipment = {11606,12606,13606}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[8] =    --每个关卡信息 8
{
BossInfo = {1999007,1247160.36}, --Boss 信息 ID 和血量
Equipment = {11308,12308,13308}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[9] =    --每个关卡信息 9
{
BossInfo = {1999008,1262444.27}, --Boss 信息 ID 和血量
Equipment = {11108,12108,13108}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[10] =    --每个关卡信息 10
{
BossInfo = {1999009,1277790.63}, --Boss 信息 ID 和血量
Equipment = {12405,12505,12605}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
}
FactionSceneMap[920100] = 
{
itemlist = --通关后的奖励道具列表
{
 {range = {1,1},reward = {0,800},},
 {range = {2,2},reward = {0,500},},
 {range = {3,3},reward = {0,300},},
 {range = {4,4},reward = {0,270},},
 {range = {5,5},reward = {0,240},},
 {range = {6,6},reward = {0,210},},
 {range = {7,7},reward = {0,180},},
 {range = {8,8},reward = {0,150},},
 {range = {9,9},reward = {0,120},},
 {range = {10,50},reward = {0,100},},
}, 
--itemlist = {11101,11102,11103,11105}, --通关后的奖励道具列表
LimitLevel = 2,    --军团等级限制
LimitPlayerLevel = 30,    --玩家等级限制
LimitContorl = {920000},        --条件限制，副本ID
ActiveValue = 3000,--活跃度
[1] =    --每个关卡信息 1
{
BossInfo = {1999010,1609845.6}, --Boss 信息 ID 和血量
Equipment = {11106,11206,11306}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},

[2] =    --每个关卡信息 2
{
BossInfo = {1999011,1250313.3}, --Boss 信息 ID 和血量
Equipment = {11405,11505,11605}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[3] =    --每个关卡信息 3
{
BossInfo = {1999012,1307415.01}, --Boss 信息 ID 和血量
Equipment = {12106,12206,12306}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[4] =    --每个关卡信息 4
{
BossInfo = {1999013,1640085.1}, --Boss 信息 ID 和血量
Equipment = {12405,12505,12605}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[5] =    --每个关卡信息 5
{
BossInfo = {1999014,1422448.14}, --Boss 信息 ID 和血量
Equipment = {13106,13206,13306}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[6] =    --每个关卡信息 6
{
BossInfo = {1999015,1996821.26}, --Boss 信息 ID 和血量
Equipment = {13405,13505,13605}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[7] =    --每个关卡信息 7
{
BossInfo = {1999016,1848935.31}, --Boss 信息 ID 和血量
Equipment = {11106,11206,11306}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[8] =    --每个关卡信息 8
{
BossInfo = {1999017,2154222.89}, --Boss 信息 ID 和血量
Equipment = {11405,11505,11605}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[9] =    --每个关卡信息 9
{
BossInfo = {1999018,2010134.95}, --Boss 信息 ID 和血量
Equipment = {12106,12206,12306}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[10] =    --每个关卡信息 10
{
BossInfo = {1999019,1714870.92}, --Boss 信息 ID 和血量
Equipment = {12405,12505,12605}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
}
FactionSceneMap[920200] = 
{
itemlist = --通关后的奖励道具列表
{
 {range = {1,1},reward = {0,800},},
 {range = {2,2},reward = {0,500},},
 {range = {3,3},reward = {0,300},},
 {range = {4,4},reward = {0,270},},
 {range = {5,5},reward = {0,240},},
 {range = {6,6},reward = {0,210},},
 {range = {7,7},reward = {0,180},},
 {range = {8,8},reward = {0,150},},
 {range = {9,9},reward = {0,120},},
 {range = {10,50},reward = {0,100},},
}, 
--itemlist = {11101,11102,11103,11106}, --通关后的奖励道具列表
LimitLevel = 3,    --军团等级限制
LimitPlayerLevel = 30,    --玩家等级限制
LimitContorl = {920100},        --条件限制，副本ID
ActiveValue = 3000,--活跃度
[1] =    --每个关卡信息 1
{
BossInfo = {1999020,1784248.51}, --Boss 信息 ID 和血量
Equipment = {13106,13206,13306}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[2] =    --每个关卡信息 2
{
BossInfo = {1999021,1890208.69}, --Boss 信息 ID 和血量
Equipment = {13106,13206,13306}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[3] =    --每个关卡信息 3
{
BossInfo = {1999022,2114813.58}, --Boss 信息 ID 和血量
Equipment = {13405,13505,13605}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[4] =    --每个关卡信息 4
{
BossInfo = {1999023,1993592.43}, --Boss 信息 ID 和血量
Equipment = {11106,11206,11306}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[5] =    --每个关卡信息 5
{
BossInfo = {1999024,1984874.39}, --Boss 信息 ID 和血量
Equipment = {11405,11505,11605}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[6] =    --每个关卡信息 6
{
BossInfo = {1999025,2139456.47}, --Boss 信息 ID 和血量
Equipment = {12106,12206,12306}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[7] =    --每个关卡信息 7
{
BossInfo = {1999026,1821090.35}, --Boss 信息 ID 和血量
Equipment = {12405,12505,12605}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[8] =    --每个关卡信息 8
{
BossInfo = {1999027,2137731.51}, --Boss 信息 ID 和血量
Equipment = {13106,13206,13306}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[9] =    --每个关卡信息 9
{
BossInfo = {1999028,2457196.48}, --Boss 信息 ID 和血量
Equipment = {13405,13505,13605}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[10] =    --每个关卡信息 10
{
BossInfo = {1999029,1955691.05}, --Boss 信息 ID 和血量
Equipment = {11106,11206,11306}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
}
FactionSceneMap[920300] = 
{
itemlist = --通关后的奖励道具列表
{
 {range = {1,1},reward = {0,800},},
 {range = {2,2},reward = {0,500},},
 {range = {3,3},reward = {0,300},},
 {range = {4,4},reward = {0,270},},
 {range = {5,5},reward = {0,240},},
 {range = {6,6},reward = {0,210},},
 {range = {7,7},reward = {0,180},},
 {range = {8,8},reward = {0,150},},
 {range = {9,9},reward = {0,120},},
 {range = {10,50},reward = {0,100},},
}, 
--itemlist = {11101,11102,11103,11107}, --通关后的奖励道具列表
LimitLevel = 4,    --军团等级限制
LimitPlayerLevel = 30,    --玩家等级限制
LimitContorl = {920200},        --条件限制，副本ID
ActiveValue = 3000,--活跃度
[1] =    --每个关卡信息 1
{
BossInfo = {1999030,2091073.69}, --Boss 信息 ID 和血量
Equipment = {11405,11505,11605}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[2] =    --每个关卡信息 2
{
BossInfo = {1999031,1796854.13}, --Boss 信息 ID 和血量
Equipment = {12106,12206,12306}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[3] =    --每个关卡信息 3
{
BossInfo = {1999032,2388924.75}, --Boss 信息 ID 和血量
Equipment = {12405,12505,12605}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[4] =    --每个关卡信息 4
{
BossInfo = {1999033,2265452.5}, --Boss 信息 ID 和血量
Equipment = {13106,13206,13306}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[5] =    --每个关卡信息 5
{
BossInfo = {1999034,2384054.55}, --Boss 信息 ID 和血量
Equipment = {13405,13505,13605}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[6] =    --每个关卡信息 6
{
BossInfo = {1999035,2041246.81}, --Boss 信息 ID 和血量
Equipment = {11307,12307,13307}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[7] =    --每个关卡信息 7
{
BossInfo = {1999036,2704644.28}, --Boss 信息 ID 和血量
Equipment = {11107,12107,13107}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[8] =    --每个关卡信息 8
{
BossInfo = {1999037,2165091.98}, --Boss 信息 ID 和血量
Equipment = {11207,12207,13207}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[9] =    --每个关卡信息 9
{
BossInfo = {1999038,3190150.06}, --Boss 信息 ID 和血量
Equipment = {11505,12505,13505}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[10] =    --每个关卡信息 10
{
BossInfo = {1999039,3681431}, --Boss 信息 ID 和血量
Equipment = {11405,12405,13405}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
}
FactionSceneMap[920400] = 
{
itemlist = --通关后的奖励道具列表
{
 {range = {1,1},reward = {0,800},},
 {range = {2,2},reward = {0,500},},
 {range = {3,3},reward = {0,300},},
 {range = {4,4},reward = {0,270},},
 {range = {5,5},reward = {0,240},},
 {range = {6,6},reward = {0,210},},
 {range = {7,7},reward = {0,180},},
 {range = {8,8},reward = {0,150},},
 {range = {9,9},reward = {0,120},},
 {range = {10,50},reward = {0,100},},
}, 
--itemlist = {11101,11102,11103,11108}, --通关后的奖励道具列表
LimitLevel = 5,    --军团等级限制
LimitPlayerLevel = 30,    --玩家等级限制
LimitContorl = {920300},        --条件限制，副本ID
ActiveValue = 3000,--活跃度
[1] =    --每个关卡信息 1
{
BossInfo = {1999040,3041115.02}, --Boss 信息 ID 和血量
Equipment = {11605,12605,13605}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[2] =    --每个关卡信息 2
{
BossInfo = {1999041,3290519.25}, --Boss 信息 ID 和血量
Equipment = {11307,12307,13307}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[3] =    --每个关卡信息 3
{
BossInfo = {1999042,2811076.89}, --Boss 信息 ID 和血量
Equipment = {11107,12107,13107}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[4] =    --每个关卡信息 4
{
BossInfo = {1999043,3716772.74}, --Boss 信息 ID 和血量
Equipment = {11207,12207,13207}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[5] =    --每个关卡信息 5
{
BossInfo = {1999044,3506305.33}, --Boss 信息 ID 和血量
Equipment = {11505,12505,13505}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[6] =    --每个关卡信息 6
{
BossInfo = {1999045,3493402.25}, --Boss 信息 ID 和血量
Equipment = {11405,12405,13405}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[7] =    --每个关卡信息 7
{
BossInfo = {1999046,3767950.65}, --Boss 信息 ID 和血量
Equipment = {11605,12605,13605}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[8] =    --每个关卡信息 8
{
BossInfo = {1999047,3209256.96}, --Boss 信息 ID 和血量
Equipment = {11307,12307,13307}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[9] =    --每个关卡信息 9
{
BossInfo = {1999048,4231068.65}, --Boss 信息 ID 和血量
Equipment = {11107,12107,13107}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[10] =    --每个关卡信息 10
{
BossInfo = {1999049,3980550.62}, --Boss 信息 ID 和血量
Equipment = {11207,12207,13207}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
}
FactionSceneMap[920500] = 
{
itemlist = --通关后的奖励道具列表
{
 {range = {1,1},reward = {0,800},},
 {range = {2,2},reward = {0,500},},
 {range = {3,3},reward = {0,300},},
 {range = {4,4},reward = {0,270},},
 {range = {5,5},reward = {0,240},},
 {range = {6,6},reward = {0,210},},
 {range = {7,7},reward = {0,180},},
 {range = {8,8},reward = {0,150},},
 {range = {9,9},reward = {0,120},},
 {range = {10,50},reward = {0,100},},
}, 
--itemlist = {11101,11102,11103,11109}, --通关后的奖励道具列表
LimitLevel = 6,    --军团等级限制
LimitPlayerLevel = 30,    --玩家等级限制
LimitContorl = {920400},        --条件限制，副本ID
ActiveValue = 3000,--活跃度
[1] =    --每个关卡信息 1
{
BossInfo = {1999050,3534727.98}, --Boss 信息 ID 和血量
Equipment = {11505,12505,13505}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[2] =    --每个关卡信息 2
{
BossInfo = {1999051,3664363.89}, --Boss 信息 ID 和血量
Equipment = {11405,12405,13405}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[3] =    --每个关卡信息 3
{
BossInfo = {1999052,3758328.73}, --Boss 信息 ID 和血量
Equipment = {11605,12605,13605}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[4] =    --每个关卡信息 4
{
BossInfo = {1999053,3173624.75}, --Boss 信息 ID 和血量
Equipment = {11307,12307,13307}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[5] =    --每个关卡信息 5
{
BossInfo = {1999054,3907577.96}, --Boss 信息 ID 和血量
Equipment = {11107,12107,13107}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[6] =    --每个关卡信息 6
{
BossInfo = {1999055,4042608.83}, --Boss 信息 ID 和血量
Equipment = {11207,12207,13207}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[7] =    --每个关卡信息 7
{
BossInfo = {1999056,4597960.06}, --Boss 信息 ID 和血量
Equipment = {11505,12505,13505}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[8] =    --每个关卡信息 8
{
BossInfo = {1999057,4319654.59}, --Boss 信息 ID 和血量
Equipment = {11405,12405,13405}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[9] =    --每个关卡信息 9
{
BossInfo = {1999058,4286725.19}, --Boss 信息 ID 和血量
Equipment = {11605,12605,13605}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[10] =    --每个关卡信息 10
{
BossInfo = {1999059,5419984.78}, --Boss 信息 ID 和血量
Equipment = {11307,12307,13307}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
}
FactionSceneMap[920600] = 
{
itemlist = --通关后的奖励道具列表
{
 {range = {1,1},reward = {0,800},},
 {range = {2,2},reward = {0,500},},
 {range = {3,3},reward = {0,300},},
 {range = {4,4},reward = {0,270},},
 {range = {5,5},reward = {0,240},},
 {range = {6,6},reward = {0,210},},
 {range = {7,7},reward = {0,180},},
 {range = {8,8},reward = {0,150},},
 {range = {9,9},reward = {0,120},},
 {range = {10,50},reward = {0,100},},
}, 
--itemlist = {11101,11102,11103,11110}, --通关后的奖励道具列表
LimitLevel = 7,    --军团等级限制
LimitPlayerLevel = 30,    --玩家等级限制
LimitContorl = {920500},        --条件限制，副本ID
ActiveValue = 3000,--活跃度
[1] =    --每个关卡信息 1
{
BossInfo = {1999060,4255997.83}, --Boss 信息 ID 和血量
Equipment = {11107,12107,13107}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[2] =    --每个关卡信息 2
{
BossInfo = {1999061,4318922.74}, --Boss 信息 ID 和血量
Equipment = {11207,12207,13207}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[3] =    --每个关卡信息 3
{
BossInfo = {1999062,4456162.04}, --Boss 信息 ID 和血量
Equipment = {11506,12506,13506}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[4] =    --每个关卡信息 4
{
BossInfo = {1999063,4520643.9}, --Boss 信息 ID 和血量
Equipment = {11406,12406,13406}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[5] =    --每个关卡信息 5
{
BossInfo = {1999064,4585372.41}, --Boss 信息 ID 和血量
Equipment = {11606,12606,13606}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[6] =    --每个关卡信息 6
{
BossInfo = {1999065,5497124.55}, --Boss 信息 ID 和血量
Equipment = {11307,12307,13307}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[7] =    --每个关卡信息 7
{
BossInfo = {1999066,5574222.55}, --Boss 信息 ID 和血量
Equipment = {11107,12107,13107}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[8] =    --每个关卡信息 8
{
BossInfo = {1999067,5879960.08}, --Boss 信息 ID 和血量
Equipment = {11207,12207,13207}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[9] =    --每个关卡信息 9
{
BossInfo = {1999068,4532551.95}, --Boss 信息 ID 和血量
Equipment = {11506,12506,13506}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[10] =    --每个关卡信息 10
{
BossInfo = {1999069,4594237.63}, --Boss 信息 ID 和血量
Equipment = {11406,12406,13406}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
}
FactionSceneMap[920700] = 
{
itemlist = --通关后的奖励道具列表
{
 {range = {1,1},reward = {0,800},},
 {range = {2,2},reward = {0,500},},
 {range = {3,3},reward = {0,300},},
 {range = {4,4},reward = {0,270},},
 {range = {5,5},reward = {0,240},},
 {range = {6,6},reward = {0,210},},
 {range = {7,7},reward = {0,180},},
 {range = {8,8},reward = {0,150},},
 {range = {9,9},reward = {0,120},},
 {range = {10,50},reward = {0,100},},
}, 
--itemlist = {11101,11102,11103,11111}, --通关后的奖励道具列表
LimitLevel = 8,    --军团等级限制
LimitPlayerLevel = 30,    --玩家等级限制
LimitContorl = {920600},        --条件限制，副本ID
ActiveValue = 3000,--活跃度
[1] =    --每个关卡信息 1
{
BossInfo = {1999070,4698931.41}, --Boss 信息 ID 和血量
Equipment = {11606,12606,13606}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[2] =    --每个关卡信息 2
{
BossInfo = {1999071,4144956.91}, --Boss 信息 ID 和血量
Equipment = {11307,12307,13307}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[3] =    --每个关卡信息 3
{
BossInfo = {1999072,5307446.87}, --Boss 信息 ID 和血量
Equipment = {11107,12107,13107}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[4] =    --每个关卡信息 4
{
BossInfo = {1999073,5303805.25}, --Boss 信息 ID 和血量
Equipment = {11207,12207,13207}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[5] =    --每个关卡信息 5
{
BossInfo = {1999074,5729636.41}, --Boss 信息 ID 和血量
Equipment = {11506,12506,13506}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[6] =    --每个关卡信息 6
{
BossInfo = {1999075,5884365.04}, --Boss 信息 ID 和血量
Equipment = {11406,12406,13406}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[7] =    --每个关卡信息 7
{
BossInfo = {1999076,6155355.84}, --Boss 信息 ID 和血量
Equipment = {11606,12606,13606}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[8] =    --每个关卡信息 8
{
BossInfo = {1999077,6122178.52}, --Boss 信息 ID 和血量
Equipment = {11307,12307,13307}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[9] =    --每个关卡信息 9
{
BossInfo = {1999078,6520676.96}, --Boss 信息 ID 和血量
Equipment = {11107,12107,13107}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[10] =    --每个关卡信息 10
{
BossInfo = {1999079,6032964.38}, --Boss 信息 ID 和血量
Equipment = {11207,12207,13207}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
}
FactionSceneMap[920800] = 
{
itemlist = --通关后的奖励道具列表
{
 {range = {1,1},reward = {0,800},},
 {range = {2,2},reward = {0,500},},
 {range = {3,3},reward = {0,300},},
 {range = {4,4},reward = {0,270},},
 {range = {5,5},reward = {0,240},},
 {range = {6,6},reward = {0,210},},
 {range = {7,7},reward = {0,180},},
 {range = {8,8},reward = {0,150},},
 {range = {9,9},reward = {0,120},},
 {range = {10,50},reward = {0,100},},
}, 
--itemlist = {11101,11102,11103,11112}, --通关后的奖励道具列表
LimitLevel = 9,    --军团等级限制
LimitPlayerLevel = 30,    --玩家等级限制
LimitContorl = {920700},        --条件限制，副本ID
ActiveValue = 3000,--活跃度
[1] =    --每个关卡信息 1
{
BossInfo = {1999080,4232322.68}, --Boss 信息 ID 和血量
Equipment = {11506,12506,13506}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[2] =    --每个关卡信息 2
{
BossInfo = {1999081,5708986.49}, --Boss 信息 ID 和血量
Equipment = {11406,12406,13406}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[3] =    --每个关卡信息 3
{
BossInfo = {1999082,5049367.88}, --Boss 信息 ID 和血量
Equipment = {11606,12606,13606}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[4] =    --每个关卡信息 4
{
BossInfo = {1999083,5088411.58}, --Boss 信息 ID 和血量
Equipment = {11308,12308,13308}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[5] =    --每个关卡信息 5
{
BossInfo = {1999084,5653294.34}, --Boss 信息 ID 和血量
Equipment = {11108,12108,13108}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[6] =    --每个关卡信息 6
{
BossInfo = {1999085,7160910.48}, --Boss 信息 ID 和血量
Equipment = {11208,12208,13208}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[7] =    --每个关卡信息 7
{
BossInfo = {1999086,6262263.03}, --Boss 信息 ID 和血量
Equipment = {11506,12506,13506}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[8] =    --每个关卡信息 8
{
BossInfo = {1999087,6246646.14}, --Boss 信息 ID 和血量
Equipment = {11406,12406,13406}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[9] =    --每个关卡信息 9
{
BossInfo = {1999088,8432749.01}, --Boss 信息 ID 和血量
Equipment = {11606,12606,13606}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[10] =    --每个关卡信息 10
{
BossInfo = {1999089,6032964.38}, --Boss 信息 ID 和血量
Equipment = {11308,12308,13308}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
}
FactionSceneMap[920900] = 
{
itemlist = --通关后的奖励道具列表
{
 {range = {1,1},reward = {0,800},},
 {range = {2,2},reward = {0,500},},
 {range = {3,3},reward = {0,300},},
 {range = {4,4},reward = {0,270},},
 {range = {5,5},reward = {0,240},},
 {range = {6,6},reward = {0,210},},
 {range = {7,7},reward = {0,180},},
 {range = {8,8},reward = {0,150},},
 {range = {9,9},reward = {0,120},},
 {range = {10,50},reward = {0,100},},
}, 
--itemlist = {11101,11102,11103,11113}, --通关后的奖励道具列表
LimitLevel = 10,    --军团等级限制
LimitPlayerLevel = 30,    --玩家等级限制
LimitContorl = {920800},        --条件限制，副本ID
ActiveValue = 3000,--活跃度
[1] =    --每个关卡信息 1
{
BossInfo = {1999090,8498475.56}, --Boss 信息 ID 和血量
Equipment = {11108,12108,13108}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[2] =    --每个关卡信息 2
{
BossInfo = {1999091,8634934.42}, --Boss 信息 ID 和血量
Equipment = {11208,12208,13208}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[3] =    --每个关卡信息 3
{
BossInfo = {1999092,8685047.57}, --Boss 信息 ID 和血量
Equipment = {11506,12506,13506}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[4] =    --每个关卡信息 4
{
BossInfo = {1999093,9262212.66}, --Boss 信息 ID 和血量
Equipment = {11406,12406,13406}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[5] =    --每个关卡信息 5
{
BossInfo = {1999094,8868184.41}, --Boss 信息 ID 和血量
Equipment = {11606,12606,13606}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[6] =    --每个关卡信息 6
{
BossInfo = {1999095,7490344.89}, --Boss 信息 ID 和血量
Equipment = {11308,12308,13308}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[7] =    --每个关卡信息 7
{
BossInfo = {1999096,7230945.73}, --Boss 信息 ID 和血量
Equipment = {11108,12108,13108}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[8] =    --每个关卡信息 8
{
BossInfo = {1999097,9839111.19}, --Boss 信息 ID 和血量
Equipment = {11208,12208,13208}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[9] =    --每个关卡信息 9
{
BossInfo = {1999098,9509188.33}, --Boss 信息 ID 和血量
Equipment = {11506,12506,13506}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
[10] =    --每个关卡信息 10
{
BossInfo = {1999099,9648294.36}, --Boss 信息 ID 和血量
Equipment = {11406,12406,13406}, --通关后的装备道具列表
Random = {20,60,20},    --通关以后的装备抽取次数，分别递增1，2，3
},
}
