Debriscollect = {}  --ห้ฦฌสีผฏลไึร
Debriscollect = 
{
	[1] = 
	{
		Debris =    --ฐüบฌห้ฦฌนุฟจ
		{
			5,10,15,20,  --ตฺาปธ๖ปีียฐüบฌห้ฦฌนุฟจ
		},
		DebrisAward =  --ปีียฝฑภ๘
		{
			190701,
		},
	},
	[2] = 
	{
		Debris =    --ห้ฦฌ
		{
			25,30,35,40,  --ตฺ2ธ๖ปีียฐüบฌห้ฦฌ
		},
		DebrisAward =  --ปีียฝฑภ๘
		{
			190702,
		},
	},
	[3] = 
	{
		Debris =    --ห้ฦฌ
		{
			45,50,55,60,65,  --ตฺ2ธ๖ปีียฐüบฌห้ฦฌ
		},
		DebrisAward =  --ปีียฝฑภ๘
		{
			190703,
		},
	},		
	[4] = 
	{
		Debris =    --ห้ฦฌ
		{
			70,75,80,85,90,  --ตฺ2ธ๖ปีียฐüบฌห้ฦฌ
		},
		DebrisAward =  --ปีียฝฑภ๘
		{
			190704,
		},
	},
	[5] = 
	{
		Debris =    --ห้ฦฌ
		{
			95,100,105,110,115,120,  --ตฺ2ธ๖ปีียฐüบฌห้ฦฌ
		},
		DebrisAward =  --ปีียฝฑภ๘
		{
			190705,
		},
	},
	[6] = 
	{
		Debris =    --ห้ฦฌ
		{
			125,130,135,140,145,150,  --ตฺ2ธ๖ปีียฐüบฌห้ฦฌ
		},
		DebrisAward =  --ปีียฝฑภ๘
		{
			190706,
		},
	},
	[7] = 
	{
		Debris =    --ห้ฦฌ
		{
			155,160,165,170,175,180,185,  --ตฺ2ธ๖ปีียฐüบฌห้ฦฌ
		},
		DebrisAward =  --ปีียฝฑภ๘
		{
			190707,
		},
	},
	[8] = 
	{
		Debris =    --ห้ฦฌ
		{
			190,195,200,205,210,215,220,  --ตฺ2ธ๖ปีียฐüบฌห้ฦฌ
		},
		DebrisAward =  --ปีียฝฑภ๘
		{
			190708,
		},
	},
	[9] = 
	{
		Debris =    --ห้ฦฌ
		{
			225,230,235,240,245,250,255,258,  --ตฺ2ธ๖ปีียฐüบฌห้ฦฌ
		},
		DebrisAward =  --ปีียฝฑภ๘
		{
			190709,
		},
	},
}