任务表 = {}



-----------------------------------------------------------------------------------少林

任务表[1] = 
{
	任务链名称   = "少林新手任务系列",
	起始任务     = "【主线】拜入少林"
}

任务表[1][1] = 
{
	任务名称 = "【主线】拜入少林",

	交任务npcid = 5,

	任务说明 = "少林乃天下第一名刹，更是武林泰山北斗。此时初进山门，当找个师兄引荐一番。（可鼠标左键单击带下划线名称自动寻路）。",

	客服端接受事件 = {"xunlu"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 0, 
		level = 1,
	},
	完成条件 = 
	{
		
	},
	完成奖励 = 
	{
      giveGoods = {give={{1,10},{11,10}}},
	},

	-- 剧情信息
	接任务剧情id = 1*100000+46,
	交任务剧情id = 1*100000+47,
}

任务表[1][2] = 
{
	任务名称 = "【主线】少林武艺",

	接任务npcid = 5,
	交任务npcid = 5,

	任务说明 = "武林之中以少林武学最为博大精深，澄空师叔传你入门基本武功，今后你当勤加练习。",

	客服端接受事件 = {"chengkong1"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 0, 
		completed={1001},
	},
	完成条件 = 
	{
		
	},
	完成延时 = 5,
	完成奖励 = 
	{
     skill = {{1,2}},
     giveGoods = {give={{10000,1}}},
	},

	-- 剧情信息
	接任务剧情id = 1*100000+47,
	交任务剧情id = 1*100000+48
}

任务表[1][3] = 
{
	任务名称 = "【主线】装备禅杖",

	接任务npcid = 5,
	交任务npcid = 5,

	任务说明 = "将澄空传你的禅杖装备上，此番当可使你如虎添翼。",

	客服端接受事件 = {"beibao"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 0, 
		completed={1002},
	},
	完成条件 = 
	{
     ei = {10000},
	},
	完成奖励 = 
	{
        giveExp = 50,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+48,
	交任务剧情id = 1*100000+49,
	交任务未完成剧情id = 1*100000+50,
}

任务表[1][4] = 
{
	任务名称 = "【主线】劈柴烧火",

	接任务npcid = 5,
	交任务npcid = 8,

	任务说明 = "澄空师叔让你带几块朽木柴火给香积厨的管事伙头。",

	客服端接受事件 = {"wugongzy"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 0, 
		completed={1003},
	},
	完成条件 = 
	{
      items = {{4000,5,{101,20,69}}},
	},
	完成奖励 = 
	{
		giveExp = 120,
      giveGoods = {give={{20000,1}}}
	},

	-- 剧情信息
	接任务剧情id = 1*100000+49,
	交任务剧情id = 1*100000+51,
	接任务未完成剧情id = 1*100000+52,
	交任务未完成剧情id = 1*100000+53,
}

任务表[1][5] = 
{
	任务名称 = "【主线】耀武扬威",

	接任务npcid = 8,
	交任务npcid = 4,

	任务说明 = "据说澄武师叔会被派往华山参加论剑盛会，也不知真假，先去探探他的口风。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 0, 
		completed={1004},
	},
	完成条件 = 
	{
		
	},
	完成奖励 = 
	{
		giveExp = 60,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+51,
	交任务剧情id = 1*100000+54,
}

任务表[1][6] = 
{
	任务名称 = "【主线】失踪英雄帖",

	接任务npcid = 4,
	交任务npcid = 8,

	任务说明 = "澄武师叔居然不慎将英雄帖遗失，此事还是先去告知伙头师兄一声为好，看他如何盘算。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 0, 
		completed={1005},
	},
	完成条件 = 
	{
		
	},
	完成奖励 = 
	{
         giveExp = 60,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+54,
	交任务剧情id = 1*100000+55
}

任务表[1][7] = 
{
	任务名称 = "【主线】大闹宝殿",

	接任务npcid = 8,
	交任务npcid = 1,

	任务说明 = "大雄宝殿之前玄慈方丈正在召开集会商讨华山论剑的事宜，火工头陀若要捣乱，必是从此处下手，还需速速赶往通知玄慈方丈。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 0, 
		completed={1006},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
		giveExp = 80,
      giveGoods = {give={{20009,1}}}
	},

	-- 剧情信息
	接任务剧情id = 1*100000+55,
	交任务剧情id = 1*100000+56
}

任务表[1][8] = 
{
	任务名称 = "【主线】追击木人巷",

	接任务npcid = 1,
	交任务npcid = 11,

	任务说明 = "火工头陀打伤数名少林僧人之后，径直朝木人巷方向奔去，少林重宝原来才是他的真正目的，务必要阻住此人去路。",

	客服端接受事件 = {"beibao"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 0, 
		completed={1007},
	},
	完成条件 = 
	{

	},
	完成奖励 = 
	{
      giveGoods = {give={{20018,1},{1,10},{11,10}}},
	},

	-- 剧情信息
	接任务剧情id = 1*100000+56,
	交任务剧情id = 1*100000+1
}
-----------
任务表[1][9] = 
{
	任务名称 = "【主线】基本功房",

	接任务npcid = 11,
	交任务npcid = 12,

	任务说明 = "木人巷不可轻易擅入，无论来者身份为何，都得以身试之。各层均有把守，要想通过，需得步步为营，层层闯关。",

	客服端接受事件 = {"beibao"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 0, 
		completed={1008},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+1,
	交任务剧情id = 1*100000+2,
}

任务表[1][10] = 
{
	任务名称 = "【主线】击败桐木人",

	接任务npcid = 12,
	交任务npcid = 6,

	任务说明 = "木人巷不可轻易擅入，无论来者身份为何，都得以身试之。各层均有把守，要想通过，需得步步为营，层层闯关。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 0, 
		completed={1009},
	},
	完成条件 = 
	{
     kill = { "桐木人", 6 ,{102,55,59}},
	},
	完成奖励 = 
	{
        giveExp = 300,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+2,
	交任务剧情id = 1*100000+57,
	接任务未完成剧情id = 1*100000+3,
	交任务未完成剧情id = 1*100000+4,
}

任务表[1][11] = 
{
	任务名称 = "【主线】少林轻功",

	接任务npcid = 6,
	交任务npcid = 6,

	任务说明 = "火工头陀的身手远在你之上，晦明师兄要传你少林轻功步伐，待到必要之时也可作保命之用。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    callFunction = "SLqinggong"
	},
	接受条件 = {
		school = 0, 
		completed={1010},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
	giveExp = 100,
        skill = {{2,1}},
	giveGoods = {give={{1,10},{11,10}}},
	},

	-- 剧情信息
	接任务剧情id = 1*100000+57,
	交任务剧情id = 1*100000+58,
}

任务表[1][12] = 
{
	任务名称 = "【主线】阵中取匙",

	接任务npcid = 6,
	交任务npcid = 6,

	任务说明 = "由许多铁钉围成的一个阵势，晦明将天工锁匙放置在七巧机关之中，若你能自木人桩上通过，取出此物交还给他，便可算功成，自然也可继续前行。",

	客服端接受事件 = {"qinggongzy"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    callFunction = "OnClickTask50025"
	},
	接受条件 = {
		school = 0, 
		completed={1011},
	},
	完成条件 = 
	{
      items = {{4001,1,{104,69,98}}},
	},
	完成奖励 = 
	{
	giveExp = 100,
      giveGoods = {give={{20036,1},{1,10}}}
	},

	-- 剧情信息
	接任务剧情id = 1*100000+58,
	交任务剧情id = 1*100000+59,
	接任务未完成剧情id = 1*100000+60
}

任务表[1][13] = 
{
	任务名称 = "【主线】二重考验",

	接任务npcid = 6 ,
	交任务npcid = 2 ,

	任务说明 = "通过了木人巷轻功房，下一个地方就是招式房了，也不知守在那里的澄受师叔会出什么难题。",

	客服端接受事件 = {"beibao"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 0, 
		completed={1012},
	},
	完成条件 = 
	{
  
	},
	完成奖励 = 
	{
     giveGoods = {give={{20027,1}}},
	},

	-- 剧情信息
	接任务剧情id = 1*100000+59,
	交任务剧情id = 1*100000+64
}

任务表[1][14] = 
{
	任务名称 = "【主线】少林绝学",

	接任务npcid = 2 ,
	交任务npcid = 2 ,

	任务说明 = "澄受师叔决定传你少林绝学，希望你学成之后能够阻住火工头陀的去路。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 0, 
		completed={1013},
	},
	完成条件 = 
	{
     
	},
	完成奖励 = 
	{
	giveExp = 100,
     skill = {{1,7}} 
	},

	-- 剧情信息
	接任务剧情id = 1*100000+64,
	交任务剧情id = 1*100000+65,
}

任务表[1][15] = 
{
	任务名称 = "【主线】戒律罗汉",

	接任务npcid = 2 ,
	交任务npcid = 7 ,

	任务说明 = "那些戒律罗汉，个个铜头铁臂，武艺高强，要想通过，实属不易",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 0, 
		completed={1014},
	},
	完成条件 = 
	{
     kill = { "戒律罗汉", 10 ,{106,39,83}},
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+65,
	交任务剧情id = 1*100000+61,
   接任务未完成剧情id = 1*100000+67,
   交任务未完成剧情id = 1*100000+5,
}

任务表[1][16] = 
{
	任务名称 = "【主线】护体神功",

	接任务npcid = 7 ,
	交任务npcid = 7 ,

	任务说明 = "晦恶师兄居然肯传授你金钟罩护体神功，如此见到火工头陀也可多一份获胜的把握，按他要求收拾掉几个黄铜人，露一手给他看看。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 0, 
		completed={1015},
	},
	完成条件 = 
	{
     kill = { "黄铜人", 10 ,{108,44,68}},
	},
	完成奖励 = 
	{
       giveExp = 200,
       skill = {{3,1}}
	},

	-- 剧情信息
	接任务剧情id = 1*100000+61,
	交任务剧情id = 1*100000+62,
	交任务未完成剧情id = 1*100000+63,
}


任务表[1][17] = 
{
	任务名称 = "【主线】禁地通道",

	接任务npcid = 7 ,
	交任务npcid = 13 ,

	任务说明 = "前方不远就是木人巷禁地了，尚不知有何种危险在那里潜伏着。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 0, 
		completed={1016},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
      giveExp = 200,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+62,
	交任务剧情id = 1*100000+6,
}

任务表[1][18] = 
{
	任务名称 = "【主线】火工头陀",

	接任务npcid = 13 ,
	交任务npcid = 1 ,

	任务说明 = "虽知前方必有凶险，但身为少林弟子岂可视本门珍宝被窃而不顾，正是明知山有虎，偏向虎山行。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 0, 
		completed={1017},
	},
	完成条件 = 
	{
     kill = { "火工头陀", 1,{110,32,29}}
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+6,
	交任务剧情id = 1*100000+69,
}

任务表[1][20] = 
{
	任务名称 = "【主线】华山论剑",

	接任务npcid = 1 ,
	交任务npcid = 5 ,

	任务说明 = "玄慈方丈鉴于你此次护寺有功，决定让你随澄空共赴华山，去见识这一场武林盛会。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {"beibao"
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 0, 
		completed={1018},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
	giveExp = 500,
      giveGoods = {give={{30001,1}}}
	},

	-- 剧情信息
	接任务剧情id = 1*100000+69,
	交任务剧情id = 1*100000+72,
}

任务表[1][21] = 
{
	任务名称 = "【主线】驿站传送",

	接任务npcid = 5 ,
	交任务npcid = 89 ,

	任务说明 = "前往门派驿站，通过这里传送到京城。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 0, 
		completed={1020},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+72,
	交任务剧情id = 1*100000+196,
}

--------------------------------华山
--------------------------------论剑

任务表[1][25] = 
{
	任务名称 = "【主线】武林盟接引",

	接任务npcid = 89 ,
	交任务npcid = 86 ,

	任务说明 = "一路风尘，沿途辛苦，就在京城之地稍作歇息再上路吧。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
	 callFunction = "GoJC"
	},
	接受条件 = {
		school = 0, 
		completed={1021},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+196,
	交任务剧情id = 1*100000+180,
}

-------

任务表[1][22] = 
{
	任务名称 = "【主线】华山山脚",

	接任务npcid = 86,
	交任务npcid = 87,

	任务说明 = "在京城暂作歇息，待养足精神之后，即可踏上去华山的道路。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 0, 
		completed={1025},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+180,
	交任务剧情id = 1*100000+181,
}

任务表[1][23] = 
{
	任务名称 = "【主线】华山山脚",

	接任务npcid = 87,
	交任务npcid = 95,

	任务说明 = "华山脚下，众门派弟子乱作一团，只为争那前去观摩华山论剑盛会的资格。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 0, 
		completed={1022},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+181,
	交任务剧情id = 1*100000+194,
}

--------------------------
任务表[1][26] = 
{
	任务名称 = "【主线】较量峨嵋派",

	接任务npcid = 95,
	交任务npcid = 96,

	任务说明 = "峨嵋派弟子虽皆为女流之辈，然个个巾帼不让须眉，想要战胜她们可不太容易。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		callFunction = "OnClickTask50017"
	},
	接受条件 = {
		school = 0, 
		completed={1023},
	},
	完成条件 = 
	{
      kill = {{"峨眉派弟子", 1}},
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+194,
	交任务剧情id = 1*100000+201,
	接任务未完成剧情id = 1*100000+195,
	交任务未完成剧情id = 1*100000+202,
}

任务表[1][27] = 
{
	任务名称 = "【主线】较量武当派",

	接任务npcid = 96,
	交任务npcid = 97,

	任务说明 = "武当派弟子系出大家，饶有风范，一柄宝剑在手立于当前，尤显威风凛凛。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		callFunction = "OnClickTask50018"
	},
	接受条件 = {
		school = 0, 
		completed={1026},
	},
	完成条件 = 
	{
      kill = {{"武当派弟子", 2}},
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+201,
	交任务剧情id = 1*100000+203,
	接任务未完成剧情id = 1*100000+204,
	交任务未完成剧情id = 1*100000+205,
}

任务表[1][28] = 
{
	任务名称 = "【主线】较量圣火教",

	接任务npcid = 97,
	交任务npcid = 98,

	任务说明 = "圣火教门徒继承火的意志，行事张扬，敢作敢为，武技大开大合，颇有气势。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		callFunction = "OnClickTask50019"
	},
	接受条件 = {
		school = 0, 
		completed={1027},
	},
	完成条件 = 
	{
      kill = {{"圣火教弟子", 3}},
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+203,
	交任务剧情id = 1*100000+206,
	接任务未完成剧情id = 1*100000+207,
	交任务未完成剧情id = 1*100000+208,
}

任务表[1][29] = 
{
	任务名称 = "【主线】较量星宿派",

	接任务npcid = 98,
	交任务npcid = 99,

	任务说明 = "星宿派弟子行事诡秘，善用阴毒暗器药物，要对付他们需要多加留心。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		callFunction = "OnClickTask50020"
	},
	接受条件 = {
		school = 0, 
		completed={1028},
	},
	完成条件 = 
	{
      kill = {{"星宿派弟子", 4}},
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+206,
	交任务剧情id = 1*100000+209,
	接任务未完成剧情id = 1*100000+210,
	交任务未完成剧情id = 1*100000+211,
}
--------------------------

任务表[1][24] = 
{
	任务名称 = "【主线】华山一役",

	接任务npcid = 99,
	交任务npcid = 87,

	任务说明 = "华山山顶，各路英豪大展拳脚。这正是“武林群英齐荟萃，八方豪杰聚华山”。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 0, 
		completed={1029},
	},
	完成条件 = 
	{
      me = {{73,17,45,6,"HSLJ"}},
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+209,
}

----------------------------------------
----------------------------------------峨眉

任务表[2] = 
{
	任务链名称   = "峨眉新手任务系列",
	起始任务     = "【主线】拜入峨眉"
}

任务表[2][1] = 
{
	任务名称 = "【主线】拜入峨眉",

	交任务npcid = 14,

	任务说明 = "峨眉山清水秀、地灵人杰，乃中原武术中流砥柱。若能拜到灭绝师太门下，日后行走江湖必能如鱼得水。",

	客服端接受事件 = {"xunlu"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 1, 
		level = 1,
	},
	完成条件 = 
	{
		
	},
	完成奖励 = 
	{
      giveGoods = {give={{1,10},{11,10}}},
	},

	-- 剧情信息
	接任务剧情id = 1*100000+19,
	交任务剧情id = 1*100000+20
}

任务表[2][2] = 
{
	任务名称 = "【主线】入门武学",

	接任务npcid = 14,
	交任务npcid = 14,

	任务说明 = "灭绝师太传你峨眉一式武功，学成之后，有事交代与你。",

   客服端接受事件 = {
        "miejue1"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
         
	},
	接受条件 = {
		school = 1, 
		completed={2001},
	},
	完成延时 = 5,
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
		skill = {{1,54}},
      giveGoods = {give={{10360,1},{1,10},{11,10}}},
	},

	-- 剧情信息
	接任务剧情id = 1*100000+20,
	交任务剧情id = 1*100000+18
}


--------------------------
任务表[2][18] = 
{
	任务名称 = "【主线】趁手武器",

	接任务npcid = 14,
	交任务npcid = 14,

	任务说明 = "挑选一把趁手的武器，拿在手中试试身手，给师父看看。",
 
   客服端接受事件 = {"beibao"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 1, 
		completed={2002},
	},
	完成条件 = 
	{
     ei = {10360},
	},
	完成奖励 = 
	{
         giveExp = 25,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+18,
	交任务剧情id = 1*100000+21,
	交任务未完成剧情id = 1*100000+17
}
--------------------------

任务表[2][3] = 
{
	任务名称 = "【主线】赤狐之血",

	接任务npcid = 14,
	交任务npcid = 14,

	任务说明 = "灭绝师太震怒，势要让张无忌求生不得、求死不能，你去帮她找来配置毒药的其中一味材料。",

   客服端接受事件 = {"wugongzy"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 1, 
		completed={2018},
	},
	完成条件 = 
	{
      items = {{4032,5,{7,18,243}}},---------赤狐之血
	},
	完成奖励 = 
	{
		giveExp = 150,
      giveGoods = {give={{23000,1}}},
	},

	-- 剧情信息
	接任务剧情id = 1*100000+21,
	交任务剧情id = 1*100000+22,
	交任务未完成剧情id = 1*100000+23
}


任务表[2][4] = 
{
	任务名称 = "【主线】温婉美人",

	接任务npcid = 14,
	交任务npcid = 20,

	任务说明 = "纪晓芙温婉美丽，与人和善。师父让你去找她要来灯心草，不知为了何故。",

   客服端接受事件 = {"beibao"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 1, 
		completed={2003},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
       giveExp = 150,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+22,
	交任务剧情id = 1*100000+24,
}


任务表[2][5] = 
{
	任务名称 = "【主线】峨眉轻功",

	接任务npcid = 20,
	交任务npcid = 20,

	任务说明 = "纪晓芙传你峨眉轻功，以便让你自己上到悬崖采集灯心草，你当用心学习。",

   客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 1, 
		completed={2004},
	},
	完成条件 = 
	{
		
	},
	完成奖励 = 
	{
      skill = {{2,7}},
      giveGoods = {give={{16,5}}},
      giveExp = 200,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+24,
	交任务剧情id = 1*100000+25
}


任务表[2][6] = 
{
	任务名称 = "【主线】悬灯之草",

	接任务npcid = 20,
	交任务npcid = 14,

	任务说明 = "去山崖之上采下几株灯心草交给师父，她老人家一定等急了。",

   客服端接受事件 = {"qinggongzy"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		callFunction = "OnClickTask50011"
	},
	接受条件 = {
		school = 1, 
		completed={2005},
	},
	完成条件 = 
	{
     items = {{4019,1}}
	},
	完成奖励 = 
	{
      giveGoods = {give={{23009,1}}},
      giveExp = 250,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+25,
	交任务剧情id = 1*100000+26,
	接任务未完成剧情id = 1*100000+16,
}


任务表[2][7] = 
{
	任务名称 = "【主线】监视芷若",

	接任务npcid = 14,
	交任务npcid = 19,

	任务说明 = "周芷若仍然犹豫不决，师父决定让你暗中监视她的动静，一旦有变，立即禀报。",

   客服端接受事件 = {"beibao"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 1, 
		completed={2006},
	},
	完成条件 = 
	{
		
	},
	完成奖励 = 
	{
      skill = {{1,59}},
      giveGoods = {give={{1,10},{11,10}}},
      giveExp = 200,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+26,
	交任务剧情id = 1*100000+27
}


任务表[2][8] = 
{
	任务名称 = "【主线】金顶采茶",

	接任务npcid = 19,
	交任务npcid = 18,

	任务说明 = "周芷若心神不宁，看起来还在为刚才的事闹心，替她跑一趟吧，去到金顶之上。",

   客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 1, 
		completed={2007},
	},
	完成条件 = 
	{
		
	},
	完成奖励 = 
	{
            giveExp = 200,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+27,
	交任务剧情id = 1*100000+28
}

任务表[2][9] = 
{
	任务名称 = "【主线】豹猫肆虐",

	接任务npcid = 18,
	交任务npcid = 15,

	任务说明 = "前往茶园的路上，豹猫肆虐，袭扰路人，若想顺利通过，看来先得教训教训这些畜生。",

   客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 1, 
		completed={2008},
	},
	完成条件 = 
	{
		kill = {"豹猫" , 5 , {7,26,107}},
	},
	完成奖励 = 
	{
		giveExp = 300,
      giveGoods = {give={{23018,1}}},
	},

	-- 剧情信息
	接任务剧情id = 1*100000+28,
	交任务剧情id = 1*100000+29,
	接任务未完成剧情id = 1*100000+30,
	交任务未完成剧情id = 1*100000+31
}

任务表[2][10] = 
{
	任务名称 = "【主线】清除杂草",

	接任务npcid = 15,
	交任务npcid = 15,

	任务说明 = "杂草丛生，严重影响了茶树的生长，帮静念师太补给茶树的养分。（鼠标左键点击枯萎的茶树）",

   客服端接受事件 = {"beibao"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
     items = {{4016,1}},
	},
	接受条件 = {
		school = 1, 
		completed={2009},
	},
	完成条件 = 
	{
      items = {{4016,1}},
		nc = { 68,69,70}
	},
	完成奖励 = 
	{
		giveExp = 100,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+29,
	交任务剧情id = 1*100000+32,
	交任务未完成剧情id = 1*100000+33
}

任务表[2][11] = 
{
	任务名称 = "【主线】虫灾泛滥",

	接任务npcid = 15,
	交任务npcid = 15,

	任务说明 = "因为疏于管理，茶园之中已经满是蛀虫，眼看着嫩绿的茶叶就这样被侵蚀，看来得除去这些小东西。",

   客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 1, 
		completed={2010},
	},
	完成条件 = 
	{
     items = {{4033,5}}
	},
	完成奖励 = 
	{
		giveExp = 100,
      giveGoods = {give={{23027,1}}},
	},

	-- 剧情信息
	接任务剧情id = 1*100000+32,
	交任务剧情id = 1*100000+34,
	交任务未完成剧情id = 1*100000+35
}

任务表[2][12] = 
{
	任务名称 = "【主线】机灵猴子",

	接任务npcid = 15,
	交任务npcid = 15,

	任务说明 = "此处本是这些机灵猴的地盘，只因或许打扰了它们，所以难免惹得这些猴子前来捣乱，教训教训它们一下也好。",

   客服端接受事件 = {"beibao"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 1, 
		completed={2011},
	},
	完成条件 = 
	{
		kill = {"机灵猴" , 5 , {7,177,70}}, 
	},
	完成奖励 = 
	{
		giveExp = 100,
      giveGoods = {give={{23036,1}}},
	},

	-- 剧情信息
	接任务剧情id = 1*100000+34,
	交任务剧情id = 1*100000+36,
	交任务未完成剧情id = 1*100000+37
}

任务表[2][13] = 
{
	任务名称 = "【主线】带回茶叶",

	接任务npcid = 15,
	交任务npcid = 19,

	任务说明 = "这些茶叶得来实在不易，还是快些送交到周芷若的手中去吧。",

   客服端接受事件 = {"beibao"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
     items = {{4002,1}},
	},
	接受条件 = {
		school = 1, 
		completed={2012},
	},
	完成条件 = 
	{
     items = {{4002,1}},
	},
	完成奖励 = 
	{
      giveGoods = {give={{23045,1}}},
	},

	-- 剧情信息
	接任务剧情id = 1*100000+36,
	交任务剧情id = 1*100000+38
}

任务表[2][14] = 
{
	任务名称 = "【主线】防人之口",

	接任务npcid = 19,
	交任务npcid = 14,

	任务说明 = "丁敏君说要去师父面前揭发周芷若与张无忌的暧昧关系，如此经她添油加醋的一说事情可就闹大了，赶紧去师父那儿看看。",

   客服端接受事件 = {"beibao"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 1, 
		completed={2013},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
      giveGoods = {give={{1,10}}},
	},

	-- 剧情信息
	接任务剧情id = 1*100000+38,
	交任务剧情id = 1*100000+39,
}

任务表[2][15] = 
{
	任务名称 = "【主线】鸿门之约",

	接任务npcid = 14,
	交任务npcid = 21,

	任务说明 = "丁敏君临走之时让你去找她，说是要指点你一下武功，不妨前去看看。",

   客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 1, 
		completed={2014},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+39,
	交任务剧情id = 1*100000+40,
}

任务表[2][16] = 
{
	任务名称 = "【主线】凶相毕露",

	接任务npcid = 21,
	交任务npcid = 14,

	任务说明 = "果不其然，丁敏君心中对你记恨，就要对你下手。",

   客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		callFunction = "OnClickTask50002"
	},
	接受条件 = {
		school = 1, 
		completed={2015},
	},
	完成条件 = 
	{
      kill = { "丁敏君" , 1 }
	},
	完成奖励 = 
	{
		giveExp = 450,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+40,
	交任务剧情id = 1*100000+41,
	接任务未完成剧情id = 1*100000+42
}

任务表[2][17] = 
{
	任务名称 = "【主线】华山论剑",

	接任务npcid = 14 ,
	交任务npcid = 14 ,

	任务说明 = "看你出手敏捷，剑法洒脱，实乃可造之材。你就和芷若一道上华山参加论剑大会去吧。",

   客服端接受事件 = {
	},
	
	客服端完成事件 = {"beibao"
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 1, 
		completed={2016},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
      giveGoods = {give={{30001,1}}}
	},

	-- 剧情信息
	接任务剧情id = 1*100000+41,
	交任务剧情id = 1*100000+43,
}

任务表[2][19] = 
{
	任务名称 = "【主线】驿站传送",

	接任务npcid = 14 ,
	交任务npcid = 90 ,

	任务说明 = "前往门派驿站，通过这里传送到京城。",

   客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 1, 
		completed={2017},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+43,
	交任务剧情id = 1*100000+197,
}

--------------------------------华山
--------------------------------论剑

任务表[2][23] = 
{
	任务名称 = "【主线】武林盟接引",

	接任务npcid = 90 ,
	交任务npcid = 86 ,

	任务说明 = "一路风尘，沿途辛苦，就在京城之地稍作歇息再上路吧。",

   客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
	 callFunction = "GoJC"
	},
	接受条件 = {
		school = 1, 
		completed={2019},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+197,
	交任务剧情id = 1*100000+182,
}

-----------

任务表[2][20] = 
{
	任务名称 = "【主线】华山山脚",

	接任务npcid = 86,
	交任务npcid = 87,

	任务说明 = "在京城暂作歇息，待养足精神之后，即可踏上去华山的道路。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 1, 
		completed={2023},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+182,
	交任务剧情id = 1*100000+183,
}

任务表[2][21] = 
{
	任务名称 = "【主线】华山一役",

	接任务npcid = 87,
	交任务npcid = 94,

	任务说明 = "华山脚下，众门派弟子乱作一团，只为争那前去观摩华山论剑盛会的资格。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 1, 
		completed={2020},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+183,
	交任务剧情id = 1*100000+193,
}

-------------------------
任务表[2][24] = 
{
	任务名称 = "【主线】较量少林派",

	接任务npcid = 94,
	交任务npcid = 96,

	任务说明 = "少林派弟子个个金刚铁骨，武艺精湛，想从他们面前通过不是能够轻易办到的。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		callFunction = "OnClickTask50021"
	},
	接受条件 = {
		school = 1, 
		completed={2021},
	},
	完成条件 = 
	{
      kill = {{"少林派弟子", 1}},
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+193,
	交任务剧情id = 1*100000+212,
	接任务未完成剧情id = 1*100000+213,
	交任务未完成剧情id = 1*100000+202,
}

任务表[2][25] = 
{
	任务名称 = "【主线】较量武当派",

	接任务npcid = 96,
	交任务npcid = 97,

	任务说明 = "武当派弟子系出大家，饶有风范，一柄宝剑在手立于当前，尤显威风凛凛。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		callFunction = "OnClickTask50018"
	},
	接受条件 = {
		school = 1, 
		completed={2024},
	},
	完成条件 = 
	{
      kill = {{"武当派弟子", 2}},
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+212,
	交任务剧情id = 1*100000+215,
	接任务未完成剧情id = 1*100000+204,
	交任务未完成剧情id = 1*100000+205,
}

任务表[2][26] = 
{
	任务名称 = "【主线】较量圣火教",

	接任务npcid = 97,
	交任务npcid = 98,

	任务说明 = "圣火教门徒继承火的意志，行事张扬，敢作敢为，武技大开大合，颇有气势。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		callFunction = "OnClickTask50019"
	},
	接受条件 = {
		school = 1, 
		completed={2025},
	},
	完成条件 = 
	{
      kill = {{"圣火教弟子", 3}},
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+215,
	交任务剧情id = 1*100000+216,
	接任务未完成剧情id = 1*100000+207,
	交任务未完成剧情id = 1*100000+208,
}

任务表[2][27] = 
{
	任务名称 = "【主线】较量星宿派",

	接任务npcid = 98,
	交任务npcid = 99,

	任务说明 = "星宿派弟子行事诡秘，善用阴毒暗器药物，要对付他们需要多加留心。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		callFunction = "OnClickTask50020"
	},
	接受条件 = {
		school = 1, 
		completed={2026},
	},
	完成条件 = 
	{
      kill = {{"星宿派弟子", 4}},
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+216,
	交任务剧情id = 1*100000+217,
	接任务未完成剧情id = 1*100000+210,
	交任务未完成剧情id = 1*100000+211,
}
-------------------------

任务表[2][22] = 
{
	任务名称 = "【主线】华山一役",

	接任务npcid = 99,
	交任务npcid = 87,

	任务说明 = "华山山顶，各路英豪大展拳脚。这正是“武林群英齐荟萃，八方豪杰聚华山”。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 1, 
		completed={2027},
	},
	完成条件 = 
	{
      me = {{73,17,45,6,"HSLJ"}},
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+217,
}
----------------------------------------圣火

任务表[3] = 
{
	任务链名称   = "圣火新手任务系列",
	起始任务     = "【主线】拜入圣火"
}

任务表[3][1] = 
{
	任务名称 = "【主线】拜见蝠王",

	交任务npcid = 32,

	任务说明 = "得蒙青翼蝠王韦一笑赏识，加入圣火教派，此后行事皆以圣火宗旨而为。",

	客服端接受事件 = {"xunlu"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
	 
	},
	接受条件 = {
		school = 3, 
		level = 1,
	},
	完成条件 = 
	{
		
	},
	完成奖励 = 
	{
        giveGoods = {give={{1,10},{11,10}}},
	},

	-- 剧情信息
	接任务剧情id = 1*100000+145,
	交任务剧情id = 1*100000+146
}

任务表[3][2] = 
{
	任务名称 = "【主线】圣火刀法",

	接任务npcid = 32,
	交任务npcid = 28,

	任务说明 = "为便于你行事，蝠王让你去找范右使学习圣火刀法，此乃入门修习第一重。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 3, 
		completed={3001},
	},
	完成条件 = 
	{
		
	},
	完成奖励 = 
	{
      
	},

	-- 剧情信息
	接任务剧情id = 1*100000+146,
	交任务剧情id = 1*100000+147,
}

任务表[3][3] = 
{
	任务名称 = "【主线】获得馈赠",

	接任务npcid = 28,
	交任务npcid = 28,

	任务说明 = "蒙范右使亲自指点圣火入门刀法，你需仔细琢磨其中的精要。",

	客服端接受事件 = {"fanyao1"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 3, 
		completed={3002},
	},
	完成延时 = 5,
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
     skill = {{1,158}},
     giveGoods = {give={{10540,1},{1,10},{11,10}}},
	},

	-- 剧情信息
	接任务剧情id = 1*100000+147,
	交任务剧情id = 1*100000+148,
	交任务未完成剧情id = 1*100000+149
}

任务表[3][4] = 
{
	任务名称 = "【主线】趁手兵器",

	接任务npcid = 28,
	交任务npcid = 28,

	任务说明 = "将范右使赠你的宝刀拿在手中让他瞧瞧。",

	客服端接受事件 = {"beibao"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 3, 
		completed={3003},
	},
	完成条件 = 
	{
    ei = {10540},
	},
	完成奖励 = 
	{
       giveExp = 50,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+148,
	交任务剧情id = 1*100000+150,
	交任务未完成剧情id = 1*100000+151
}

任务表[3][5] = 
{
	任务名称 = "【主线】取血蝙蝠",

	接任务npcid = 28,
	交任务npcid = 32,

	任务说明 = "自范右使那儿习得圣火刀法，又得赠宝刀，此刻再上冰火岛对付那些吸血蝙蝠应该不成问题了。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 3, 
		completed={3004},
	},
	完成条件 = 
	{
      items = {{4007,5,{9,140,207}}},
	},
	完成奖励 = 
	{ 
       giveExp = 150,
       giveGoods = {give={{24000,1}}},
	},

	-- 剧情信息
	接任务剧情id = 1*100000+150,
	交任务剧情id = 1*100000+152,
	接任务未完成剧情id = 1*100000+153,
	交任务未完成剧情id = 1*100000+154,
}

任务表[3][6] = 
{
	任务名称 = "【主线】左使杨逍",

	接任务npcid = 32,
	交任务npcid = 27,

	任务说明 = "为保鹰王之命，需得用上那紫悬草，此物左使杨逍知晓，去找他问问。",

	客服端接受事件 = {"beibao"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 3, 
		completed={3005},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{ 
     giveExp = 100,
     giveGoods = {give={{24027,1}}},
	},

	-- 剧情信息
	接任务剧情id = 1*100000+152,
	交任务剧情id = 1*100000+155,
}

任务表[3][7] = 
{
	任务名称 = "【主线】圣火轻功",

	接任务npcid = 27,
	交任务npcid = 27,

	任务说明 = "紫悬草位于山岩之上，不易采得，若不习得圣火轻功怕是难以上去。",

	客服端接受事件 = {"beibao"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 3, 
		completed={3006},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
       skill = {{2,19}},
       giveExp = 100,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+155,
	交任务剧情id = 1*100000+156
}

任务表[3][8] = 
{
	任务名称 = "【主线】救命之草",

	接任务npcid = 27,
	交任务npcid = 31,

	任务说明 = "在山岩之上采得紫悬草后，将它交给殷天正用以疗伤。",

	接受事件 = 
   {
	 callFunction = "OnClickTask50015"
	},
	接受条件 = {
		school = 3, 
		completed={3007},
	},
	完成条件 = 
	{
      items = {{4003,1}},
	},
	完成奖励 = 
	{
	giveGoods = {give={{24036,1}}},
        giveExp = 100,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+156,
	交任务剧情id = 1*100000+157,
	接任务未完成剧情id = 1*100000+158,
	交任务未完成剧情id = 1*100000+159,
}

任务表[3][9] = 
{
	任务名称 = "【主线】问询龙王",

	接任务npcid = 31,
	交任务npcid = 30,

	任务说明 = "龙王虽为四大护法之首，然其实功力稍逊色其余诸人，这次所受之伤只怕不轻。",

	客服端接受事件 = {"beibao"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 3, 
		completed={3008},
	},
	完成条件 = 
	{
      
	},
	完成奖励 = 
	{
        giveExp = 100,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+157,
	交任务剧情id = 1*100000+160,
}

任务表[3][10] = 
{
	任务名称 = "【主线】金花银叶",

	接任务npcid = 30,
	交任务npcid = 36,

	任务说明 = "黛绮丝要你去找小昭讨要回生丸，只需向她提起金花银叶即可。",

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 3, 
		completed={3009},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
       giveExp = 100,
        giveGoods = {give={{24009,1}}},
	},

	-- 剧情信息
	接任务剧情id = 1*100000+160,
	交任务剧情id = 1*100000+161,
}

任务表[3][11] = 
{
	任务名称 = "【主线】踏上冰火岛",

	接任务npcid = 36,
	交任务npcid = 33,

	任务说明 = "去冰火岛上寻回金毛狮王谢逊主持大局，只是狮王失踪多时，只怕其中有变。",

	客服端接受事件 = {"beibao"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 3, 
		completed={3010},
	},
	完成条件 = 
	{
      
	},
	完成奖励 = 
	{
	
        giveExp = 150,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+161,
	交任务剧情id = 1*100000+162
}

任务表[3][12] = 
{
	任务名称 = "【主线】五彩毒蛛",

	接任务npcid = 33,
	交任务npcid = 82,

	任务说明 = "说不得要你取来第一种物品，五彩毒蛛丝，此物自是产自五彩毒蛛。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 3, 
		completed={3011},
	},
	完成条件 = 
	{
      items = {{4009,5,{9,97,166}}},
	},
	完成奖励 = 
	{
	   skill = {{1,163}},
	   giveGoods = {give={{1,10},{11,10}}},
	},

	-- 剧情信息
	接任务剧情id = 1*100000+162,
	交任务剧情id = 1*100000+163,
	接任务未完成剧情id = 1*100000+171,
	交任务未完成剧情id = 1*100000+172,
}

任务表[3][13] = 
{
	任务名称 = "【主线】雪狼王心",

	接任务npcid = 82,
	交任务npcid = 83,

	任务说明 = "雪狼王行踪诡秘，轻易不会出现，除非杀掉几个雪狼引其出洞。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 3, 
		completed={3012},
	},
	完成条件 = 
	{
      kill = { "雪狼", 10 ,{9,127,95}},
      items = {{4005,1,{9,127,95}}},
	},
	完成奖励 = 
	{
    giveGoods = {give={{24045,1}}},
    giveExp = 200,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+163,
	交任务剧情id = 1*100000+173,
	接任务未完成剧情id = 1*100000+165,
	交任务未完成剧情id = 1*100000+166,
}

任务表[3][17] = 
{
	任务名称 = "【主线】万年玄冰",

	接任务npcid = 83,
	交任务npcid = 84,

	任务说明 = "万年玄冰于这冰火岛上万年才凝结一次，极是不易寻得，此物还需看机缘。",

	客服端接受事件 = {"beibao"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 3, 
		completed={3013},
	},
	完成条件 = 
	{
      items = {{4026,1,{9,30,165}}},
	},
	完成奖励 = 
	{
    giveExp = 200,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+173,
	交任务剧情id = 1*100000+164,
	接任务未完成剧情id = 1*100000+174,
	交任务未完成剧情id = 1*100000+175,
}

任务表[3][14] = 
{
	任务名称 = "【主线】圣火护体",

	接任务npcid = 84,
	交任务npcid = 84,

	任务说明 = "说不得一时大意，被迷失心智的谢逊所伤，此时唯有你习得圣火护体神功，才可将谢逊制服。",

	客服端接受事件 = {"beibao"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 3, 
		completed={3017},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
    skill = {{3,19}},
    giveGoods = {give={{24018,1}}},
    giveExp = 300,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+164,
	交任务剧情id = 1*100000+167,
}

任务表[3][15] = 
{
	任务名称 = "【主线】制服谢逊",

	接任务npcid = 84,
	交任务npcid = 84,

	任务说明 = "此刻你已身具圣火秘传内力，又得说不得亲授护体神功，当可与狮王一搏。",

	客服端接受事件 = {"beibao"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
	 callFunction = "OnClickTask50003"
	},
	接受条件 = {
		school = 3, 
		completed={3014},
	},
	完成条件 = 
	{
     kill = { "谢逊", 1 },
	},
	完成奖励 = 
	{
       giveExp = 200,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+167,
	交任务剧情id = 1*100000+168,
	交任务未完成剧情id = 1*100000+169,
}

任务表[3][16] = 
{
	任务名称 = "【主线】踏上华山",

	接任务npcid = 84,
	交任务npcid = 32,

	任务说明 = "狮王谢逊虽醒转过来，但神智尚未完全恢复，你需随同狮王左右与他共赴华山，也好照应狮王。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
	 callFunction = "GoSH"
	},
	接受条件 = {
		school = 3, 
		completed={3015},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
      giveExp = 500,
      giveGoods = {give={{30001,1}}}
	},

	-- 剧情信息
	接任务剧情id = 1*100000+168,
	交任务剧情id = 1*100000+170,
}

任务表[3][18] = 
{
	任务名称 = "【主线】驿站传送",

	接任务npcid = 32,
	交任务npcid = 92,

	任务说明 = "前往门派驿站，通过这里传送到京城。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 3, 
		completed={3016},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+170,
	交任务剧情id = 1*100000+198,
}


--------------------------------华山
--------------------------------论剑

任务表[3][22] = 
{
	任务名称 = "【主线】武林盟接引",

	接任务npcid = 92,
	交任务npcid = 86,

	任务说明 = "一路风尘，沿途辛苦，就在京城之地稍作歇息再上路吧。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
	 callFunction = "GoJC"
	},
	接受条件 = {
		school = 3, 
		completed={3018},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+198,
	交任务剧情id = 1*100000+184,
}


---------


任务表[3][19] = 
{
	任务名称 = "【主线】华山山脚",

	接任务npcid = 86,
	交任务npcid = 87,

	任务说明 = "在京城暂作歇息，待养足精神之后，即可踏上去华山的道路。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 3, 
		completed={3022},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+184,
	交任务剧情id = 1*100000+185,
}

任务表[3][20] = 
{
	任务名称 = "【主线】华山山脚",

	接任务npcid = 87,
	交任务npcid = 94,

	任务说明 = "华山脚下，众门派弟子乱作一团，只为争那前去观摩华山论剑盛会的资格。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 3, 
		completed={3019},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+185,
	交任务剧情id = 1*100000+192,
}

---------------
任务表[3][23] = 
{
	任务名称 = "【主线】较量少林派",

	接任务npcid = 94,
	交任务npcid = 95,

	任务说明 = "少林派弟子个个金刚铁骨，武艺精湛，想从他们面前通过不是能够轻易办到的。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		callFunction = "OnClickTask50021"
	},
	接受条件 = {
		school = 3, 
		completed={3020},
	},
	完成条件 = 
	{
      kill = {{"少林派弟子", 1}},
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+192,
	交任务剧情id = 1*100000+218,
	接任务未完成剧情id = 1*100000+213,
	交任务未完成剧情id = 1*100000+219,
}

任务表[3][24] = 
{
	任务名称 = "【主线】较量峨嵋派",

	接任务npcid = 95,
	交任务npcid = 96,

	任务说明 = "峨嵋派弟子虽皆为女流之辈，然个个巾帼不让须眉，想要战胜她们可不太容易。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		callFunction = "OnClickTask50022"
	},
	接受条件 = {
		school = 3, 
		completed={3023},
	},
	完成条件 = 
	{
      kill = {{"峨眉派弟子", 2}},
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+218,
	交任务剧情id = 1*100000+220,
	接任务未完成剧情id = 1*100000+230,
	交任务未完成剧情id = 1*100000+202,
}

任务表[3][25] = 
{
	任务名称 = "【主线】较量武当派",

	接任务npcid = 96,
	交任务npcid = 98,

	任务说明 = "武当派弟子系出大家，饶有风范，一柄宝剑在手立于当前，尤显威风凛凛。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		callFunction = "OnClickTask50023"
	},
	接受条件 = {
		school = 3, 
		completed={3024},
	},
	完成条件 = 
	{
      kill = {{"武当派弟子", 3}},
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+220,
	交任务剧情id = 1*100000+221,
	接任务未完成剧情id = 1*100000+233,
	交任务未完成剧情id = 1*100000+208,
}

任务表[3][26] = 
{
	任务名称 = "【主线】较量星宿派",

	接任务npcid = 98,
	交任务npcid = 99,

	任务说明 = "星宿派弟子行事诡秘，善用阴毒暗器药物，要对付他们需要多加留心。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		callFunction = "OnClickTask50020"
	},
	接受条件 = {
		school = 3, 
		completed={3025},
	},
	完成条件 = 
	{
      kill = {{"星宿派弟子", 4}},
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+221,
	交任务剧情id = 1*100000+222,
	接任务未完成剧情id = 1*100000+210,
	交任务未完成剧情id = 1*100000+211,
}

---------------

任务表[3][21] = 
{
	任务名称 = "【主线】华山一役",

	接任务npcid = 99,
	交任务npcid = 87,

	任务说明 = "华山脚下，众门派弟子乱作一团；华山山顶，各路英豪大展拳脚。这正是“武林群英齐荟萃，八方豪杰聚华山”。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 3, 
		completed={3026},
	},
	完成条件 = 
	{
      me = {{73,17,45,6,"HSLJ"}},
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+222,
}
----------------------------------------星宿

任务表[4] = 
{
	任务链名称   = "星宿新手任务系列",
	起始任务     = "【主线】拜入星宿"
}

任务表[4][1] = 
{
	任务名称 = "【主线】拜见阿紫",

	交任务npcid = 41,

	任务说明 = "星宿派自丁春秋一手创立至今已然几十年历史，只因深处于星宿海之中，由此得名。派中师兄姐弟皆以武功高低排名，接引弟子让你前去拜最末的那位小师妹阿紫为师，看来你得先从头开始做起。",

	客服端接受事件 = {"xunlu"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 4, 
		level = 1,
	},
	完成条件 = 
	{
		
	},
	完成奖励 = 
	{
           giveGoods = {give={{1,10},{11,10}}},
	},

	-- 剧情信息
	接任务剧情id = 1*100000+144,
	交任务剧情id = 1*100000+111
}

任务表[4][2] = 
{
	任务名称 = "【主线】入门馈赠",

	接任务npcid = 41,
	交任务npcid = 41,

	任务说明 = "阿紫决定让你去弄蛇毒，不过在此之前，先传你一式武功，给你一把武器，以便你好行事。",

	客服端接受事件 = {"azi1"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 4, 
		completed={4001},
	},
	完成条件 = 
	{
		
	},
	完成延时 = 5,
	完成奖励 = 
	{
		skill = {{1,227}},
      giveGoods = {give={{10810,1}}}
	},

	-- 剧情信息
	接任务剧情id = 1*100000+111,
	交任务剧情id = 1*100000+112,
}

任务表[4][3] = 
{
	任务名称 = "【主线】装备武器",

	接任务npcid = 41,
	交任务npcid = 41,

	任务说明 = "将阿紫赠送给你的武器拿在手上，让她瞧瞧。",

	客服端接受事件 = {"beibao"
	},
	
	客服端完成事件 = {"wugongzy"
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 4, 
		completed={4002},
	},
	完成条件 = 
	{
     ei = {10810},
	},
	完成奖励 = 
	{
    giveExp = 50,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+112,
	交任务剧情id = 1*100000+114,
	交任务未完成剧情id = 1*100000+113
}

任务表[4][4] = 
{
	任务名称 = "【主线】杀蛇取毒",

	接任务npcid = 41,
	交任务npcid = 41,

	任务说明 = "星宿海乃沼泽之地，内中毒物横生，尤以那眼镜王蛇更为凶猛，此去还要多加小心。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
     
	},
	接受条件 = {
		school = 4, 
		completed={4003},
	},
	完成条件 = 
	{
      items = {{4014,5,{10,26,172}}},
	},
	完成奖励 = 
	{
		giveExp = 150,
      giveGoods = {give={{26000,1}}}
	},

	-- 剧情信息
	接任务剧情id = 1*100000+114,
	交任务剧情id = 1*100000+116,
	交任务未完成剧情id = 1*100000+115
}

任务表[4][5] = 
{
	任务名称 = "【主线】呈上英雄帖",

	接任务npcid = 41,
	交任务npcid = 42,

	任务说明 = "据阿紫说，英雄帖上的毒已被她消除，可以放心的将此物交给师父他老人家了。",

	客服端接受事件 = {"beibao"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		items = {{4024,1}},
	},
	接受条件 = {
		school = 4, 
		completed={4004},
	},
	完成条件 = 
	{
		items = {{4024,1}},
	},
	完成奖励 = 
	{ 
      giveExp = 150,
      giveGoods = {give={{26009,1},{1,10}}}
	},

	-- 剧情信息
	接任务剧情id = 1*100000+116,
	交任务剧情id = 1*100000+117,
}

任务表[4][6] = 
{
	任务名称 = "【主线】传话出尘子",

	接任务npcid = 42,
	交任务npcid = 43,

	任务说明 = "师父召集众弟子共商华山论剑一事，让你去叫出尘子前来。",

	客服端接受事件 = {"beibao"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 4, 
		completed={4005},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{ 
      giveExp = 150,
      giveGoods = {give={{26018,1}}}
	},

	-- 剧情信息
	接任务剧情id = 1*100000+117,
	交任务剧情id = 1*100000+118,
}

任务表[4][7] = 
{
	任务名称 = "【主线】回禀师父",

	接任务npcid = 43,
	交任务npcid = 42,

	任务说明 = "出尘子已经知道这个消息，可以回去向师父复命了。",

	客服端接受事件 = {"beibao"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 4, 
		completed={4006},
	},
	完成条件 = 
	{
      
	},
	完成奖励 = 
	{
       giveExp = 150,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+118,
	交任务剧情id = 1*100000+119
}

任务表[4][8] = 
{
	任务名称 = "【主线】阿紫传话",

	接任务npcid = 42,
	交任务npcid = 41,

	任务说明 = "阿紫看来心中已经盘算好了如何实现自己的计划，或许会需要你的协助。",

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 4, 
		completed={4007},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
		giveExp = 150,
		skill = {{1,232}},
      giveGoods = {give={{26027,1}}}
	},

	-- 剧情信息
	接任务剧情id = 1*100000+119,
	交任务剧情id = 1*100000+120,
}

任务表[4][9] = 
{
	任务名称 = "【主线】寻找铁面",

	接任务npcid = 41,
	交任务npcid = 48,

	任务说明 = "铁面人游坦之受阿紫嘱托，去星宿海办什么事儿，也不知究竟办成没有，去问问看。",

	客服端接受事件 = {"beibao"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 4, 
		completed={4008},
	},
	完成条件 = 
	{
      
	},
	完成奖励 = 
	{
       giveExp = 150,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+120,
	交任务剧情id = 1*100000+121,
}

任务表[4][10] = 
{
	任务名称 = "【主线】百毒蜈蚣",

	接任务npcid = 48,
	交任务npcid = 48,

	任务说明 = "眼前的器物就是星宿派镇派之宝，神木王鼎，用它去盛一些蜈蚣的毒液，游坦之自有用处。",

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 4, 
		completed={4009},
	},
	完成条件 = 
	{
     kill = { "百毒蜈蚣", 10,{10,55,199}},
	},
	完成奖励 = 
	{
		giveExp = 200,
      giveGoods = {give={{26036,1}}}                  
	},

	-- 剧情信息
	接任务剧情id = 1*100000+121,
	交任务剧情id = 1*100000+123,
	交任务未完成剧情id = 1*100000+122,
}

任务表[4][11] = 
{
	任务名称 = "【主线】逼问天狼子",

	接任务npcid = 48,
	交任务npcid = 44,

	任务说明 = "据说天狼子也在寻找万年冰蚕的下落，只是游坦之去问无果，你去试试或许另有收获。",

	客服端接受事件 = {"beibao"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 4, 
		completed={4010},
	},
	完成条件 = 
	{
      
	},
	完成奖励 = 
	{
      giveGoods = {give={{1,10},{11,10}}},
	},

	-- 剧情信息
	接任务剧情id = 1*100000+123,
	交任务剧情id = 1*100000+124
}

任务表[4][12] = 
{
	任务名称 = "【主线】采花迷药",

	接任务npcid = 44,
	交任务npcid = 47,

	任务说明 = "星宿派内都知道，采花子此人善使迷药害人，这种苟且伎俩如今也许也能派上用场。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 4, 
		completed={4011},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
		giveExp = 200,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+124,
	交任务剧情id = 1*100000+125,
}

任务表[4][13] = 
{
	任务名称 = "【主线】内心纠结",

	接任务npcid = 47,
	交任务npcid = 47,

	任务说明 = "要想得到迷药，就必须答应采花子的要求，去为他寻个良家妇女来，但如此伤天害理的事儿，还是头一回去做，究竟该是不该呢。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 4, 
		completed={4012},
	},
	完成条件 = 
	{
     me = {{10,188,88,3,"CG56"}},--------到达坐标点，完成任务
	},
	完成奖励 = 
	{
		giveExp = 200,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+125,
	交任务剧情id = 1*100000+127,
	交任务未完成剧情id = 1*100000+126,
}

任务表[4][14] = 
{
	任务名称 = "【主线】逼抢迷药",

	接任务npcid = 47,
	交任务npcid = 47,

	任务说明 = "采花子既是不肯乖乖的交出迷药来，那也只好使点手段了",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
	 callFunction = "OnClickTask50004"
	},
	接受条件 = {
		school = 4, 
		completed={4013},
	},
	完成条件 = 
	{
     kill = { "采花子", 1 },
	},
	完成奖励 = 
	{
		giveExp = 200,
      giveGoods = {give={{26045,1}}}      
	},

	-- 剧情信息
	接任务剧情id = 1*100000+127,
	交任务剧情id = 1*100000+130,
	交任务未完成剧情id = 1*100000+128,
}


任务表[4][23] = 
{
	任务名称 = "【主线】万事俱备",

	接任务npcid = 47,
	交任务npcid = 44,

	任务说明 = "终于从采花子那儿得到了迷药，该是去找天狼子的麻烦了。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 4, 
		completed={4014},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+130,
	交任务剧情id = 1*100000+129,
}


任务表[4][15] = 
{
	任务名称 = "【主线】迷药谜团",

	接任务npcid = 44,
	交任务npcid = 48,

	任务说明 = "好不容易得来的迷药居然对天狼子没有效果，也不知是真是假，回去找游坦之问问。",

	客服端接受事件 = {"beibao"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 4, 
		completed={4023},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
      giveExp = 100,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+129,
	交任务剧情id = 1*100000+131,
}

任务表[4][16] = 
{
	任务名称 = "【主线】学习轻功",

	接任务npcid = 48,
	交任务npcid = 48,

	任务说明 = "游坦之教你学习星宿派轻功，学成之后就可以轻易跃上高台采摘迷迭香了。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 4, 
		completed={4015},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
        skill ={{2,25}},
       giveGoods = {give={{1,10},{11,10}}},
	},

	-- 剧情信息
	接任务剧情id = 1*100000+131,
	交任务剧情id = 1*100000+132,
}

任务表[4][17] = 
{
	任务名称 = "【主线】迷迭香",

	接任务npcid = 48,
	交任务npcid = 48,

	任务说明 = "高台之上长着配置迷药的重要材料，迷迭香，你上去采来交给游坦之让他给你配置好迷药。",

	客服端接受事件 = {"qinggongzy"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
	 callFunction = "OnClickTask50013"
	},
	接受条件 = {
		school = 4, 
		completed={4016},
	},
	完成条件 = 
	{
		items = {{4020,1}},
	},
	完成奖励 = 
	{
         giveExp = 100,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+132,
	交任务剧情id = 1*100000+134,
	交任务未完成剧情id = 1*100000+133,
}

任务表[4][18] = 
{
	任务名称 = "【主线】套出下落",

	接任务npcid = 48,
	交任务npcid = 44,

	任务说明 = "得到了真正的迷药，对着天狼子使用，迷晕他之后看他说是不说。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 4, 
		completed={4017},
	},
	完成条件 = 
	{
         
	},
	完成奖励 = 
	{
      giveExp = 100,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+134,
	交任务剧情id = 1*100000+136,
	接任务未完成剧情id = 1*100000+135,
	交任务未完成剧情id = 1*100000+137,
}

任务表[4][19] = 
{
	任务名称 = "【主线】冰蚕下落",

	接任务npcid = 44,
	交任务npcid = 48,

	任务说明 = "知道万年冰蚕的下落，该回去问问游坦之下一步该如何了。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 4, 
		completed={4018},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
        skill = {{3,25}},
	},

	-- 剧情信息
	接任务剧情id = 1*100000+136,
	交任务剧情id = 1*100000+138,
}

任务表[4][20] = 
{
	任务名称 = "【主线】捕捉冰蚕",

	接任务npcid = 48,
	交任务npcid = 41,

	任务说明 = "到星宿海最隐秘的地方，找到万年冰蚕，用神木王鼎将它收入其中。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
	 callFunction = "GoXXBC"
	},
	接受条件 = {
		school = 4, 
		completed={4019},
	},
	完成条件 = 
	{
     me = {{10,111,146,3,"bingcan"}},
     kill = { {"子午虫",5},{"万年冰蚕", 1 }},-------进入动态场景战斗，完成之后播放CG
	},
	完成奖励 = 
	{
    giveExp = 200,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+138,
	交任务剧情id = 1*100000+139,
	接任务未完成剧情id = 1*100000+140,
	交任务未完成剧情id = 1*100000+141,
}

任务表[4][21] = 
{
	任务名称 = "【主线】师父传唤",

	接任务npcid = 41,
	交任务npcid = 42,

	任务说明 = "既然师父叫你去，你就去吧，指不准是好事儿还是坏事儿。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 4, 
		completed={4020},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
      giveGoods = {give={{30001,1}}}
	},

	-- 剧情信息
	接任务剧情id = 1*100000+139,
	交任务剧情id = 1*100000+142,
}

任务表[4][22] = 
{
	任务名称 = "【主线】共赴华山",

	接任务npcid = 42,
	交任务npcid = 46,

	任务说明 = "去找摘星子，与他一起共上华山参加华山论剑盛会。",

	客服端接受事件 = {"beibao"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 4, 
		completed={4021},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+142,
	交任务剧情id = 1*100000+143,
}

任务表[4][24] = 
{
	任务名称 = "【主线】驿站传送",

	接任务npcid = 46,
	交任务npcid = 93,

	任务说明 = "前往门派驿站，通过这里传送到京城。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 4, 
		completed={4022},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+143,
	交任务剧情id = 1*100000+199,
}


--------------------------------华山
--------------------------------论剑

任务表[4][28] = 
{
	任务名称 = "【主线】武林盟接引",

	接任务npcid = 93,
	交任务npcid = 86,

	任务说明 = "一路风尘，沿途辛苦，就在京城之地稍作歇息再上路吧。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
	 callFunction = "GoJC"
	},
	接受条件 = {
		school = 4, 
		completed={4024},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+199,
	交任务剧情id = 1*100000+186,
}

----------

任务表[4][25] = 
{
	任务名称 = "【主线】华山山脚",

	接任务npcid = 86,
	交任务npcid = 87,

	任务说明 = "在京城暂作歇息，待养足精神之后，即可踏上去华山的道路。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 4, 
		completed={4028},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+186,
	交任务剧情id = 1*100000+187,
}

任务表[4][26] = 
{
	任务名称 = "【主线】华山山脚",

	接任务npcid = 87,
	交任务npcid = 94,

	任务说明 = "华山脚下，众门派弟子乱作一团，只为争那前去观摩华山论剑盛会的资格。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 4, 
		completed={4025},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+187,
	交任务剧情id = 1*100000+191,
}

-----------------
任务表[4][29] = 
{
	任务名称 = "【主线】较量少林派",

	接任务npcid = 94,
	交任务npcid = 95,

	任务说明 = "少林派弟子个个金刚铁骨，武艺精湛，想从他们面前通过不是能够轻易办到的。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		callFunction = "OnClickTask50021"
	},
	接受条件 = {
		school = 4, 
		completed={4026},
	},
	完成条件 = 
	{
      kill = {{"少林派弟子", 1}},
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+191,
	交任务剧情id = 1*100000+223,
	接任务未完成剧情id = 1*100000+213,
	交任务未完成剧情id = 1*100000+219,
}

任务表[4][30] = 
{
	任务名称 = "【主线】较量峨嵋派",

	接任务npcid = 95,
	交任务npcid = 96,

	任务说明 = "峨嵋派弟子虽皆为女流之辈，然个个巾帼不让须眉，想要战胜她们可不太容易。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		callFunction = "OnClickTask50022"
	},
	接受条件 = {
		school = 4, 
		completed={4029},
	},
	完成条件 = 
	{
      kill = {{"峨眉派弟子", 2}},
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+223,
	交任务剧情id = 1*100000+224,
	接任务未完成剧情id = 1*100000+230,
	交任务未完成剧情id = 1*100000+202,
}

任务表[4][31] = 
{
	任务名称 = "【主线】较量武当派",

	接任务npcid = 96,
	交任务npcid = 97,

	任务说明 = "武当派弟子系出大家，饶有风范，一柄宝剑在手立于当前，尤显威风凛凛。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		callFunction = "OnClickTask50023"
	},
	接受条件 = {
		school = 4, 
		completed={4030},
	},
	完成条件 = 
	{
      kill = {{"武当派弟子", 3}},
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+224,
	交任务剧情id = 1*100000+225,
	接任务未完成剧情id = 1*100000+233,
	交任务未完成剧情id = 1*100000+205,
}

任务表[4][32] = 
{
	任务名称 = "【主线】较量圣火教",

	接任务npcid = 97,
	交任务npcid = 99,

	任务说明 = "圣火教门徒继承火的意志，行事张扬，敢作敢为，武技大开大合，颇有气势。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		callFunction = "OnClickTask50024"
	},
	接受条件 = {
		school = 4, 
		completed={4031},
	},
	完成条件 = 
	{
      kill = {{"圣火教弟子", 4}},
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+225,
	交任务剧情id = 1*100000+226,
	接任务未完成剧情id = 1*100000+227,
	交任务未完成剧情id = 1*100000+211,
}


-----------------

任务表[4][27] = 
{
	任务名称 = "【主线】华山一役",

	接任务npcid = 99,
	交任务npcid = 87,

	任务说明 = "华山山顶，各路英豪大展拳脚。这正是“武林群英齐荟萃，八方豪杰聚华山”。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 4, 
		completed={4032},
	},
	完成条件 = 
	{
      me = {{73,17,45,6,"HSLJ"}},
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+226,
}
----------------------------------------------------------------------武当

任务表[5] = 
{
	任务链名称   = "武当新手任务系列",
	起始任务     = "【主线】拜入武当"
}

任务表[5][1] = 
{
	任务名称 = "【主线】拜入武当",
	nocancel=1,
	交任务npcid = 54,

	任务说明 = "武当派历史源远流长，张真人门下弟子更是出类拔萃，此刻你且前去拜见自己的师父，宋远桥。（可鼠标左键单击带下划线名称自动寻路）。",

	客服端接受事件 = {"xunlu"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 2, 
		level = 1,
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
    giveExp = 25,
	 giveGoods = {give={{1,10},{11,10}}},
	},

	-- 剧情信息
   接任务剧情id = 1*100000+87,
	交任务剧情id = 1*100000+88
}

任务表[5][2] = 
{
	任务名称 = "【主线】武当剑法",

	接任务npcid = 54,
	交任务npcid = 54,

	任务说明 = "宋远桥向你传授武当入门剑法【仗剑式】，日后你还需勤加练习，方可融会贯通。",

	客服端接受事件 = {"songyuanqiao1"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
        
	接受条件 = {
		school = 2, 
		completed={5001},
	},
        完成延时 = 5,
	完成条件 = 
	{
         
	},
	完成奖励 = 
	{
	 giveExp = 25,
         giveGoods = {give={{10180,1}, {1,10}, {11,10}}},
         skill = {{1,106}}
	},

	-- 剧情信息
	接任务剧情id = 1*100000+88,
	交任务剧情id = 1*100000+85,
}
------------------------------------
任务表[5][16] = 
{
	任务名称 = "【主线】装备长剑",

	接任务npcid = 54,
	交任务npcid = 54,

	任务说明 = "宋远桥赐你青铜长剑，让你拿在手上试试是否趁手。",

	客服端接受事件 = {"beibao"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 2, 
		completed={5002},
	},
	完成条件 = 
	{
     ei = {10180}
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+85,
	交任务剧情id = 1*100000+89,
   交任务未完成剧情id = 1*100000+70
}
----------------------------
任务表[5][3] = 
{
	任务名称 = "【主线】剑穗为礼",

	接任务npcid = 54,
	交任务npcid = 60,

	任务说明 = "张三丰百岁寿辰将至，宋远桥让你去真武道场之中自真武飞剑身上取些剑穗交给天璇道人，以作贺礼。",

	客服端接受事件 = {"wugongzy"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 2, 
		completed={5016},
	},
	完成条件 = 
	{
		items = {{4030,3,{8,160,186}}}
	},
	完成奖励 = 
	{
		giveExp = 150,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+89,
	交任务剧情id = 1*100000+90,
   接任务未完成剧情id = 1*100000+91,
   交任务未完成剧情id = 1*100000+110
}


任务表[5][4] = 
{
	任务名称 = "【主线】拜寿南山",

	接任务npcid = 60,
	交任务npcid = 53,

	任务说明 = "即刻去向师祖张三丰拜寿吧。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 2, 
		completed={5003},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
		giveExp = 100,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+90,
	交任务剧情id = 1*100000+92
}

任务表[5][5] = 
{
	任务名称 = "【主线】结阵空缺",

	接任务npcid = 53,
	交任务npcid = 62,

	任务说明 = "正所谓来者不善，善者不来，少林三大空字辈神僧突向武当发难，张三丰只得以新创真武剑阵御敌，只不过结阵尚缺一人，宋青书正是最佳人选，你且先去叫他过来。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 2, 
		completed={5004},
	},
	完成条件 = 
	{
		
	},
	完成奖励 = 
	{
		giveExp = 150,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+92,
	交任务剧情id = 1*100000+93
}

任务表[5][6] = 
{
	任务名称 = "【主线】学习轻功",

	接任务npcid = 62,
	交任务npcid = 59,

	任务说明 = "去天枢道人那儿让他传你【轻功】步伐，此为踏阵基础，务必习得。",

   客服端接受事件 = {
	},

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 2, 
		completed={5005},
	},
	完成条件 = 
	{
		
	},
	完成奖励 = 
	{
		giveExp = 200,
      giveGoods = {give={{16,5}}} ,
      skill = {{2,13}}
	},

	-- 剧情信息
	接任务剧情id = 1*100000+93,
	交任务剧情id = 1*100000+94
}


任务表[5][7] = 
{
	任务名称 = "【主线】采集矿石",

	接任务npcid = 59,
	交任务npcid = 59,

	任务说明 = "天枢真人让你去八卦坛对面的山崖采集些矿石回来（使用轻功跳过八卦坛边的石柱，即可到达矿石所在的山崖。若是体力不继，可以服用背包中的熊胆丸回复）。",

   客服端接受事件 = {"qinggongzy"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		callFunction = "OnClickTask50008"
	},
	接受条件 = {
		school = 2, 
		completed={5006},
	},
	完成条件 = 
	{
		items = {{4029,1,{3,73,17}}}
	},
	完成奖励 = 
	{
		giveExp = 200,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+94,
	交任务剧情id = 1*100000+95,
   交任务未完成剧情id = 1*100000+96
}


任务表[5][8] = 
{
	任务名称 = "【主线】天权道人",

	接任务npcid = 59,
	交任务npcid = 61,

	任务说明 = "天权道人深隐于真武道场之内，苦心钻研武学，若能蒙他指点一番，必是受用不尽。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 2, 
		completed={5007},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
		giveExp = 250,
		giveGoods = {give={{1,10},{11,10}}},
	},

	-- 剧情信息
	接任务剧情id = 1*100000+95,
	交任务剧情id = 1*100000+97,
}



任务表[5][9] = 
{
	任务名称 = "【主线】八卦套装",

	接任务npcid = 61,
	交任务npcid = 61,

	任务说明 = "遭遇天权道人奇怪的要求，需穿上一套【八卦】套装，道人方才授你武艺。从八卦卜爻那儿弄齐这六件装备吧。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 2, 
		completed={5008},
	},
	完成条件 = 
	{
	  kill = { {"八卦之乾",1,{8,115,145}}, { "八卦之坎",1,{8,82,178} }, { "八卦之艮",1,{8,46,136} },  { "八卦之震",1,{8,19,105} }, { "八卦之巽",1,{8,53,70} },{ "八卦之离",1,{8,84,42} },{ "八卦之坤",1,{8,120,73}},{ "八卦之兑",1 ,{8,152,108}}},
          ei = {21000,21009,21018,21027,21036,21045}
	},
	完成奖励 = 
	{
		giveExp = 200
	},

	-- 剧情信息
	接任务剧情id = 1*100000+97,
	交任务剧情id = 1*100000+98,
   交任务未完成剧情id = 1*100000+99
}

任务表[5][10] = 
{
	任务名称 = "【主线】八卦剑法",

	接任务npcid = 61,
	交任务npcid = 61,

	任务说明 = "天权道人传你【八卦剑法】与真武七截剑阵精髓，你要用心铭记。",

	客服端接受事件 = {
        "baguajianfa"
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 2, 
		completed={5009},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
      giveGoods = {give={{1,10}}},
      giveExp = 150,
      skill = {{1,111}},
	},

	-- 剧情信息
	接任务剧情id = 1*100000+98,
	交任务剧情id = 1*100000+100,
}

任务表[5][11] = 
{
	任务名称 = "【主线】鬼祟小贼",

	接任务npcid = 61,
	交任务npcid = 61,

	任务说明 = "天权道人让你去除掉几个在真武道场之中鬼鬼祟祟的小贼，顺道试试新学的剑法招式。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 2, 
		completed={5010},
	},
	完成条件 = 
	{
		kill = { "鬼祟暗探" , 10 , {8,34,52}},
	},
	完成奖励 = 
	{
		giveExp = 100
	},

	-- 剧情信息
	接任务剧情id = 1*100000+100,
	交任务剧情id = 1*100000+101,
   交任务未完成剧情id = 1*100000+102
}

任务表[5][12] = 
{
	任务名称 = "【主线】真武剑阵",

	接任务npcid = 61,
	交任务npcid = 53,

	任务说明 = "向张三丰说明宋青书不愿跟新入门弟子一起结阵，看太师傅如何处置此事。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 2, 
		completed={5011},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
		giveExp = 150,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+101,
	交任务剧情id = 1*100000+103
}


任务表[5][13] = 
{
	任务名称 = "【主线】是福是祸",

	接任务npcid = 53,
	交任务npcid = 62,

	任务说明 = "太师祖张三丰认为你比宋青书更适合陪同师伯张松溪前去华山论剑，要你去告知宋青书这个消息，此去还不知该如何向宋青书道明。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 2, 
		completed={5012},
	},
	完成条件 = 
	{

	},
	完成奖励 = 
	{
		giveExp = 150,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+103,
	交任务剧情id = 1*100000+104
}

任务表[5][14] = 
{
	任务名称 = "【主线】青书发难",

	接任务npcid = 62,
	交任务npcid = 53,

	任务说明 = "宋青书闻听由你替他随师伯去华山论剑，怒上心头，一气之下就要与你兵戎相见，看来此战在所难免。",

	接受事件 = 
   {
		callFunction = "OnClickTask50006"
	},
	接受条件 = {
		school = 2, 
		completed={5013},
	},
	完成条件 = 
	{
      kill = { "宋青书" , 1 },
	},
	完成奖励 = 
	{
		giveExp = 150,
	},

	-- 剧情信息
	接任务剧情id = 1*100000+104,
	交任务剧情id = 1*100000+105,
   接任务未完成剧情id = 1*100000+106,
   交任务未完成剧情id = 1*100000+107
}



任务表[5][15] = 
{
	任务名称 = "【主线】踏上华山",

	接任务npcid = 53,
	交任务npcid = 53,

	任务说明 = "看你武功不凡，又胆色过人，实乃后辈中翘楚。你就快跟随你师伯张松溪去华山见识见识论剑大会吧。",

   客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		
	},
	接受条件 = {
		school = 2, 
		completed={5014},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
		giveExp = 200,
      giveGoods = {give={{30001,1}}}
	},

	-- 剧情信息
	接任务剧情id = 1*100000+105,
	交任务剧情id = 1*100000+44,
}

任务表[5][17] = 
{
	任务名称 = "【主线】驿站传送",

	接任务npcid = 53,
	交任务npcid = 91,

	任务说明 = "前往门派驿站，通过这里传送到京城。",

   客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 2, 
		completed={5015},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+44,
	交任务剧情id = 1*100000+200,
}

--------------------------------华山
--------------------------------论剑

任务表[5][21] = 
{
	任务名称 = "【主线】武林盟接引",

	接任务npcid = 91,
	交任务npcid = 86,

	任务说明 = "一路风尘，沿途辛苦，就在京城之地稍作歇息再上路吧。",

   客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
	 callFunction = "GoJC"
	},
	接受条件 = {
		school = 2, 
		completed={5017},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+200,
	交任务剧情id = 1*100000+188,
}


--------

任务表[5][18] = 
{
	任务名称 = "【主线】华山山脚",

	接任务npcid = 86,
	交任务npcid = 87,

	任务说明 = "在京城暂作歇息，待养足精神之后，即可踏上去华山的道路。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 2, 
		completed={5021},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+188,
	交任务剧情id = 1*100000+189,
}

任务表[5][19] = 
{
	任务名称 = "【主线】华山山脚",

	接任务npcid = 87,
	交任务npcid = 94,

	任务说明 = "华山脚下，众门派弟子乱作一团，只为争那前去观摩华山论剑盛会的资格。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 2, 
		completed={5018},
	},
	完成条件 = 
	{
    
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+189,
	交任务剧情id = 1*100000+190,
}

----------------------------
任务表[5][22] = 
{
	任务名称 = "【主线】较量少林派",

	接任务npcid = 94,
	交任务npcid = 95,

	任务说明 = "少林派弟子个个金刚铁骨，武艺精湛，想从他们面前通过不是能够轻易办到的。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		callFunction = "OnClickTask50021"
	},
	接受条件 = {
		school = 2, 
		completed={5019},
	},
	完成条件 = 
	{
      kill = {{"少林派弟子", 1}},
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+190,
	交任务剧情id = 1*100000+228,
	接任务未完成剧情id = 1*100000+213,
	交任务未完成剧情id = 1*100000+219,
}

任务表[5][23] = 
{
	任务名称 = "【主线】较量峨嵋派",

	接任务npcid = 95,
	交任务npcid = 97,

	任务说明 = "峨嵋派弟子虽皆为女流之辈，然个个巾帼不让须眉，想要战胜她们可不太容易。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		callFunction = "OnClickTask50022"
	},
	接受条件 = {
		school = 2, 
		completed={5022},
	},
	完成条件 = 
	{
      kill = {{"峨眉派弟子", 2}},
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+228,
	交任务剧情id = 1*100000+229,
	接任务未完成剧情id = 1*100000+230,
	交任务未完成剧情id = 1*100000+205,
}

任务表[5][24] = 
{
	任务名称 = "【主线】较量圣火教",

	接任务npcid = 97,
	交任务npcid = 98,

	任务说明 = "圣火教门徒继承火的意志，行事张扬，敢作敢为，武技大开大合，颇有气势。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		callFunction = "OnClickTask50019"
	},
	接受条件 = {
		school = 2, 
		completed={5023},
	},
	完成条件 = 
	{
      kill = {{"圣火教弟子", 3}},
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+229,
	交任务剧情id = 1*100000+231,
	接任务未完成剧情id = 1*100000+207,
	交任务未完成剧情id = 1*100000+208,
}

任务表[5][25] = 
{
	任务名称 = "【主线】较量星宿派",

	接任务npcid = 98,
	交任务npcid = 99,

	任务说明 = "星宿派弟子行事诡秘，善用阴毒暗器药物，要对付他们需要多加留心。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
		callFunction = "OnClickTask50020"
	},
	接受条件 = {
		school = 2, 
		completed={5024},
	},
	完成条件 = 
	{
      kill = {{"星宿派弟子", 4}},
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+231,
	交任务剧情id = 1*100000+232,
	接任务未完成剧情id = 1*100000+210,
	交任务未完成剧情id = 1*100000+211,
}



----------------------------

任务表[5][20] = 
{
	任务名称 = "【主线】华山一役",

	接任务npcid = 99,
	交任务npcid = 87,

	任务说明 = "华山山顶，各路英豪大展拳脚。这正是“武林群英齐荟萃，八方豪杰聚华山”。",

	客服端接受事件 = {
	},
	
	客服端完成事件 = {
	},	

	接受事件 = 
   {
    
	},
	接受条件 = {
		school = 2, 
		completed={5025},
	},
	完成条件 = 
	{
      me = {{73,17,45,6,"HSLJ"}},
	},
	完成奖励 = 
	{
    
	},

	-- 剧情信息
	接任务剧情id = 1*100000+232,
}
---------------------------------


