剧情表 = {}

剧情表[10000] = 
{
	npcimg = "spr/头像/驿站传送.spr",

	[1] = { info = "少林弟子可由我这里传送到京城，你确定要过去吗？", selection={ {"前往京城",2},{"稍等片刻",0}} } ,
	[2] = { onClick="GoJC",selection = {"",0} },
}

剧情表[10001] = 
{
	npcimg = "spr/头像/驿站传送.spr",

	[1] = { info = "峨眉弟子可由我这里传送到京城，你确定要过去吗？", selection={ {"前往京城",2},{"稍等片刻",0}} } ,
	[2] = { onClick="GoJC",selection = {"",0} },
}

剧情表[10002] = 
{
	npcimg = "spr/头像/驿站传送.spr",

	[1] = { info = "武当弟子可由我这里传送到京城，你确定要过去吗？", selection={ {"前往京城",2},{"稍等片刻",0}} } ,
	[2] = { onClick="GoJC",selection = {"",0} },
}

剧情表[10003] = 
{
	npcimg = "spr/头像/驿站传送.spr",

	[1] = { info = "圣火弟子可由我这里传送到京城，你确定要过去吗？", selection={ {"前往京城",2},{"稍等片刻",0}} } ,
	[2] = { onClick="GoJC",selection = {"",0} },
}

剧情表[10004] = 
{
	npcimg = "spr/头像/驿站传送.spr",

	[1] = { info = "星宿弟子可由我这里传送到京城，你确定要过去吗？", selection={ {"前往京城",2},{"稍等片刻",0}} } ,
	[2] = { onClick="GoJC",selection = {"",0} },
}

剧情表[10005] = 
{
	npcimg = "spr/头像/驿站传送.spr",

	[1] = { info = "门派弟子可通过我这里回到各自的门派，你确定要过去吗？", selection={ {"回到门派",2},{"稍等片刻",0}} } ,
	[2] = { onClick="GoMP",selection = {"",0} },
}
-------------------------------------------------峨眉
------------首次进入游戏提示
剧情表[60001] = 
{
	npcimg = "spr/头像/峨嵋派弟子.spr",

	[1] = { info = "峨眉山道路艰险，可费了不少功夫才爬到此处，终于可以歇息片刻了。", selection={ {"继续",2} } } ,
	[2] = { info = "早听说峨眉派历史悠长，人才辈出，历代掌门人都是女中豪杰，巾帼英雄，现任掌门灭绝师太武功卓越，为人严厉。", selection={ {"继续",3}} } ,
	[3] = { info = "我此刻真想马上见见这位久仰的当世高人，得蒙拜入她门下方才心满意足。", selection={ {"即刻动身",4}} } ,
	[4] = { task={2,1,1},selection = {"",0} },
}

剧情表[100019] = 
{
	npcimg = "spr/头像/峨嵋派弟子.spr",

	[1] = { info = "峨眉山道路艰险，可费了不少功夫才爬到此处，终于可以歇息片刻了。", selection={ {"继续",2} } } ,
	[2] = { info = "早听说峨眉派历史悠长，人才辈出，历代掌门人都是女中豪杰，巾帼英雄，现任掌门灭绝师太武功卓越，为人严厉。", selection={ {"继续",3}} } ,
	[3] = { info = "我此刻真想马上见见这位久仰的当世高人，得蒙拜入她门下方才心满意足。", selection={ {"即刻动身",4}} } ,
	[4] = { task={2,1,1},selection = {"",0} },
}

剧情表[100020] = 
{
	npcimg = "spr/头像/2.spr",

	[1] = { info = "你就是新入的弟子吗，刚才的事你可见到了，我峨眉弟子绝不允许与魔教中人往来，违者重罚，你可清楚。", selection={ {"弟子明白，不过刚才山门外有几个自称圣火教的人代什么张教主来传口信",2} } } ,
	[2] = { info = "什么！张无忌这魔头居然派人到我峨眉来？趁这次华山论剑，定要这魔头命葬华山！", selection={ {"继续",3} } } ,
	[3] = { info = "如今为师先传你一式峨眉武功，再赠你一把武器，待你将武功熟练运用于武器之时，你就去替为师办点事。", selection={ {"弟子遵命",4}} } ,
        [4] = { task={2,2},selection = {"",0} },
}


剧情表[100018] = 
{
	npcimg = "spr/头像/2.spr",

	[1] = { info = "峨眉派的入门武功，为师刚已传给你了，快将为师给你的武器拿在手中给师父看看，也不知道是否趁手。", selection={ {"弟子遵命",2},{"歇息片刻",0}} } ,
   [2] = { task={2,18},selection = {"",0} },
}

剧情表[100017] = 
{
	npcimg = "spr/头像/2.spr",

	[1] = { info = "快将为师给你的武器拿在手中给师父看看，也不知道是否趁手。", selection={ {"是",0} } } ,
}

剧情表[100021] = 
{
	npcimg = "spr/头像/2.spr",

	[1] = { info = "嗯，这样看来倒是有模有样。不错，现在你就帮为师去取那几样东西过来。", selection={ {"不知是些什么东西",2} } } ,
	[2] = { info = "你先去金顶之上取些赤血狐的血来，为师自有用处。这次定叫那魔头有来无回。哼！快去。", selection={ {"弟子这就动身",3},{"歇息片刻",0}} } ,
   [3] = { task={2,3},selection = {"",0} },
}


剧情表[100022] = 
{
	npcimg = "spr/头像/2.spr",

	[1] = { info = "想不到你小小年轻，资质倒是上佳，如此快就将赤血狐之血取来，日后必将前途无量。", selection={ {"多谢师父夸奖",2} } } ,
	[2] = { info = "哎，我峨嵋派内弟子个个都不争气，你周师姐本是个好苗子，却又被那妖人迷惑，不思上进。张无忌一日不除，我峨眉一日不得安宁。", selection={ {"继续",3}}},
	[3] = { info = "你去你纪晓芙师姐那儿让她给你点灯心草，就说为师要用，若她问起其他，你就一概装作不知，她这人心肠也是软得很。", selection={ {"弟子遵命",4},{"歇息片刻",0}} } ,
   	[4] = { task={2,4},selection = {"",0} },
}


剧情表[100023] = 
{
	npcimg = "spr/头像/2.spr",

	[1] = { info = "赤血狐周身毛发红艳，行动机敏，其血沁有剧毒，正是对付那班魔教之徒的利器。", selection={ {"徒儿这就去为您取来",0} } } ,
}


剧情表[100024] = 
{
	npcimg = "spr/头像/5.spr",
   --[1] = { info = "小师妹，你来姐姐这个地方做什么？" ,selection={ {"我来给姐姐请安的",2}} } ,
   [1] = { cg = 32 , selection = {{"",2}} },
   [2] = { task={2,5},selection = {"",0} },
}

剧情表[100025] = 
{
	npcimg = "spr/头像/5.spr",

	[1] = { info = "如此的话旁边这陡峭的山崖对你来说也就不成什么问题了，你去采下几株灯心草带去给师父吧。", selection={ {"多谢师姐",2}, {"歇息片刻",0}} } ,
	[2] = { task={2,6},selection = {"",0} },
}

剧情表[100016] = 
{
	npcimg = "spr/头像/5.spr",

	[1] = { info = "如此旁边这陡峭的山崖对你来说也就不成什么问题了，你去采下几株灯心草带去给师父吧。", selection={ {"多谢师姐",2}, {"歇息片刻",0}} } ,
	[2] = { onClick="OnClickTask50011",selection = {"",0} },
}

剧情表[100026] = 
{
	npcimg = "spr/头像/2.spr",

	[1] = { info = "如今就只差这最后一味药了，一定要让芷若这丫头亲自动手。", selection={ {"徒儿愿为师父效劳",2} } } ,
	[2] = { info = "你可知我峨眉门人头上的发簪有何用处？", selection={ {"莫非这里面还有什么玄机",3}}},
	[3] = { info = "这发簪之中藏有无色无味的失心散，只为我派门人在外遭受欺辱之时自尽之用，你新入门派自是不知。如今我就要让芷若用这东西要了张无忌的命！你去把芷若给我叫来。", selection={ {"弟子遵命",4}}} ,
        [4] = { cg = 34 , selection = {{"",5}} },
	[5] = { info = "哎，芷若还是在犹豫。以前她那么听话，现在竟为了一个男人连为师的话也听不进去了。你去给我把她盯紧了，一有什么动静马上前来禀报于我。" ,selection={ {"弟子遵命",6},{"歇息片刻",0}} } ,
        [6] = { task={2,7},selection = {"",0} },
}

剧情表[100027] = 
{
	npcimg = "spr/头像/3.spr",

	[1] = { info = "咦，小师妹，你在这里干嘛，可是师父又叫我了？", selection={ {"没有没有，我...我只是来向师姐问好的",2} } } ,
   [2] = { info = "师妹还请随便逛逛，我现下有事在身，怕是不能陪你了。", selection={ {"师姐有何事，小妹愿意代劳",3} } } ,
   [3] = { info = "哎，刚才我又惹师父生气了，我想去金顶之上采些茶叶回来泡制茶水孝敬师父，也好让她老人家消消气。", selection={ {"小妹愿替师姐前去",4}}} ,
	[4] = { info = "如此有劳师妹，做师姐的也没什么可教你，就传你这一套峨眉武功吧，如此也可助你安全上到金顶之上。" ,selection={ {"多谢师姐",5},{"歇息片刻",0}} } ,
   [5] = { task={2,8},selection = {"",0} },
}

剧情表[100028] = 
{
	npcimg = "spr/头像/4.spr",

	[1] = { info = "哟.这金顶上头可是许久不曾见来人了，怎么，新来的师妹？", selection={ {"拜见师姐，我来采点茶叶带回去",2} } } ,
   [2] = { info = "采茶？平时可都是周师姐亲自来，今儿个换人了吗。茶园就在前面不远，不过道可不好走，路上有许多豹猫袭扰路人，你可自己小心了。", selection={ {"多谢师姐提醒",3} ,{"歇息片刻",0} }} ,
   [3] = { task={2,9},selection = {"",0} },
}

剧情表[100029] = 
{
	npcimg = "spr/头像/1.spr",

	[1] = { info = "呵呵呵，除了芷若上来采茶，其他人都不怎么上山了，也不知道究竟是什么原因。", selection={ {"沿途都是那些讨厌的猫，自然没什么人上来了",2} } } ,
   [2] = { info = "喔，又是那些调皮的畜生。你来做什么呢，小姑娘？", selection={ {"我想到这茶园之中采些茶叶回去",3} } } ,
   [3] = { info = "你看我这茶园子都快要荒废了，不如你帮我拾掇拾掇，修整一下，也为后来的人留个方便啊。", selection={ {"我要如何帮你",4} } } ,
   [4] = { info = "听我说，鼠标左键点击枯萎的茶树，就可以了。", selection={ {"晚辈答应就是",5},{"歇息片刻",0 } }} ,
   [5] = { task={2,10},selection = {"",0} },
}

剧情表[100030] = 
{
	npcimg = "spr/头像/4.spr",

	[1] = { info = "师妹你可小心了，那豹猫机灵的很，可不是那么容易对付的。", selection={ {"多谢师姐提醒",0} } } ,
}

剧情表[100031] = 
{
	npcimg = "spr/头像/1.spr",

	[1] = { info = "这茶园子可许久不曾有人来过了，老身也是不能动弹，眼看着就要如此荒废了。", selection={ {"可惜了这上好的茶叶",0} } } ,
}


剧情表[100032] = 
{
	npcimg = "spr/头像/1.spr",

	[1] = { info = "小姑娘真是好心啊，不过这些茶树光浇水也不行，那些虫子都要把茶叶啃光了。", selection={ {"小小虫子，不怕不怕啦",2},{"最怕这些虫子了",0 } }} ,
   [2] = { task={2,11},selection = {"",0} },
}

剧情表[100033] = 
{
	npcimg = "spr/头像/1.spr",

	[1] = { info = "咳...咳，老身要是还能动弹，何劳你们这些年轻人帮忙啊。", selection={ {"前辈保重身体",0} } } ,
}


剧情表[100034] = 
{
	npcimg = "spr/头像/1.spr",

	[1] = { info = "不错、不错，年轻人有这耐性何愁大事不成啊。帮老身最后个忙吧，这金顶上猴子野性难驯，时常来这茶园捣乱，你替老身去吓吓他们，让它们以后不敢再来就是。", selection={ {"晚辈这就去",2},{"歇息片刻",0 } }} ,
   [2] = { task={2,12},selection = {"",0} },
}


剧情表[100035] = 
{
	npcimg = "spr/头像/1.spr",

	[1] = { info = "眼看着茶叶就有收成了，却被那些虫子糟蹋，老身真是心有不甘啊。", selection={ {"前辈莫要着急，我这就为你除去那些虫子",0} } } ,
}

剧情表[100036] = 
{
	npcimg = "spr/头像/1.spr",

	[1] = { info = "小姑娘，这么一会儿功夫，你都帮我做了三件事啦，这茶叶你就拿去吧。", selection={ {"如此多谢前辈",2},{"歇息片刻",0}} } ,
   [2] = { task={2,13},selection = {"",0} },
}


剧情表[100037] = 
{
	npcimg = "spr/头像/1.spr",

	[1] = { info = "那些猴子吓吓它们就好了，莫要伤了它们的性命。", selection={ {"晚辈知道了",0} } } ,
}


剧情表[100038] = 
{
	npcimg = "spr/头像/3.spr",

   [1] = { cg = 35 , selection = {{"",2}} },
   [2] = { task={2,14},selection = {"",0} },
}

剧情表[100039] = 
{
	npcimg = "spr/头像/2.spr",

	[1] = { info = "你们都先退下吧，为师想好好静静，本门的护体神功你有空就抽时间学了吧。", selection={ {"师父保重（看来得去丁师姐那儿一趟）",2},{"歇息片刻",0}} } ,
   [2] = { task={2,15},selection = {"",0} },
}

剧情表[100040] = 
{
	npcimg = "spr/头像/9.spr",

	[1] = { info = "师妹你可终于来了，我等你可很久了。", selection={ {"师姐找我什么事",2} } } ,
	[2] = { info = "听说师父挺器重你啊，学了不少武功吧，做师姐的想试试你的武艺。", selection={ {"师姐此话何意",3} } } ,
	[3] = { info = "少废话，装什么蒜，看剑吧！", selection={ {"师姐且慢（进入战斗）",4},{"歇息片刻",0}} } ,
   [4] = { task={2,16},selection = {"",0} },
}

剧情表[100041] = 
{
	npcimg = "spr/头像/2.spr",

	[1] = { info = "为师欣赏你的胆色，也器重你的资质，这次华山论剑就由你陪同芷若一起前往吧。路途遥远，为师赠你快马一匹，早日上路。", selection={ {"多谢师父",2},{"歇息片刻",0}} } ,
   [2] = { task={2,17},selection = {"",0} },
}

剧情表[100042] = 
{
	npcimg = "spr/头像/9.spr",

	[1] = { info = "少废话，装什么算，看剑吧。", selection={ {"师姐且慢（进入战斗）",2},{"歇息片刻",0}} } ,
	[2] = { onClick="OnClickTask50002",selection = {"",0} },
}

剧情表[100043] = 
{
	npcimg = "spr/头像/2.spr",

	[1] = { info = "沿途舟车劳顿，京城繁华之地或有武林盟的接引使者，路过那里的时候不妨歇息片刻。", selection={ {"继续",2} } } ,
	[2] = { info = "动身先前往门派驿站，让其传送至京城吧。", selection={ {"那徒儿就先告辞了",3},{"歇息片刻",0}} } ,
   [3] = { task={2,19},selection = {"",0} },
}




----------------------------------------------------------------------------------------少林
------------首次进入游戏提示
剧情表[60000] = 
{
	npcimg = "spr/头像/少林僧人.spr",

	[1] = { info = "这五大门派中，唯独少林只有男弟子，看来真是投错门派了。", selection={ {"继续",2} } } ,
	[2] = { info = "不过少林乃名门正派，学武修佛，寺内众僧人应该还是很好相处的。", selection={ {"继续",3}} } ,
	[3] = { info = "还是先进寺门吧，看澄空大师给我分配到哪一房去。", selection={ {"进入寺门",4}} } ,
	[4] = { task={1,1,1},selection = {"",0} },
}


剧情表[100047] = 
{
	npcimg = "spr/头像/14.spr",

	[1] = { info = "阿弥陀佛，来者可是新入寺的弟子，贫僧在此等候已多时。", selection={ {"让师叔久侯了",2} } } ,
	[2] = { info = "自此刻起你便是一名真正的少林入室弟子，其余繁文缛节可一概略过。你先去寺内香积厨找那伙头师兄报道，他那里人手已经空缺很久了。", selection={ {"弟子这就去",3}} } ,
	[3] = { info = "且慢，过去的时候先从木人巷基本功房朽木人身上弄几块朽木柴火给伙头师兄带去。我现在传你少林一式武功，也便于你出入木人巷。", selection={ {"多谢师叔",4},{"歇息片刻",0}} } ,
	[4] = { task={1,2},selection = {"",0} },
}

剧情表[100048] = 
{
	npcimg = "spr/头像/14.spr",

	[1] = { info = "将我刚才赠与你的武器拿在手中，看看是否合适。", selection={ {"弟子明白",2},{"歇息片刻",0}} } ,
	[2] = { task={1,3},selection = {"",0} },
}

剧情表[100049] = 
{
	npcimg = "spr/头像/14.spr",

	[1] = { info = "如此出入木人巷也可轻松一点，你现在就去那里自朽木人身上取些朽木柴火给伙头师兄带去吧。", selection={ {"弟子明白",2},{"歇息片刻",0}} } ,
	[2] = { task={1,4},selection = {"",0} },
}

剧情表[100050] = 
{
	npcimg = "spr/头像/14.spr",

	[1] = { info = "将我刚才赠与你的武器拿在手中，看看是否合适。", selection={ {"弟子遵命",0} } } ,
}

剧情表[100051] = 
{
	npcimg = "spr/头像/17.spr",

	[1] = { info = "这香积厨可不是养闲人的地方，在这呆着就得干活儿。", selection={ {"是，弟子明白",2} } } ,
	[2] = { info = "以后少帮那个蠢东西说话，做好自己的事儿吧。看在你还算勤快的份儿上，给你个轻松的活儿。", selection={ {"师兄请吩咐",3}} } ,
	[3] = { info = "去给我打听打听，这次华山论剑的人选到底定好了没有，这事儿于你于我都有好处。", selection={ {"弟子这就去",4}} } ,
	[4] = { info = "蠢货，你知道上哪儿打听吗！去澄武师兄那儿探探口风吧，嘴巴放利索点儿！", selection={ {"弟子明白了",5},{"歇息片刻",0}} } ,
	[5] = { task={1,5},selection = {"",0} },
}

剧情表[100052] = 
{
	npcimg = "spr/头像/14.spr",

	[1] = { info = "少林木人巷离此处不远，片刻功夫就可到，只是要小心其中的朽木人。", selection={ {"是，弟子明白",0} } } ,
}

剧情表[100053] = 
{
	npcimg = "spr/头像/17.spr",

	[1] = { info = "这厨房的事可越来越多了，也不知寺里几时给我派个人手过来。喂，那边的小子，干嘛的！", selection={ {"还是拿了柴火再来见过此人",0} } } ,
}

剧情表[100054] = 
{
	npcimg = "spr/头像/13.spr",

	[1] = { info = "看你满面尘灰的模样，定是从那香积厨来的伙头吧，不在那里好好烧火，到我这里何干？", selection={ {"小僧见过师叔 ",2} } } ,
	[2] = { info = "倒是个懂礼数的人，可是你们管事又派你来向我要人了啊！都说了，最近寺中准备华山论剑盛会，腾不出人手，叫他多等些时日。", selection={ {"是，是，我回去就跟管事说说",3} } } ,
	[3] = { info = "怎么还不走！可是另有其他的事情？", selection={ {"其实小僧是听寺中传闻，这次华山论剑的人选可是...师叔您？",4} } } ,
	[4] = { info = "这些僧人整日里不好好修习功课，尽晓得传这些风言风语，看我回头不好好收拾他们。不过他们说得不错，这次去华山的人选，恐怕非我莫属了。", selection={ {"听说各派都收到了英雄帖，不知师叔可否让小僧见识见识",5} } } ,
	[5] = { info = "你知道的还真多，给你瞧瞧也无妨，待我拿给你仔细的看看，免得你们这些弟子眼馋。", selection={ {"多谢师叔成全",6} } } ,
	[6] = { info = "啧，这英雄帖明明就放在怀中，怎么此刻却不见了！莫非刚才走动之时不慎遗失，这可如何是好！", selection={ {"师叔可否描述一下这帖子的模样",7} } } ,
	[7] = { onClientClick="yingxiongtieshaolin", selection = {"",8} },
	[8] = { info = "就是这个样子了，你可一定要帮我找到啊！", selection={ {"小僧尽力而为",9},{"歇息片刻",0}} } ,
   [9] = { task={1,6},selection = {"",0} },
}


剧情表[100055] = 
{
	npcimg = "spr/头像/17.spr",

	[1] = { info = "这家伙...咳...咳...什么时候居然学了这么高深的...武功！", selection={ {"师兄别着急，慢慢说 ",2} } } ,
	[2] = { info = "咳...咳...刚他以手燃物所使武功，乃少林七十二绝技之一的火云功。呼...呼...，之后打我那一掌是玄苦大师的成名绝技大慈大悲手。", selection={ {"继续",3} } } ,
	[3] = { info = "此两种武功都是少林极高深的武学，非几十年纯熟功力不得修成。咳...此人城府极深，在我眼皮子底下深藏这么多年，竟没被发现，也是我一时大意了。", selection={ {"刚听他说可是要大闹少林寺",4} } } ,
	[4] = { info = "糟了！玄慈方丈正在大殿之前召开集会，宣布此次华山论剑的人选，咳...咳...快去通知方丈，快去！", selection={ {"弟子这就去",5},{"歇息片刻",0}} } ,
   [5] = { task={1,7},selection = {"",0} },
}

剧情表[100056] = 
{
	npcimg = "spr/头像/10.spr",


   [1] = { info = "你是才入门的伙房杂役么？慌慌张张的所来何事？", selection={ {"方丈，大事不好了",2}} } ,
   [2] = { info = "有什么紧要的事稍等一下再说，众多弟子已经在大殿等我宣布华山论剑的人选了。", selection={ {"可是，方丈。。。。。。",3}} } ,
   [3] = { info = "好了，等我回来再说吧。", selection={ {"…………",4}} } ,
   [4] = { cg = 44,selection = {{"",5} } },  
   [5] = { info = "这火工头陀一身好武艺，却不行正道，实乃可惜。", selection={ {"刚才弟子正想禀报此事",6}} } ,
   [6] = { info = "哎，罢了，这些都是命数。眼下最紧要之事，就是防止那火工头陀去木人巷再生事端，毁我少林珍宝金刚铜人，你去通知木人巷各层看守的弟子，务必让他们严加防范！", selection={ {"弟子遵命",7}} } ,
   [7] = { task={1,8},selection = {"",0} },
}
---------------------插入
剧情表[100001] = 
{
	npcimg = "spr/头像/止清.spr",

	[1] = { info = "我算好必会有人追来，只是不曾想过来者竟是一个新入弟子，看来寺中人手空虚，着实危矣！", selection={ {"小僧见过师兄，请让我过去",2} } } ,
	[2] = { info = "那火工头陀硬闯木人巷，我们想拦却是拦不住。只是这木人巷的规矩却不能因此而破，若要通过层层机关，还得靠你自己。", selection={ {"请师兄言明",3} } } ,
	[3] = { info = "木人巷内各层都有高人看守，要想通过那里，需得经过他们的考验才行，此去道路艰险，你还得多加留意。", selection={ {"谢师兄提醒，我去了",4},{"歇息片刻",0}} } ,
   [4] = { task={1,9},selection = {"",0} },
}

剧情表[100002] = 
{
	npcimg = "spr/头像/止湛.spr",

	[1] = { info = "师弟不必多说，想来止清师兄已经向你言明，要想通过此处，需得经受考验！", selection={ {"小僧愿意接受考验",2} } } ,
	[2] = { info = "木人巷基本功房原为磨砺僧人筋骨而设，你只需将那些桐木人一一击败，就可过关。", selection={ {"谢师兄提醒，我去了",3},{"歇息片刻",0}} } ,
   [3] = { task={1,10},selection = {"",0} },
}

剧情表[100003] = 
{
	npcimg = "spr/头像/止湛.spr",

	[1] = { info = "此乃千百年亘古不变的规矩，我等不能轻易破除，你还是乖乖的去将那些桐木人击败之后再行前进吧！", selection={ {"小僧明白了",0} } } ,
}

剧情表[100004] = 
{
	npcimg = "spr/头像/15.spr",

	[1] = { info = "此乃千百年亘古不变的规矩，我等不能轻易破除，你还是乖乖的去将那些桐木人击败之后再行前进吧！", selection={ {"小僧明白了",0} } } ,
}

剧情表[100005] = 
{
	npcimg = "spr/头像/16.spr",

	[1] = { info = "刚那小子跑哪儿去了，奶奶的，怎么一溜烟就不见了！", selection={ {"此人莫不是疯了",0} } } ,
}

剧情表[100006] = 
{
	npcimg = "spr/头像/止渊.spr",

	[1] = { info ="想不到居然还能有人来到这里，莫非那火工头陀另有帮凶！", selection={ {"见过师兄，小僧正是奉方丈之命前来追捕此人",2} } } ,
   [2] = { info ="你来晚一步，此刻他已闯进去了，我等尚阻他不住，你又能拿他如何。我劝你还是回去禀明方丈，多派些人手来吧。", selection={ {"怕是来不及了，师兄让我进去看看究竟吧",3} } } ,
	[3] = { info ="哎，你又何必如此执着，自己多加小心吧，阿弥陀佛！", selection={ {"如此多谢师兄",4},{"歇息片刻",0} } } ,
	[4] = { task={1,18},selection = {"",0} },
}

---------------------
剧情表[100057] = 
{
	npcimg = "spr/头像/15.spr",

	[1] = { info ="想不到此人轻功竟是如此厉害，凭我这般身手居然也追不上。", selection={ {"小僧见过师兄，不知师兄口中所说可是那火工头陀",2} } } ,
        [2] = { info ="正是此人，木人巷鲜有僧人进出，我见他前来便上前询问，怎料他身子竟突然斜飞而出，使得乃是一招千斤顶，不过用法着实古怪。", selection={ {"然后呢",3} } } ,
        [3] = { info ="我若不及时躲开，只怕他这一顶就立马要了我的命去。我急忙闪过一边，却不料此乃他使的虚招，他原本就只想通过此路，不想多做逗留。", selection={ {"如此我需立即动身才行",4} } } ,
	[4] = { info ="看你身手实是远在那火工头陀之下，这一去岂不白白送死。我来教你少林【轻功】步伐，也可助你一臂之力，必要之时还可保你性命。", selection={ {"如此多谢师兄",5},{"歇息片刻",0} } } ,
	[5] = { task={1,11},selection = {"",0} },
}

剧情表[100058] = 

{
	npcimg = "spr/头像/15.spr",

	[1] = { info = "情势紧急，也不容我多费口舌，你去那铁钉阵之中自七巧机关上取来我的天工锁匙，便算你过关，我自可放你通行。", selection={ {"师兄在这等我",2},{"歇息片刻",0} } } ,
	[2] = { task={1,12},selection = {"",0} },
}

剧情表[100059] = 
{
	npcimg = "spr/头像/15.spr",

	[1] = { info = "如此，轻功也算到了一定火候了，师弟还请自便。前方乃木人巷招式房，看守那里的是澄受师叔，他当不会太为难你，阿弥陀佛。", selection={ {"多谢师兄提醒",2},{"歇息片刻",0} } } ,
   [2] = { task={1,13},selection = {"",0} },
}

剧情表[100060] = 
{
	npcimg = "spr/头像/15.spr",

	[1] = { info = "情势紧急，也不容我多费口舌，你去那铁钉阵之中自七巧机关上取来我的天工锁匙，便算你过关，我自可放你通行。", selection={ {"师兄在这等我",2},{"歇息片刻",0} } } ,
   [2] = { onClick="OnClickTask50025",selection={"",0}}
}

剧情表[100061] = 
{
	npcimg = "spr/头像/16.spr",

	[1] = { info = "怎么，小子，你也想来试试洒家的金钟罩护体神功，只要你不像刚才那个鸟人那般，即使先让你打几拳我也无妨。", selection={ {"师兄所指之人是否是一个火工头陀？",2}} } ,
   [2] = { info = "就是那个鸟人，他若敢面对面的跟我斗上几百个回合，谅他也伤不了我分毫。", selection={ {"那如何师兄竟让他溜过去了",3}} } ,
   [3] = { info = "那小子见打不动我，就趁我不注意居然避实就虚耍了个花招，也不知怎么就从我眼前闪过去了，再要追却是来不及了，哎！", selection={ {"连晦恶师兄也没能拦住此人...",4} } } ,
   [4] = { info = "谁说我拦不住他，只是这小子太过狡猾而已，哼！凭洒家的护体神功，任他再来几个，也不是我的对手，怎么小子，你想不想学啊，洒家倒是可以传你。", selection={ {"小僧求之不得",5} } } ,
   [5] = { info = "哈哈哈，学成之后别忘了去给我狠狠的教训那个鸟人！不过洒家也得看看你的功底，去给我收拾掉几个黄铜人让我瞧瞧，那些玩意儿平时也只配让我练练手而已。", selection={ {"小僧遵命",6},{"歇息片刻",0} } } ,
	[6] = { task={1,16},selection = {"",0} },
}

剧情表[100062] = 
{
	npcimg = "spr/头像/16.spr",

	[1] = { info = "你这小子，底子倒是挺扎实，不如留在这里让我多指点你一下，保准你几年之内，江湖之上能胜你的就没几个了，如何？", selection={ {"这可使不得",2} } } ,
   [2] = { info = "啊呸！我晦恶从来不收徒弟，今儿看你还算个可造之材才决心破个例，你此刻不愿意，将来可别后悔啊，臭小子！", selection={ {"别过师兄，小僧这就走了",3},{"歇息片刻",0} } } ,
	[3] = { task={1,17},selection = {"",0} },
}

剧情表[100063] = 
{
	npcimg = "spr/头像/16.spr",

	[1] = { info = "哈哈哈，臭小子，你以为那些黄铜人是那么容易对付的吗，那可是少林的秘宝，是...唔，这个不能说。", selection={ {"得拿出真本事了",0} }} ,
}

剧情表[100064] = 
{
	npcimg = "spr/头像/11.spr",

	[1] = { info = "阿弥陀佛，想不到你小小年纪，居然也能到达老衲这里！", selection={ {"见过师叔，小僧深知木人巷规矩，望师叔速速出题让我过去",2} } } ,
   [2] = { info = "老衲即使此刻放你过去，凭你现在的武功又能拿那个火工头陀如何！为今之计，老衲便先将少林二式武功传授于你，希望你学成之后，能去阻住此人。", selection={ {"多谢师叔",3},{"歇息片刻",0} } } ,
   [3] = { task={1,14},selection = {"",0} },
}

剧情表[100065] = 
{
	npcimg = "spr/头像/11.spr",

	[1] = { info = "如此老衲也没什么可以教你的了，现在你就只管径直前去吧，前方虽有些许阻碍，但料想不会对你造成太多麻烦。", selection={ {"不知还有何种关卡",2} } } ,
   [2] = { info = "前面不远处守在那里的是少林的戒律罗汉，个个武艺高强，铜头铁臂，他们可不会讲什么情面，你也不必多作口舌，只能硬闯过去了。", selection={ {"多谢师叔提醒",3},{"歇息片刻",0} } } ,
   [3] = { task={1,15},selection = {"",0} },
}


剧情表[100067] = 
{
	npcimg = "spr/头像/11.spr",

	[1] = { info = "戒律罗汉个个铜头铁臂，武艺高强，你需多加小心。", selection={ {"多谢师叔提醒",0} } } ,
}

剧情表[100068] = 
{
	npcimg = "spr/头像/18.spr",

	[1] = { info = "忍气吞声这么多年，可终于让我等到了这一天，若不是我早有准备，这木人巷怕是没那么容易进的来。", selection={ {"歇息片刻",0} } } ,
}

剧情表[100069] = 
{
	npcimg = "spr/头像/10.spr",

	[1] = { info = "阿弥陀佛，你可曾追到那火工头陀？", selection={ {"弟子无能，让他逃了",2} } } ,
   [2] = { info = "此人武功高强，你能全身而退已属不易。少林自建寺以来，声名远扬，没想到这次竟遭受如此重创。",  selection={ {"继续",3} }} ,
	[3] = { info = "是老衲平日里对弟子太过纵容，这头陀受了委屈又无处申诉，才走上极端。若是老衲能早些管教，也不至于…", selection={ {"方丈莫要自责",4} }} ,
   [4] = { info = "你要谨记这次教训，勤加修习，日后行走江湖，切莫和人争强斗胜。眼下华山论剑在即，你且跟随武林房住持澄空前往华山一趟，也好多点见识。", selection={ {"弟子遵命",5} ,{"歇息片刻",0} }} ,
   [5] = { task={1,20},selection = {"",0} },
}



剧情表[100072] = 
{
	npcimg = "spr/头像/14.spr",

	[1] = { info = "你就随我共上华山，见识见识这一场武林盛会吧。此间路途遥远，我们先往京城稍作歇息，再行上路。", selection={ {"继续",2} }} ,
	[2] = { info = "动身先去门派驿站，让其带往京城吧。", selection={ {"弟子遵命",3} ,{"歇息片刻",0} }} ,
   [3] = { task={1,21},selection = {"",0} },
}



  ------------------木人巷不可进入提示
剧情表[50000] = 
{
	npcimg = "spr/头像/峨嵋派弟子.spr",

	[1] = { info = "尚未通过止清的考验，不可进入下一个场景", selection={ {"确定",0} } } ,
}

剧情表[50001] = 
{
	npcimg = "spr/头像/峨嵋派弟子.spr",

	[1] = { info = "尚未通过晦明的考验，不可进入下一个场景", selection={ {"确定",0} } } ,
}

剧情表[50002] = 
{
	npcimg = "spr/头像/峨嵋派弟子.spr",

	[1] = { info = "尚未通过澄受的考验，不可进入下一个场景", selection={ {"确定",0} } } ,
}

剧情表[50003] = 
{
	npcimg = "spr/头像/峨嵋派弟子.spr",

	[1] = { info = "尚未通过晦恶的考验，不可进入下一个场景", selection={ {"确定",0} } } ,
}




----------------------------------------------------------------------------------------------武当
------------首次进入游戏提示
剧情表[60002] = 
{
	npcimg = "spr/头像/100.spr",

	[1] = { info = "武当山上风景如画，武当派中侠义名声。既然已选择武当派，自当行侠仗义，做一个顶天立地的武当弟子。", selection={ {"继续",2} }} ,
	[2] = { info = "如今先上山拜见师父宋远桥，希望能学的一身好武功，在江湖上才能闯出个名堂。", selection={ {"踏入山门",3} }} ,
	[3] = { info = "咦，才进山门，这地上是个什么东西？", selection={ {"拣来看看",4} }} ,
	[4] = { onClientClick="yingxiongtie", selection = {"",5} },
   	[5] = { info = "武林盟？华山论剑？这是怎么回事？先不管这么多了，还是先去找师父，让他定夺吧。",selection = {{"前往宋远桥处",6}} },
   	[6] = { task={5,1,1},selection = {"",0} }, 
}

剧情表[100087] = 
{
	npcimg = "spr/头像/100.spr",

	[1] = { info = "武当山上风景如画，武当派中侠义名声。既然已选择武当派，自当行侠仗义，做一个顶天立地的武当弟子。", selection={ {"继续",2} }} ,
	[2] = { info = "如今先上山拜见师父宋远桥，希望能学的一身好武功，在江湖上才能闯出个名堂。", selection={ {"踏入山门",3} }} ,
	[3] = { info = "咦，才进山门，这地上是个什么东西？", selection={ {"拣来看看",4} }} ,
	[4] = { onClientClick="yingxiongtie", selection = {"",5} },
   [5] = { info = "武林盟？华山论剑？这是怎么回事？先不管这么多了，还是先去找师父，让他定夺吧。",selection = {{"前往宋远桥处",6}} },
   [6] = { task={5,1,1},selection = {"",0} }, 
}

剧情表[100088] = 
{
	npcimg = "spr/头像/36.spr",

	[1] = { info = "你可是今日才入我武当门下的弟子么？",selection={ {"弟子正是，弟子既入武当，定当不辱武当名声",2} }} ,
	[2] = { info = "好，我武当之人最重侠义二字，你日后行走江湖须牢记，万不可做出伤天害理之事。",selection={ {"弟子明白",3} }} ,
	[3] = { info = "刚才青书孩儿已经与我说了华山论剑之事，这事太师父自会安排，你等新进弟子还是练好武艺才是正事。",selection={ {"弟子知道",4} }} ,
	[4] = { info = "为师现在传你武当入门剑法【仗剑式】，日后仗剑江湖，行侠仗义。你仔细看好，多多领悟其中奥秘。",selection={ {"弟子用心领悟",5}, {"歇息片刻",0}} } ,
   [5] = { task={5,2},selection = {"",0} },
}

剧情表[100085] = 
{
	npcimg = "spr/头像/36.spr",
   [1] = { info = "刚才为师练的这【仗剑式】，不知你领悟了多少？需知武学境界必须勤加练习，才能更上一层。",selection={ {"弟子明白",2} }} ,
   [2] = { info = "为师这里还有一柄青铜剑，你在用【仗剑式】之前，需先装备上，方才能得心应手。你且拿在手上看看是否趁手。",selection={ {"弟子多谢师父",3}, {"歇息片刻",0}} } ,
   [3] = { task={5,16},selection = {"",0} },
}

剧情表[100070] = 
{
	npcimg = "spr/头像/36.spr",

	[1] = { info = "将青铜剑拿在手上让为师瞧瞧，也不知道是否趁手。", selection={ {"路过",0} }} ,
}

剧情表[100089] = 
{
	npcimg = "spr/头像/36.spr",

	[1] = { info = "现在你可以先去真武道场，用这【仗剑式】与真武道场的几位前辈驾驭的飞剑过招，取下飞剑之上的剑穗，交与天璇道人。",selection={ {"弟子多谢师父",2}, {"歇息片刻",0}} } ,
   [2] = { task={5,3},selection = {"",0} },
}

剧情表[100090] = 
{
	npcimg = "spr/头像/40.spr",

   [1] = { info = "远桥说的新进弟子就是你么？看来我们这几个老头子驾驭的飞剑已经不是你的对手了，这些剑穗我拿去收拾一下做为给张真人的寿礼吧。",selection={ {"多谢道长",2} } } ,
   [2] = { info = "明日就是张真人百岁寿辰了，你这个新进弟子也去给他老人家拜个寿吧。",selection={ {"我这就去",3}, {"歇息片刻",0}} } ,
   [3] = { task={5,4},selection = {"",0} },
}

剧情表[100091] = 
{
	npcimg = "spr/头像/36.spr",

	[1] = { info = "真武飞剑就在真武道场之中，你此去务必多加小心，取得剑穗之后就地交给天璇道人即可，他自会替你转交师祖。", selection={ {"是",0} }} ,
}

剧情表[100110] = 
{
	npcimg = "spr/头像/40.spr",

	[1] = { info = "明日即是道兄的百岁寿辰了，不知门下诸多弟子会准备些什么贺礼呢。", selection={ {"路过",0} }} ,
}

剧情表[100092] = 
{
	npcimg = "spr/头像/35.spr",

   [1] = { info = "为了谢逊的事情，这帮少林和尚还真是不依不饶了，看来明天不用真武七截剑阵打法他们走是不行了。",selection={{"太师父，我是来给您拜寿的",2}}},
   [2] = { info = "哈哈，还是我武当门下弟子懂事，不像少林和尚那般讨厌。你就是远桥才收的弟子么？", selection={ {"弟子正是",3} } } ,
   [3] = { info = "你来的正好，你快去帮我找一下你大师兄宋青书，让他明日来结这真武七截剑阵，免得几个老和尚纠缠不清。", selection={ {"弟子遵命",4}, {"歇息片刻",0}} } ,
   [4] = { task={5,5},selection = {"",0} },
}

剧情表[100093] = 
{
	npcimg = "spr/头像/38.spr",

   [1] = { info ="你来找我做什么？那华山论剑可是武林盛会，你这新进弟子可没资格跟我一起前去。", selection={ {"大师兄误会了，是太师祖让我来找你的",2} } } ,
   [2] = { info = "啊？是结阵这事？这三个少林和尚内力惊人，又是为报血海深仇来的，动起手来会不会。。。。。。。", selection={ {"啊，大师兄你害怕了？",3}} } ,
   [3] = { info = "要是我父亲和几位师伯一起结阵，我怕什么。但这次结阵都是你们这些新进弟子，你们有什么用，难道让我以一敌三？", selection={ {"大师兄，你太看不起我们新进弟子了",4}} } ,
   [4] = { info = "哼！你既不会轻功，不知阵法奇妙，又不会八卦剑法，甚至连我武当基本八卦套装也没有，如此说来，还真是没用。", selection={ {"那我即刻就去学！",5}, {"歇息片刻",0}} } ,
   [5] = { info = "哈哈，学？谅你一个新入门弟子，都不知我武当轻功【梯云纵】该从何处去学。", selection={ {"师兄若能告知，我自能去学",6}, {"歇息片刻",0}} },
   [6] = { info = "告诉你也无妨，凭你资质，岂能在短短时间内从天枢道人那里领会我武当轻功之奥秘。", selection={ {"天枢道人？弟子明白了",7}, {"歇息片刻",0}} },
   [7] = { task={5,6},selection = {"",0} },
}

剧情表[100094] = 
{
	npcimg = "spr/头像/40.spr",

   [1] = { info ="如今你已学会我武当正宗轻功【梯云纵】，但是还不够纯熟，想要结真武七截剑阵尚显稚嫩。", selection={ {"敢问道长，如何才算纯熟",2} }} ,
   [2] = { info ="你且去对面采几块矿石回来，倘若你能在石柱间来去自如，方才能算纯熟。", selection={ {"弟子明白",3} , {"歇息片刻",0}} } ,
   [3] = { task={5,7},selection = {"",0} },
}

剧情表[100095] = 
{
	npcimg = "spr/头像/40.spr",

	[1] = { info ="不错，只用了如此短的时间就取回来了，看来你对【梯云纵】已经很熟练了，你可以从我这里出师了。",selection={ {"多谢道长",2} }} ,
	[2] = { info = "既然你已学会了轻功，你现在可以去真武道场找天权道人传你真武七截剑阵的阵法真髓了。", selection={ {"弟子这就前去",3}, {"歇息片刻",0}} } ,
	[3] = { task={5,8},selection = {"",0} },
}

剧情表[100096] = 
{
	npcimg = "spr/头像/40.spr",

	[1] = { info = "矿石就在就在八卦坛对面的山崖处，只需按我所授步伐从柱子上跳过去即可。", selection={ {"多谢指点",2}, {"歇息片刻",0}} } ,
   [2] = { onClick="OnClickTask50008",selection={"",0}}
}

剧情表[100097] = 
{
	npcimg = "spr/头像/40.spr",

   [1] = { info = "老夫在这真武道场已许久不曾见人，你能寻得此地，当是你我有缘。", selection={ {"是天枢道人让我来找你传我真武七截剑阵精髓的",2} }} ,
   [2] = { info = "小兄弟看来是才入我武当派，都不知我这里规矩。", selection={ {"请问道长有何规矩",3} }} ,
   [3] = { info = "来找我之人，需有我武当派入门套装—【八卦套装】，然后才能传你。", selection={ {"弟子才入武当，不知去哪里找这些",4} }} ,
   [4] = { info = "你看见周围这些八卦卜爻了么？只要你能击败这些八卦卜爻。自然可以找到一套【八卦套装】。", selection={ {"是，弟子明白",5}, {"歇息片刻",0}} } ,
   [5] = { task={5,9},selection = {"",0} },
}

剧情表[100098] = 
{
	npcimg = "spr/头像/40.spr",

	[1] = { info = "很好，这般才合我规矩，刚才在与八卦卜爻交手时可曾有何感悟？", selection={ {"八卦卜爻，位位相生，步步相克，实乃精妙",2} } } ,
	[2] = { info = "哈哈，这样你也能看出来，看来你资质确有过人之处。我现在连【八卦剑法】与真武七截剑阵精髓一起传与你吧。", selection={ {"弟子谢过道长",3}, {"歇息片刻",0}} } ,
	[3] = { task={5,10},selection = {"",0} },
}

剧情表[100099] = 
{
	npcimg = "spr/头像/40.spr",

   [1] = { info = "八卦卜爻，各处八方位置，你还需细细寻找。", selection={ {"是",0} }} ,

}

剧情表[100100] = 

{
	npcimg = "spr/头像/40.spr",

   [1] = { info = "这【八卦剑法】跟你师父传你的【仗剑式】大有不同，唯有你多加修炼才能明白。", selection={ {"弟子明白",2} } } ,
   [2] = { info = "既如此，你再去真武道场中间帮我看看，那近日时时人影鬼祟，去试试你才学的【八卦剑法】吧", selection={ {"弟子这就前去",3}, {"歇息片刻",0}} } ,
   [3] = { task={5,11},selection = {"",0} },
}

剧情表[100101] = 
{
	npcimg = "spr/头像/40.spr",

   [1] = { info = "如何，现在已经能将【仗剑式】和【八卦剑法】运用的得心应手了吧。", selection={ {"弟子已经很熟练了",2} }} ,
	[2] = { info = "那你快去找张真人吧，以你现在的功力，会让他大吃一惊的。", selection={ {"弟子这就去了",3} , {"歇息片刻",0}} } ,
   [3] = { task={5,12},selection = {"",0} },
}

剧情表[100102] = 
{
	npcimg = "spr/头像/40.spr",

	[1] = { info = "权且当作对你的一次考验吧，想来不是什么难事。", selection={ {"是",0} }} ,

}

剧情表[100103] = 
{
	npcimg = "spr/头像/35.spr",

	[1] = { info = "青书如何不到？", selection={ {"大师兄不屑与新入门弟子一起结阵",2} }},
	[2] = { info = "说话间少林和尚便到，如今如何结阵？" ,selection={ {"弟子已从天权道人处习得阵法精髓，不如让我代替大师兄试试",3}} } ,
        [3] = { info = "如此也好，就让你们几位新入门弟子磨练一番。少林是名门正派，较量之时必会点到为止，你们不必担心。", selection={ {"弟子遵命",4}, {"歇息片刻",0}} } ,
        [4] = { info = "少林高僧已到，速速结阵吧。",selection = {{"是",5}} },  
        [5] = { cg = 22,selection = {{"",6} } },  
	[6] = { info = "看你刚才踏阵步伐颇具功力，想不到你小小年纪又初入山门不久，竟已修习至如此境界，真是可喜可贺。青书孩儿虽也天资上佳，但究竟不如你这般努力。", selection={ {"继续",7} }},
	[7] = { info = "此次华山论剑我本是叫他陪同你师伯张松溪一起前去观摩大会，现如今我看你倒更加合适，你先将此事转告青书吧。" ,selection={ {"弟子惶恐，只怕师兄他心生不满",8}} } ,
    [8] = { info = "青书已在这武当山上修习多年，武德自是与武功并进，想来他也不会计较这么多，你只管放心前去就是。以你目前资质，当可学成【护体】神功，切莫忘了。", selection={ {"弟子遵命",9}, {"歇息片刻",0}} } ,
	[9] = { task={5,13},selection = {"",0} },
}


剧情表[100104] = 
{
	npcimg = "spr/头像/38.spr",

   [1] = { info = "看你这般模样，想是不敌少林和尚了吧。哼，找一些新进弟子去结阵，真不知道太师父怎么考虑的。", selection={ {"大师兄，其实是我们把少林和尚打跑了",2}} } ,
   [2] = { info = "什么？就凭你们几个新进弟子居然能抵挡住三位少林高僧？", selection={ {"现在师兄总不会看不起新进弟子了吧",3}} } ,
   [3] = { info = "算了，就当你们运气好，我也不计较了。反正明日我就要去华山参加论剑了，你们新进弟子还是只能在武当留着。", selection={ {"这个。。大师父叫我替你去",4} } } ,
   [4] = { info = "什么！定是你在太师父面前说了我的不是，才会让他改变心意。", selection={ {"师兄息怒，我不曾在太师祖面前说你半点恶语",5} } } ,
   [5] = { info = "好啊，没想到你居然是如此小人，如让你上华山，岂不是丢我武当颜面，看剑！", selection={ {"师兄且慢（进入战斗）",6},{"暂避锋芒",0} } } ,
   [6] = { task={5,14},selection = {"",0} },
}

剧情表[100105] = 
{
	npcimg = "spr/头像/35.spr",

	[1] = { info = "青书这孩儿自恃天资聪慧，武学之上却从不努力，该当遭此一击。望他以后能有所醒悟，那也是塞翁失马焉知非福。", selection={ {"继续",2} }},
   [2] = { info ="你且速速前去追随你师伯张松溪吧，他已早你一步出发了，迟了只恐你就赶不上了。此间路途遥远，这匹宝马为师就赠于你了。", selection={ {"弟子遵命，即刻动身",3}, {"歇息片刻",0}} } ,
	[3] = { task={5,15},selection = {"",0} },
}

剧情表[100106] = 
{
	npcimg = "spr/头像/38.spr",

	[1] = { info = "你若想在这武当派内统领众师兄弟，还得先问过我手中长剑。看剑！", selection={ {"师兄且慢（进入战斗）",2},{"暂避锋芒",0 }}} ,
	[2] = { onClick="OnClickTask50006",selection = {"",0} },
}

剧情表[100107] = 
{
	npcimg = "spr/头像/35.spr",

	[1] = { info = "将此事转告青书之后就速来回禀，少时你师伯就要启程了。", selection={ {"是",0} }} ,
}

剧情表[100044] = 
{
	npcimg = "spr/头像/35.spr",

   [1] = { info ="你此去必会途径京城繁华之地，你师伯或许也会在那里停留片刻，你可寻那武林盟使者让其给你安排，稍作歇息之后再行上路也不迟。", selection={ {"继续",0} }} ,
   [1] = { info ="动身先前往门派驿站，让其带你去京城吧。", selection={ {"那弟子就告辞了",2}, {"歇息片刻",0}} } ,
	[2] = { task={5,17},selection = {"",0} },
}



-------------------------------------------------
-------------------------------------------------星宿

剧情表[60004] = 
{
	npcimg = "spr/头像/星宿弟子.spr",

	[1] = { info = "早有听闻武林传言说，星宿派是个极为歹毒的邪派，想不到今日我竟然拜入此派门下。", selection={ {"继续",2} } } ,
	[2] = { info = "不过丁春秋武功盖世，江湖上人人望而生畏，指不定我也能学到一身出神入化的本事，到时再走正道也不迟。", selection={ {"继续",3}} } ,
	[3] = { info = "眼下最紧要之事，还是去找大师姐阿紫，学几手入门功夫，有了本事才好行走江湖。", selection={ {"初入门派",4}} } ,
	[4] = { task={4,1,1},selection = {"",0} },
}

剧情表[100111] = 
{
	npcimg = "spr/头像/45.spr",

	[1] = { info = "那铁头人怎么还没有把万年冰蚕给我抓来...", selection={ {"弟子拜见师姐",2}} } ,
   [2] = { cg = 52 , selection = {{"",3}} },
	[3] = { info = "依你功力，要对付那蛇也不太容易，我便好人做到家，传你一招星宿派武功，你且看好了！", selection={ {"多谢师姐指点",4}} } ,
	[4] = { info = "这还有把武器，也一起给你吧。", selection={ {"多谢师姐赏赐",5},{"歇息片刻",0}} } ,
   [5] = { task={4,2},selection = {"",0} },
}


剧情表[100112] = 
{
	npcimg = "spr/头像/45.spr",

	[1] = { info = "把我刚才给你的武器拿在手上给我看看，我倒要瞧瞧俊还是不俊。", selection={ {"是，师姐",2},{"歇息片刻",0} } } ,
   [2] = { task={4,3},selection = {"",0} },
}

剧情表[100113] = 
{
	npcimg = "spr/头像/45.spr",

	[1] = { info = "快把武器装备上让我看看！", selection={ {"是",0} } } ,
}

剧情表[100114] = 
{
	npcimg = "spr/头像/45.spr",

	[1] = { info = "哟呵！看不出来你拿上武器还挺耐看啊！快去弄蛇毒吧！", selection={ {"是，师姐",2},{"歇息片刻",0} } } ,
   [2] = { task={4,4},selection = {"",0} },
}


剧情表[100115] = 
{
	npcimg = "spr/头像/45.spr",

	[1] = { info = "快去弄蛇毒吧！", selection={ {"是",0} } } ,
}


剧情表[100116] = 
{
	npcimg = "spr/头像/45.spr",

	[1] = { info = "这么快就回来了！蛇毒呢？在哪？", selection={ {"在此",2} } } ,
	[2] = { info = "恩……好了！我已将信上之毒消去，你去找师父吧。", selection={ {"有劳师姐",3}, {"歇息片刻",0}} } ,
   [3] = { task={4,5},selection = {"",0} },
}


剧情表[100117] = 
{
	npcimg = "spr/头像/44.spr",

   [1] = { cg = 54 , selection = {{"",2}} },
   [2] = { task={4,6},selection = {"",0} },
}

剧情表[100118] = 
{
	npcimg = "spr/头像/出尘子.spr",

	[1] = { info = "你就是那个新来的？", selection={ {"正是。师兄，师父让你召集众人前来议事",2}} } ,
	[2] = { info = "嗯。我知道了。你且去回禀师父吧。", selection={ {"是，师兄",3}, {"歇息片刻",0}} } ,
	[3] = { task={4,7},selection = {"",0} },
}

剧情表[100119] = 
{
	npcimg = "spr/头像/44.spr",

	[1] = { info = "嗯……刚才说的不错。", selection={ {"谢师父夸奖",2}} } ,
	[2] = { info = "老夫见阿紫临走时和你说话，都说了些什么啊？", selection={ {"回师父，师姐叫我去找她",3}} } ,
	[3] = { info = "哦？那你快去吧。", selection={ {"是",4}, {"歇息片刻",0}} } ,
	[4] = { task={4,8},selection = {"",0} },
}

剧情表[100120] = 
{
	npcimg = "spr/头像/45.spr",

	[1] = { info = "我给你说哦，我现在要你去找铁面人，他就在星宿海那面。", selection={ {"不知师姐找他所为何事",2} } } ,
	[2] = { info = "哎呀，问这么多做什么！你去了就问他，说我要他办的事怎么样了。", selection={ {"是，明白了",3}}},
	[3] = { info = "记住我刚才传你的二式武功，或许必要的时候能派上用场。", selection={ {"多谢师姐",4}, {"歇息片刻",0}} } ,
   [4] = { task={4,9},selection = {"",0} },
}

剧情表[100121] = 
{
	npcimg = "spr/头像/46.spr",

	[1] = { info = "你不是那个新来的嘛！没看我正忙着呢，闪边去！", selection={ {"师兄，是阿紫师姐叫我来的",2} } } ,
  	[2] = { info = "啊？阿紫姑娘！她是不是原谅我了？你倒是快说啊！", selection={ {"师姐让我询问师兄，她要师兄做的事进展如何",3} } } ,
  	[3] = { info = "啊！阿紫姑娘果然是因为这个生我气了。这怎么是好？怎么是好？", selection={ {"师兄何故如此",4}}} ,
	[4] = { info = "哎呀……你不知道，阿紫姑娘让我抓冰蚕，需要把神木王鼎注满蜈蚣毒。" ,selection={ {"以师兄功力，此乃小事。",5}}} ,
	[5] = { info = "可我走不开啊！我还要寻找这冰蚕出没之地！" ,selection={ {"师兄不必烦恼，这蜈蚣毒就由我去收集吧。",6}}} ,
	[6] = { info = "对！你功夫虽然不怎么样，但杀蜈蚣绰绰有余。这是神木王鼎，你快去将其注满！" ,selection={ {"是，师兄",7},{"歇息片刻",0}} } ,
   [7] = { task={4,10},selection = {"",0} },
}

剧情表[100122] = 
{
	npcimg = "spr/头像/46.spr",

	[1] = { info = "你怎么还在这里！要是耽误了阿紫姑娘的事，我一掌打死你，快用这神木王鼎盛满蜈蚣毒液去！", selection={ {"我这就前去",0} } } ,
}

剧情表[100123] = 
{
	npcimg = "spr/头像/46.spr",

	[1] = { info = "啊！你回来了，王鼎注满了吗？", selection={ {"师兄请看",2} } } ,
  	[2] = { info = "谢谢！谢谢！我……我给你磕头！", selection={ {"师兄快请起，不必如此",3} } } ,
   [3] = { info = "对了！传闻天狼子知道冰蚕下落！", selection={ {"师兄为何不去找他询问",4} } } ,
   [4] = { info = "我问了，他不说啊！你这么聪明，要不你去问下？", selection={ {"是，我这就前去",5},{"歇息片刻",0 } }} ,
   [5] = { task={4,11},selection = {"",0} },
}

剧情表[100124] = 
{
	npcimg = "spr/头像/47.spr",

	[1] = { info = "你是那个新入门的！找我何事？", selection={ {"正是。此番前来，是想向师兄询问那冰蚕下落",2} } } ,
	[2] = { info = "哼！宝贝谁不想要，有道是能者居之！我不会说的！有本事，你自己去找吧！", selection={ {"打扰了（不如去采花子那儿弄点迷药）",3},{"歇息片刻",0 } }} ,
   [3] = { task={4,12},selection = {"",0} },
}

剧情表[100125] = 
{
	npcimg = "spr/头像/48.spr",

	[1] = { info = "唉？这不是新来的嘛！找我何事？", selection={ {"闻师兄善使迷药，特来讨要些许",2} } } ,
	[2] = { info = "哦？嘿嘿，我是善用此物不假，但凭什么就要给你？", selection={ {"那依师兄之意……",3} } } ,
	[3] = { info = "此药配制不易，我给了你，我用什么。若是想要，可以！去给我寻个良家来让我爽爽先！", selection={ {"此事不难，我这就前去",4},{"歇息片刻",0 } }} ,
   [4] = { task={4,13},selection = {"",0} },
}

剧情表[100126] = 
{
	npcimg = "spr/头像/48.spr",

	[1] = { info = "怎么还站在此！我要你寻的良家呢！", selection={ {"我这就前去",0} } } ,
}

剧情表[100127] = 
{
	npcimg = "spr/头像/48.spr",

	[1] = { info = "你怎么回来了！我要的良家呢！", selection={ {"师兄，如此行事我有愧于心",2} } } ,
	[2] = { info = "哟呵！良心发现啊！咋？你还指望能说服我？", selection={ {"师兄若能给我最好，不然……",3} } } ,
	[3] = { info = "不然怎么？", selection={ {"不然就只能用强了",4} } } ,
	[4] = { info = "哈哈哈哈……你一个新来的，我难道还怕你不成！", selection={ {"如此，得罪了（进入战斗）",5},{"歇息片刻",0 } }} ,
   [5] = { task={4,14},selection = {"",0} },
}


剧情表[100128] = 
{
	npcimg = "spr/头像/48.spr",

	[1] = { info = "哈哈哈哈……你一个新来的，我难道还怕你不成！",  selection={ {"如此，得罪了（进入战斗）",2},{"歇息片刻",0 } }} ,
	[2] = { onClick="OnClickTask50004",selection = {"",0} },
}


剧情表[100129] = 
{
	npcimg = "spr/头像/47.spr",

	[1] = { info = "晃来晃去！你究竟想怎么样！不是说了嘛！要冰蚕，自己找去！", selection={ {"莫非迷药是假的，回去找游坦之问问",2},{"歇息片刻",0 } }} ,
   [2] = { task={4,15},selection = {"",0} },
}

剧情表[100130] = 
{
	npcimg = "spr/头像/48.spr",

	[1] = { info = "一时大意，竟被你打败了...", selection={ {"多有得罪，这迷药我就拿走了",2} } } ,
	[2] = { info = "拿吧、拿吧，反正你拿去了也没用，嘿嘿...", selection={ {"该去找天狼子了",3},{"歇息片刻",0 } }} ,
   [3] = { task={4,23},selection = {"",0} },
}


剧情表[100131] = 
{
	npcimg = "spr/头像/46.spr",

	[1] = { info = "是否问到了冰蚕的出没地点？快，快告诉我。阿紫姑娘都等急了！", selection={ {"还没有问出来",2}} },
	[2] = { info = "哦...", selection={ {"但...",3},{"歇息片刻",0 } }} ,
   [3] = { cg = 58 , selection = {{"",4}} },
   [4] = { task={4,16},selection = {"",0} },
}


剧情表[100132] = 
{
	npcimg = "spr/头像/46.spr",

	[1] = { info = "如此我身后的高台于你来说就不成什么问题了，去把迷迭香采来给我吧！", selection={ {"是，我这就前去",2},{"歇息片刻",0 } }} ,
   [2] = { task={4,17},selection = {"",0} },
}

剧情表[100133] = 
{
	npcimg = "spr/头像/46.spr",

	[1] = { info = "迷迭香就在我身后的高台之上，你去采来给我吧！", selection={ {"是，我这就前去",2},{"歇息片刻",0 } }} ,
	[2] = { onClick="OnClickTask50013",selection = {"",0} }, 
}

剧情表[100134] = 
{
	npcimg = "spr/头像/46.spr",

	[1] = { info = "嗯……药已经配好了，你拿着去到天狼子那儿试试吧，定要问出万年冰蚕的下落来！", selection={ {"多谢师兄",2} } } ,
	[2] = { info = "别废话了，阿紫姑娘一定等急了，你速去速回！", selection={ {"是，师兄",3},{"歇息片刻",0 } }} ,
   [3] = { task={4,18},selection = {"",0} },
}

剧情表[100135] = 
{
	npcimg = "spr/头像/46.spr",

	[1] = { info = "你磨磨蹭蹭的做什么！还不快去天狼子那儿逼问万年冰蚕的下落！", selection={ {"是",0} } } ,  
}

剧情表[100136] = 
{
	npcimg = "spr/头像/47.spr",

	[1] = { info = "哼！还不快滚！", selection={ {"该去问问游坦之下一步如何走了",2},{"歇息片刻",0}} } ,
   [2] = { task={4,19},selection = {"",0} },
}

剧情表[100137] = 
{
	npcimg = "spr/头像/44.spr",

	[1] = { info = "你又来干什么，找死啊。", selection={ {"快跑",0} } } ,  
}

剧情表[100138] = 
{
	npcimg = "spr/头像/46.spr",

	[1] = { info = "如何！可是问得了冰蚕下落！", selection={ {"幸不辱命，冰蚕就在星宿海深处",2} } } ,  
	[1] = { info = "听你如此说，或许就在那灵波塔的“酉”字格上，你拿着神木王鼎去吸引这只冰蚕出来，捉住它。", selection={ {"好的",2} } } ,  
	[2] = { info = "神木王鼎吸引冰蚕要些时间，你先拿去安放，我随后就到！", selection={ {"是。唉？师兄你这是什么姿势",3} } } ,  
	[3] = { info = "不关你的事！你快去安放王鼎，我马上就来，在此之前别轻举妄动，好好善用我刚才传你的护体神功！", selection={ {"是",4},{"歇息片刻",0}} } , 
   [4] = { task={4,20},selection = {"",0} },
}

剧情表[100139] = 
{
	npcimg = "spr/头像/45.spr",

	[1] = { info = "师姐果然没有看错你！天狼子这小子怎是你的对手", selection={ {"师姐谬赞了",2} } } ,  
	[2] = { info = "对了，刚才师父和你说什么了？", selection={ {"回师姐，师父让我去见他",3} } } ,  
	[3] = { info = "哦？那你快去吧！", selection={ {"是",4},{"歇息片刻",0}} } ,
   [4] = { task={4,21},selection = {"",0} },
}

剧情表[100140] = 
{
	npcimg = "spr/头像/46.spr",

	[1] = { info = "快去安放王鼎啊！我随后就到！", selection={ {"是",0} } } ,   

}

剧情表[100141] = 
{
	npcimg = "spr/头像/45.spr",

	[1] = { info = "还没找到冰蚕，你怎么有脸回来见我！", selection={ {"离开",0} } } ,  
}

剧情表[100142] = 
{
	npcimg = "spr/头像/44.spr",

	[1] = { info = "既是要去华山，怎能没有好马。老夫赠你一匹，你且去找摘星子，随他共去。", selection={ {"谢师父赏赐",2},{"歇息片刻",0}} } ,
   [2] = { task={4,22},selection = {"",0} },
}

剧情表[100143] = 
{
	npcimg = "spr/头像/摘星子.spr",

	[1] = { info = "若是准备好了，我们就上路吧，早些到也好早点儿收拾那些家伙。不过看这光景怕是先得在京城打个尖才行！", selection={ {"继续",2} } } ,  
	[2] = { info = "动身先前往门派驿站，让其带我们去京城吧。", selection={ {"准备出发",3},{"歇息片刻",0}} } ,
   [3] = { task={4,24},selection = {"",0} },
}





-------------------------------------------------
-------------------------------------------------圣火

剧情表[60003] = 
{
	npcimg = "spr/头像/圣火弟子.spr",

	[1] = { info = "焚我残躯，熊熊圣火。生亦何欢，死亦何苦？为善除恶，唯光明故。喜乐悲愁，皆归尘土。怜我世人，忧患实多！", selection={ {"继续",2} } } ,
	[2] = { info = "此诗慷慨豪迈，尤显侠者胸襟，江湖传言圣火教无恶不作，想必定是那些所谓名门正派故意污蔑。", selection={ {"继续",3}} } ,
	[3] = { info = "承蒙青翼蝠王韦一笑青眼有加，得以入圣火教，此生何幸。今后应当勤练武功，扬我圣教神威，将那帮自称正人君子之人的画皮一一剥下，还我教之清名。", selection={ {"继续",4}} } ,
	[4] = { info = "眼下当务之急，还是前往大殿找韦一笑韦蝠王罢。", selection={ {"前往门派",5}} } ,
	[5] = { task={3,1,1},selection = {"",0} },
}

剧情表[100146] = 
{
	npcimg = "spr/头像/27.spr",
   [1] = { info = "我因修炼至阴至寒的寒冰绵掌时出了差错，经脉中郁积了至寒阴毒" ,selection={ {"继续",2}} } ,
	[2] = { info = "所以只要一用内力，寒毒就会发作，如若不吸热血解毒，全身血脉就会凝结成冰。你快去给我找些血来。" ,selection={ {"在下身上便有热血，蝠王请用。",3}} } ,
	[3] = { info = "你的那点份量不够，若是吸的过量，你就没命了。此地往北百余里有一岛屿，唤做冰火岛" ,selection={ {"继续",4}} } ,
	[4] = { info = "岛中有许多吸血蝙蝠，你便去取些蝙蝠血回来，便能解我寒毒。" ,selection={ {"在下这就前去",5}} } ,
	[5] = { info = "且慢。你先寻那右使范遥，修习我圣火武功，方才敌得过那蝙蝠。但需谨记，切不可说出我等在此私斗之事。" ,selection={ {"继续",6}} } ,
	[6] = { info = "习得武功之后，到东南方乘铜底船前往冰火岛，事情办妥了便速速回来。" ,selection={ {"谨遵蝠王之命",7},{"歇息片刻",0 } }} ,
	[7] = { task={3,2},selection = {"",0} },
}

剧情表[100147] = 
{
	npcimg = "spr/头像/29.spr",
   [1] = { info = "我乃光明右使范遥！你是……" ,selection={ {"拜见范右使！弟子新近入教",2}} } ,
	[2] = { info = "哦……找我何事？" ,selection={ {"蝠王命我前来修习圣火绝学",3}} } ,
	[3] = { info = "哦？既是蝠王之命，那可就耽误不得了。你且看好了，这是我圣火的入门刀法。" ,selection={ {"请范右使指点",4},{"歇息片刻",0 } }} ,
	[4] = { task={3,3},selection = {"",0} },
}

剧情表[100148] = 
{
	npcimg = "spr/头像/29.spr",
   [1] = { info = "一身的好武艺，怎可没把趁手的兵器，也不知道刚给你的那把刀是否趁你的手，拿在手上让我瞧瞧吧。" ,selection={ {"弟子遵命",2},{"歇息片刻",0 } }} ,
	[2] = { task={3,4},selection = {"",0} },
}

剧情表[100149] = 
{
	npcimg = "spr/头像/29.spr",

	[1] = { info = "仔细看着，我可不会给你演示第二遍！",  selection={ {"弟子明白",0}} } ,
}

剧情表[100150] = 
{
	npcimg = "spr/头像/29.spr",
   [1] = { info = "果然英姿飒爽，一看便是特立独行之辈。好，你且速去那冰火岛吧，莫要让蝠王久等。" ,selection={ {"啊、右使如何得知我要去那冰火岛",2}} } ,
   [2] = { info = "哼！他们三人打得鸡飞狗跳，难道我聋了不成！只是这不关我事，我也不愿管。你速去将蝠王的事情办妥吧，怕他等那鲜血等不及了。" ,selection={ {"弟子遵命",3},{"歇息片刻",0 } }} ,
	[3] = { task={3,5},selection = {"",0} },
}

剧情表[100151] = 
{
	npcimg = "spr/头像/29.spr",

	[1] = { info = "还在磨蹭什么，快把刚才给你的那把刀装备上给我瞧瞧",  selection={ {"弟子明白",0}} } ,
}

剧情表[100152] = 
{
	npcimg = "spr/头像/27.spr",
   [1] = { info = "总算回来啦……可有取来热血？" ,selection={ {"幸不辱命",2}} } ,
   [2] = { info = "速速呈上来！" ,selection={ {"遵命",3}} } ,
	[3] = { info = "我观鹰王已将寒气逼出，但似乎伤至筋脉，已自闭五感，一心调息。",  selection={ {"继续",4}} } ,
	[4] = { info = "你且去寻那左使杨逍，取来紫悬草，以供鹰王疗伤之用。算算时辰，回来之时，他也调息的差不多了。",  selection={ {"弟子遵命",5},{"歇息片刻",0 } }} ,
	[5] = { task={3,6},selection = {"",0} },
}

剧情表[100153] = 
{
	npcimg = "spr/头像/29.spr",

	[1] = { info = "快去将蝠王交托给你的事情办妥吧，只怕他再吸不上鲜血寒毒就要发作了。",  selection={ {"弟子明白",0}} } ,
}

剧情表[100154] = 
{
	npcimg = "spr/头像/27.spr",

	[1] = { info = "若是再不取来鲜血，老夫可就抵不住这寒毒的发作了，越来越冷了...",  selection={ {"弟子明白",0}} } ,
}

剧情表[100155] = 
{
	npcimg = "spr/头像/28.spr",
   [1] = { cg = 64 , selection = {{"",2}} },
	[2] = { task={3,7},selection = {"",0} },
}

剧情表[100156] = 
{
	npcimg = "spr/头像/28.spr",
   [1] = { info = "既已学会轻功，就速去后山山岩将那紫悬草采来交给鹰王去吧" ,selection={ {"弟子遵命",2},{"歇息片刻",0 } }} ,
	[2] = { task={3,8},selection = {"",0} },
}

剧情表[100157] = 
{
	npcimg = "spr/头像/26.spr",
   [1] = { info = "这是……紫悬草！是蝠王命你取回的吧！" ,selection={ {"回禀鹰王，正是",2}} } ,
   [2] = { info = "事才我一心调息疗伤，并未念及此物。此物对我伤势大有裨益，嗯……算这蝙蝠有心。" ,selection={ {"继续",3}} } ,
   [3] = { info = "龙王虽是我四大护法之首，但功力却略有不如。时下还未结束调息，实在令我心忧。" ,selection={ {"继续",4}} } ,
   [4] = { info = "你且问问，指不定能帮上些许，老夫还需调息片刻。" ,selection={ {"弟子遵命",5},{"歇息片刻",0 } }} ,
	[5] = { task={3,9},selection = {"",0} },
}

剧情表[100158] = 
{
	npcimg = "spr/头像/28.spr",

	[1] = { info = "鹰王的伤倒着实令人有些担忧了，唔...将紫悬草采来给他带去吧。",  selection={ {"弟子明白",2},{"歇息片刻",0 } }} ,
	[2] = { onClick="OnClickTask50015",selection = {"",0} },
}

剧情表[100159] = 
{
	npcimg = "spr/头像/26.spr",

	[1] = { info = "咳...咳，让老夫静心调息，外人不要来打扰我！",  selection={ {"弟子明白",0}} } ,
}

剧情表[100160] = 
{
	npcimg = "spr/头像/25.spr",
   [1] = { info = "你与鹰王所说，我皆听见，眼下确有一事。" ,selection={ {"龙王请讲",2}} } ,
   [2] = { info = "此殿之后，有一女子，名为小昭。你且前去，向她讨要回生丸带回即可。" ,selection={ {"可需信物？",3}} } ,
   [3] = { info = "你对其说金花银叶，她自会知晓。" ,selection={ {"弟子遵命",4},{"歇息片刻",0 } }} ,
	[4] = { task={3,10},selection = {"",0} },
}

剧情表[100161] = 
{
	npcimg = "spr/头像/31.spr",
   [1] = { info = "来者何人，找我有什么事吗？" ,selection={ {"在下新近入门，龙王差我前来取那回生丸",2}} } ,
   [2] = { info = "嗯……可有信物？" ,selection={ {"金花银叶",3}} } ,
   [3] = { info = "蝠王虽能击伤两位，但也不会轻易得手。" ,selection={ {"正是、三位护法皆受重伤",4}} } ,
   [4] = { info = "我明教四大护法，现在其三重伤，又适逢公子闭关。" ,selection={ {"继续",5}} } ,
   [5] = { info = "不行，你且去那冰火岛北面，寻金毛狮王回来主持大局！至于这回生丸，我自会送去。" ,selection={ {"在下明白",6},{"歇息片刻",0 } }} ,
	[6] = { task={3,11},selection = {"",0} },
}

剧情表[100162] = 
{
	npcimg = "spr/头像/30.spr",
   [1] = { info = "我乃散人说不得！施主为何来此？" ,selection={ {"晚辈新近入教。此番前来是请狮王回教中主持大局",2}} } ,
   [2] = { info = "呵呵，这是为何？其他门派攻上来了？" ,selection={ {"并非如此。早前三位护法在教中比斗，结果均受重伤",3}} } ,
   [3] = { info = "哈哈，那三人，见面不过寥寥数语定会相斗一番。幸的狮王未在，不然此刻受伤的，定会再加一人！哈哈哈哈……" ,selection={ {"敢问大师，可知狮王谢护法的下落",4}} } ,
   [4] = { info = "近来狮王修习七伤拳，此拳未伤人先伤己。事才我已查探过，狮王在那冰火岛的深处已然昏迷多时，不曾醒转。" ,selection={ {"那这如何是好",5}} } ,
   [5] = { info = "呵呵，若要使其清醒，不难，只需三物。" ,selection={ {"敢问是哪三物",6}} } ,
   [6] = { info = "其一，五彩蛛丝，用于束缚，以防其醒后狂性大发，此举有备无患；其二，雪狼王心，用于护其心脉，使之清醒后不至血脉逆转。" ,selection={ {"继续",7}} } ,
   [7] = { info = "而使其清醒，则需万年玄冰。" ,selection={ {"这些物品从何而来",8}} } ,
   [8] = { info = "五彩毒蛛丝自是取自五彩毒蛛，你就先去取来此物吧，我会在前方等着你。" ,selection={ {"晚辈这就前去",9},{"歇息片刻",0 } }} ,
	[9] = { task={3,12},selection = {"",0} },
}

剧情表[100163] = 
{
	npcimg = "spr/头像/30.spr",
   [1] = { info = "想不到你来得倒是挺快，和尚我差点还没赶到你前头。" ,selection={ {"一路果然危机重重",2}} } ,
   [2] = { info = "那是那是，要不这冰火岛岂能成为狮王藏身之所。眼下五彩毒蛛丝已到手，下一个就该去取那雪狼王心了。" ,selection={ {"不知该如何取得",3}} } ,
   [3] = { info = "雪狼王行踪隐秘，不易找寻，只是这东西最是护短，杀其子孙，狼王自会出现。" ,selection={ {"在下明白",4},{"歇息片刻",0 } }} ,
	[4] = { task={3,13},selection = {"",0} },
}

剧情表[100164] = 
{
	npcimg = "spr/头像/30.spr",
   [1] = { info = "你可有找到？" ,selection={ {"大师请看",2}} } ,
   [2] = { cg = 65 , selection = {{"",3}} },
   [3] = { info = "哈哈，一时不查，被狮王伤了。" ,selection={ {"散人伤势如何",4}} } ,
   [4] = { info = "怕是动不得了。狮王如此模样，是那百年玄冰功效不足所致。现在需将其击晕，醒来后方可无碍，此事只有靠施主了。" ,selection={ {"继续",5}} } ,
	[5] = { info = "眼下我虽无法动弹，但可传授施主护体神功，施主且用心记住。",  selection={ {"这……晚辈自当尽力",6},{"歇息片刻",0 } }} ,
	[6] = { task={3,14},selection = {"",0} },
}

剧情表[100165] = 
{
	npcimg = "spr/头像/30.spr",

	[1] = { info = "雪狼王心出自雪狼王（先得击杀雪狼，引出雪狼王）",  selection={ {"弟子明白",0}} } ,
}

剧情表[100166] = 
{
	npcimg = "spr/头像/30.spr",

	[1] = { info = "雪狼王心出自雪狼王（先得击杀雪狼，引出雪狼王）",  selection={ {"弟子明白",0}} } ,
}

剧情表[100167] = 
{
	npcimg = "spr/头像/30.spr",
   [1] = { info = "你此刻身具圣火秘传内劲，又得我亲授护体神功，料想也可与狮王分庭抗礼了，你这就立马将他击晕，以便我们行事。" ,selection={ {"在下明白",2},{"歇息片刻",0 } }} ,
	[2] = { task={3,15},selection = {"",0} },
}

剧情表[100168] = 
{
	npcimg = "spr/头像/30.spr",
   [1] = { info = "狮王心意已决，看来定是要去那华山了。施主还是速回教中，将此事告知吧。" ,selection={ {"大师所言极是",2},{"歇息片刻",0 } }} ,
	[2] = { task={3,16},selection = {"",0} },
}

剧情表[100169] = 
{
	npcimg = "spr/头像/30.spr",

	[1] = { info = "你这就立马将狮王谢逊击晕，以便我们行事。",  selection={ {"在下明白",2},{"歇息片刻",0 } }} ,
	[2] = { onClick="OnClickTask50003",selection = {"",0} },
}

剧情表[100170] = 
{
	npcimg = "spr/头像/27.spr",
   [1] = { info = "我们三人皆知金毛为人，如若他行那鲁莽之事，你只需提醒，切不可阻拦。" ,selection={ {"弟子明白",2}} } ,
   [2] = { info = "我赠你快马一匹，也好助你上路。在京城那儿可稍作歇息，自会有武林盟的人前去接引你们，不过万事小心。" ,selection={ {"继续",3}} } ,
   [3] = { info = "动身先前往门派驿站，让其带你去京城吧。" ,selection={ {"多谢护法",4},{"歇息片刻",0 } }} ,
	[4] = { task={3,18},selection = {"",0} },
}

剧情表[100171] = 
{
	npcimg = "spr/头像/30.spr",
   [1] = { info = "五彩毒蛛丝自是产自五彩毒蛛了。" ,selection={ {"弟子明白",0}} } ,
}

剧情表[100172] = 
{
	npcimg = "spr/头像/30.spr",
   [1] = { info = "五彩毒蛛丝自是产自五彩毒蛛了。" ,selection={ {"弟子明白",0}} } ,
}

剧情表[100173] = 
{
	npcimg = "spr/头像/30.spr",
   [1] = { info = "雪狼王心！这稀罕之物我只从来听过，还不曾见得，真是万幸万幸啊！" ,selection={ {"下一步该如何了",2}} } ,
   [2] = { info = "如今惟独差那万年玄冰了，此物深藏于岛内，极是不易找寻，你得仔细找找。" ,selection={ {"在下明白",3},{"歇息片刻",0 } }} ,
	[3] = { task={3,17},selection = {"",0} },
}

剧情表[100174] = 
{
	npcimg = "spr/头像/30.spr",
   [1] = { info = "万年玄冰万年凝结，可不是那么容易找到的。" ,selection={ {"弟子明白",0}} } ,
}

剧情表[100175] = 
{
	npcimg = "spr/头像/30.spr",
   [1] = { info = "万年玄冰万年凝结，可不是那么容易找到的。" ,selection={ {"弟子明白",0}} } ,
}


-----------------------
-------------------------少林之武林盟接引至华山

剧情表[100180] = 
{
	npcimg = "spr/头像/武林盟使者.spr",
   [1] = { info = "诸位一路辛苦，请在此歇息片刻，待养足精神之后再上路也不迟。" ,selection={ {"如此也好",2}} } ,
   [2] = { info = "此处与华山相隔不远，明早启程晌午即可到达。山脚处自有我武林盟的接引使者，到时诸位英雄豪杰可随其上山。" ,selection={ {"恭敬不如从命",3},{"歇息片刻",0 } }} ,
	[3] = { task={1,22},selection = {"",0} },
}

剧情表[100181] = 
{
	npcimg = "spr/头像/武林盟使者.spr",
   [1] = { cg = 1001 , selection = {{"",2}} },
   [2] = { info = "规矩既已定下，诸位就请比试一番吧，最终胜出的人武林盟自当为其放行。" ,selection={ {"如此也好",3},{"歇息片刻",0 } }} ,
	[3] = { task={1,23},selection = {"",0} },
}

剧情表[100194] = 
{
	npcimg = "spr/头像/峨眉派弟子.spr",
   [1] = { info = "我峨眉派门人，虽都是女流之辈，然武艺却从不输男子，你可自己小心了。" ,selection={ {"进入战斗",2},{"歇息片刻",0 } }} ,
	[2] = { task={1,26},selection = {"",0} },
}
-----------------------
-------------------------峨眉之武林盟接引至华山

剧情表[100182] = 
{
	npcimg = "spr/头像/武林盟使者.spr",
   [1] = { info = "诸位一路辛苦，请在此歇息片刻，待养足精神之后再上路也不迟。" ,selection={ {"如此也好",2}} } ,
   [2] = { info = "此处与华山相隔不远，明早启程晌午即可到达。山脚处自有我武林盟的接引使者，到时诸位英雄豪杰可随其上山。" ,selection={ {"恭敬不如从命",3},{"歇息片刻",0 } }} ,
	[3] = { task={2,20},selection = {"",0} },
}

剧情表[100183] = 
{
	npcimg = "spr/头像/武林盟使者.spr",
   [1] = { cg = 1001 , selection = {{"",2}} },
   [2] = { info = "规矩既已定下，诸位就请比试一番吧，最终胜出的人武林盟自当为其放行。" ,selection={ {"如此也好",3},{"歇息片刻",0 } }} ,
	[3] = { task={2,21},selection = {"",0} },
}

剧情表[100193] = 
{
	npcimg = "spr/头像/少林派弟子.spr",
   [1] = { info = "阿弥陀佛，非我想与阁下争个高下，咱们点到即止，权作比武切磋好了。" ,selection={ {"进入战斗",2},{"歇息片刻",0 } }} ,
	[2] = { task={2,24},selection = {"",0} },
}
-----------------------
-------------------------圣火之武林盟接引至华山

剧情表[100184] = 
{
	npcimg = "spr/头像/武林盟使者.spr",
   [1] = { info = "诸位一路辛苦，请在此歇息片刻，待养足精神之后再上路也不迟。" ,selection={ {"如此也好",2}} } ,
   [2] = { info = "此处与华山相隔不远，明早启程晌午即可到达。山脚处自有我武林盟的接引使者，到时诸位英雄豪杰可随其上山。" ,selection={ {"恭敬不如从命",3},{"歇息片刻",0 } }} ,
	[3] = { task={3,19},selection = {"",0} },
}

剧情表[100185] = 
{
	npcimg = "spr/头像/武林盟使者.spr",
   [1] = { cg = 1001 , selection = {{"",2}} },
   [2] = { info = "规矩既已定下，诸位就请比试一番吧，最终胜出的人武林盟自当为其放行。" ,selection={ {"如此也好",3},{"歇息片刻",0 } }} ,
	[3] = { task={3,20},selection = {"",0} },
}

剧情表[100192] = 
{
	npcimg = "spr/头像/少林派弟子.spr",
   [1] = { info = "阿弥陀佛，非我想与阁下争个高下，咱们点到即止，权作比武切磋好了。" ,selection={ {"进入战斗",2},{"歇息片刻",0 } }} ,
	[2] = { task={3,23},selection = {"",0} },
}
-----------------------
-------------------------星宿之武林盟接引至华山

剧情表[100186] = 
{
	npcimg = "spr/头像/武林盟使者.spr",
   [1] = { info = "诸位一路辛苦，请在此歇息片刻，待养足精神之后再上路也不迟。" ,selection={ {"如此也好",2}} } ,
   [2] = { info = "此处与华山相隔不远，明早启程晌午即可到达。山脚处自有我武林盟的接引使者，到时诸位英雄豪杰可随其上山。" ,selection={ {"恭敬不如从命",3},{"歇息片刻",0 } }} ,
	[3] = { task={4,25},selection = {"",0} },
}

剧情表[100187] = 
{
	npcimg = "spr/头像/武林盟使者.spr",
   [1] = { cg = 1001 , selection = {{"",2}} },
   [2] = { info = "规矩既已定下，诸位就请比试一番吧，最终胜出的人武林盟自当为其放行。" ,selection={ {"如此也好",3},{"歇息片刻",0 } }} ,
	[3] = { task={4,26},selection = {"",0} },
}

剧情表[100191] = 
{
	npcimg = "spr/头像/少林派弟子.spr",
   [1] = { info = "阿弥陀佛，非我想与阁下争个高下，咱们点到即止，权作比武切磋好了。" ,selection={ {"进入战斗",2},{"歇息片刻",0 } }} ,
	[2] = { task={4,29},selection = {"",0} },
}
-----------------------
-------------------------武当之武林盟接引至华山

剧情表[100188] = 
{
	npcimg = "spr/头像/武林盟使者.spr",
   [1] = { info = "诸位一路辛苦，请在此歇息片刻，待养足精神之后再上路也不迟。" ,selection={ {"如此也好",2}} } ,
   [2] = { info = "此处与华山相隔不远，明早启程晌午即可到达。山脚处自有我武林盟的接引使者，到时诸位英雄豪杰可随其上山。" ,selection={ {"恭敬不如从命",3},{"歇息片刻",0 } }} ,
	[3] = { task={5,18},selection = {"",0} },
}

剧情表[100189] = 
{
	npcimg = "spr/头像/武林盟使者.spr",
   [1] = { cg = 1001 , selection = {{"",2}} },
   [2] = { info = "规矩既已定下，诸位就请比试一番吧，最终胜出的人武林盟自当为其放行。" ,selection={ {"如此也好",3},{"歇息片刻",0 } }} ,
	[3] = { task={5,19},selection = {"",0} },
}

剧情表[100190] = 
{
	npcimg = "spr/头像/少林派弟子.spr",
   [1] = { info = "阿弥陀佛，非我想与阁下争个高下，咱们点到即止，权作比武切磋好了。" ,selection={ {"进入战斗",2},{"歇息片刻",0 } }} ,
	[2] = { task={5,22},selection = {"",0} },
}
--------------------------
-----------------------------华山END

---------少林驿站
剧情表[100196] = 
{
	npcimg = "spr/头像/驿站.spr",
   [1] = { info = "此间前往京城路途遥远，我就免费送你一程吧，日后若要来往各地点，记得再找我就是。" ,selection={ {"如此多谢",2},{"歇息片刻",0 } }} ,
	[2] = { task={1,25},selection = {"",0} },
}
---------峨眉驿站
剧情表[100197] = 
{
	npcimg = "spr/头像/驿站.spr",
   [1] = { info = "此间前往京城路途遥远，我就免费送你一程吧，日后若要来往各地点，记得再找我就是。" ,selection={ {"如此多谢",2},{"歇息片刻",0 } }} ,
	[2] = { task={2,23},selection = {"",0} },
}
---------圣火驿站
剧情表[100198] = 
{
	npcimg = "spr/头像/驿站.spr",
   [1] = { info = "此间前往京城路途遥远，我就免费送你一程吧，日后若要来往各地点，记得再找我就是。" ,selection={ {"如此多谢",2},{"歇息片刻",0 } }} ,
	[2] = { task={3,22},selection = {"",0} },
}
---------星宿驿站
剧情表[100199] = 
{
	npcimg = "spr/头像/驿站.spr",
   [1] = { info = "此间前往京城路途遥远，我就免费送你一程吧，日后若要来往各地点，记得再找我就是。" ,selection={ {"如此多谢",2},{"歇息片刻",0 } }} ,
	[2] = { task={4,28},selection = {"",0} },
}
---------武当驿站
剧情表[100200] = 
{
	npcimg = "spr/头像/驿站.spr",
   [1] = { info = "此间前往京城路途遥远，我就免费送你一程吧，日后若要来往各地点，记得再找我就是。" ,selection={ {"如此多谢",2},{"歇息片刻",0 } }} ,
	[2] = { task={5,21},selection = {"",0} },
}

-----------------少林之
-----------------交任务未完成剧情
剧情表[100202] = 
{
	npcimg = "spr/头像/武当派弟子.spr",
   [1] = { info = "武当派弟子一向鲜有参与武林争斗，但这华山论剑盛事十年才得见一回，不可错过。" ,selection={ {"好一副志在必得的样子",0}}} ,
}

剧情表[100205] = 
{
	npcimg = "spr/头像/圣火教弟子.spr",
   [1] = { info = "圣火教从未被江湖武林人士用正眼瞧上过，今日就是我教扬名立威的好时机。" ,selection={ {"好一副志在必得的样子",0}}} ,
}

剧情表[100208] = 
{
	npcimg = "spr/头像/星宿派弟子.spr",
   [1] = { info = "星宿老仙独步武林，武功天下无敌，咱们这些徒弟虽只得他人家的一点皮毛，对付你们这些蝼蚁之辈也绰绰有余了。" ,selection={ {"好一副志在必得的样子",0}}} ,
}

剧情表[100211] = 
{
	npcimg = "spr/头像/武林盟使者.spr",
   [1] = { info = "五大门派自相残食，这正是我武林盟想看到的结果，嘿嘿。" ,selection={ {"什么，你再说一遍",0}}} ,
}
-----------------少林之
-----------------接任务未完成剧情
剧情表[100195] = 
{
	npcimg = "spr/头像/峨眉派弟子.spr",
   [1] = { info = "我峨眉派门人，虽都是女流之辈，然武艺却从不输男子，你可自己小心了。" ,selection={ {"进入战斗",2},{"歇息片刻",0 } }} ,
	[2] = { onClick="OnClickTask50017",selection = {"",0} },
}

剧情表[100204] = 
{
	npcimg = "spr/头像/武当派弟子.spr",
   [1] = { info = "华山论剑之期十年才一至，武林中人谁不想一窥高手们的对决，在下也绝不会错过这个机会，由此得罪了。" ,selection={ {"进入战斗",2},{"歇息片刻",0 } }} ,
	[2] = { onClick="OnClickTask50018",selection = {"",0} },
}

剧情表[100207] = 
{
	npcimg = "spr/头像/圣火教弟子.spr",
   [1] = { info = "不想死的统统闪开，有我圣火门人在此，哪个还敢上来，若执意不听，休怪手下不留情面。" ,selection={ {"进入战斗",2},{"歇息片刻",0 } }} ,
	[2] = { onClick="OnClickTask50019",selection = {"",0} },
}

剧情表[100210] = 
{
	npcimg = "spr/头像/星宿派弟子.spr",
   [1] = { info = "中原的事星宿派早就想来插一手了，正好碰上这么一个机会，可不能就这么错过了，谁若拦在我们面前，定叫他尝尝厉害。" ,selection={ {"进入战斗",2},{"歇息片刻",0 } }} ,
	[2] = { onClick="OnClickTask50020",selection = {"",0} },
}
-----------------少林之
-----------------交接任务
剧情表[100201] = 
{
	npcimg = "spr/头像/武当派弟子.spr",
   [1] = { info = "华山论剑之期十年才一至，武林中人谁不想一窥高手们的对决，在下也绝不会错过这个机会，由此得罪了。" ,selection={ {"进入战斗",2},{"歇息片刻",0 } }} ,
	[2] = { task={1,27},selection = {"",0} },
}

剧情表[100203] = 
{
	npcimg = "spr/头像/圣火教弟子.spr",
   [1] = { info = "不想死的统统闪开，有我圣火门人在此，哪个还敢上来，若执意不听，休怪手下不留情面。" ,selection={ {"进入战斗",2},{"歇息片刻",0 } }} ,
	[2] = { task={1,28},selection = {"",0} },
}

剧情表[100206] = 
{
	npcimg = "spr/头像/星宿派弟子.spr",
   [1] = { info = "中原的事星宿派早就想来插一手了，正好碰上这么一个机会，可不能就这么错过了，谁若拦在我们面前，定叫他尝尝厉害。" ,selection={ {"进入战斗",2},{"歇息片刻",0 } }} ,
	[2] = { task={1,29},selection = {"",0} },
}

剧情表[100209] = 
{
	npcimg = "spr/头像/武林盟使者.spr",
   [1] = { info = "阁下既能到此，武学修为自是不凡，就请上山观摩华山论剑盛会吧。" ,selection={ {"如此多谢",2},{"歇息片刻",0 } }} ,
	[2] = { task={1,24},selection = {"",0} },
}


-----------------峨眉之
-----------------接任务未完成剧情
剧情表[100213] = 
{
	npcimg = "spr/头像/少林派弟子.spr",
   [1] = { info = "阿弥陀佛，非我想与阁下争个高下，咱们点到即止，权作比武切磋好了。" ,selection={ {"进入战斗",2},{"歇息片刻",0 } }} ,
	[2] = { onClick="OnClickTask50021",selection = {"",0} },
}
-----------------峨眉之
-----------------交接任务
剧情表[100212] = 
{
	npcimg = "spr/头像/武当派弟子.spr",
   [1] = { info = "华山论剑之期十年才一至，武林中人谁不想一窥高手们的对决，在下也绝不会错过这个机会，由此得罪了。" ,selection={ {"进入战斗",2},{"歇息片刻",0 } }} ,
	[2] = { task={2,25},selection = {"",0} },
}

剧情表[100215] = 
{
	npcimg = "spr/头像/圣火教弟子.spr",
   [1] = { info = "不想死的统统闪开，有我圣火门人在此，哪个还敢上来，若执意不听，休怪手下不留情面。" ,selection={ {"进入战斗",2},{"歇息片刻",0 } }} ,
	[2] = { task={2,26},selection = {"",0} },
}

剧情表[100216] = 
{
	npcimg = "spr/头像/星宿派弟子.spr",
   [1] = { info = "中原的事星宿派早就想来插一手了，正好碰上这么一个机会，可不能就这么错过了，谁若拦在我们面前，定叫他尝尝厉害。" ,selection={ {"进入战斗",2},{"歇息片刻",0 } }} ,
	[2] = { task={2,27},selection = {"",0} },
}

剧情表[100217] = 
{
	npcimg = "spr/头像/武林盟使者.spr",
   [1] = { info = "阁下既能到此，武学修为自是不凡，就请上山观摩华山论剑盛会吧。" ,selection={ {"如此多谢",2},{"歇息片刻",0 } }} ,
	[2] = { task={2,22},selection = {"",0} },
}

-----------------圣火之
-----------------交任务未完成剧情
剧情表[100219] = 
{
	npcimg = "spr/头像/峨眉派弟子.spr",
   [1] = { info = "峨嵋派此次前来华山论剑旨在夺取武林第一大派宝座，我劝你还是早早退却为好。" ,selection={ {"好一副志在必得的样子",0}}} ,
}

-----------------圣火之
-----------------接任务未完成剧情
剧情表[100233] = 
{
	npcimg = "spr/头像/武当派弟子.spr",
   [1] = { info = "华山论剑之期十年才一至，武林中人谁不想一窥高手们的对决，在下也绝不会错过这个机会，由此得罪了。" ,selection={ {"进入战斗",2},{"歇息片刻",0 } }} ,
	[2] = { onClick="OnClickTask50023",selection = {"",0} },
}
-----------------圣火之
-----------------交接任务
剧情表[100218] = 
{
	npcimg = "spr/头像/峨嵋派弟子.spr",
   [1] = { info = "我峨眉派门人，虽都是女流之辈，然武艺却从不输男子，你可自己小心了。" ,selection={ {"进入战斗",2},{"歇息片刻",0 } }} ,
	[2] = { task={3,24},selection = {"",0} },
}

剧情表[100220] = 
{
	npcimg = "spr/头像/武当派弟子.spr",
   [1] = { info = "华山论剑之期十年才一至，武林中人谁不想一窥高手们的对决，在下也绝不会错过这个机会，由此得罪了。" ,selection={ {"进入战斗",2},{"歇息片刻",0 } }} ,
	[2] = { task={3,25},selection = {"",0} },
}

剧情表[100221] = 
{
	npcimg = "spr/头像/星宿派弟子.spr",
   [1] = { info = "中原的事星宿派早就想来插一手了，正好碰上这么一个机会，可不能就这么错过了，谁若拦在我们面前，定叫他尝尝厉害。" ,selection={ {"进入战斗",2},{"歇息片刻",0 } }} ,
	[2] = { task={3,26},selection = {"",0} },
}

剧情表[100222] = 
{
	npcimg = "spr/头像/武林盟使者.spr",
   [1] = { info = "阁下既能到此，武学修为自是不凡，就请上山观摩华山论剑盛会吧。" ,selection={ {"如此多谢",2},{"歇息片刻",0 } }} ,
	[2] = { task={3,21},selection = {"",0} },
}

-----------------武当之
-----------------接任务未完成剧情
剧情表[100230] = 
{
	npcimg = "spr/头像/峨眉派弟子.spr",
   [1] = { info = "我峨眉派门人，虽都是女流之辈，然武艺却从不输男子，你可自己小心了。" ,selection={ {"进入战斗",2},{"歇息片刻",0 } }} ,
	[2] = { onClick="OnClickTask50022",selection = {"",0} },
}
-----------------武当之
-----------------交接任务
剧情表[100228] = 
{
	npcimg = "spr/头像/峨嵋派弟子.spr",
   [1] = { info = "我峨眉派门人，虽都是女流之辈，然武艺却从不输男子，你可自己小心了。" ,selection={ {"进入战斗",2},{"歇息片刻",0 } }} ,
	[2] = { task={5,23},selection = {"",0} },
}

剧情表[100229] = 
{
	npcimg = "spr/头像/圣火教弟子.spr",
   [1] = { info = "不想死的统统闪开，有我圣火门人在此，哪个还敢上来，若执意不听，休怪手下不留情面。" ,selection={ {"进入战斗",2},{"歇息片刻",0 } }} ,
	[2] = { task={5,24},selection = {"",0} },
}

剧情表[100231] = 
{
	npcimg = "spr/头像/星宿派弟子.spr",
   [1] = { info = "中原的事星宿派早就想来插一手了，正好碰上这么一个机会，可不能就这么错过了，谁若拦在我们面前，定叫他尝尝厉害。" ,selection={ {"进入战斗",2},{"歇息片刻",0 } }} ,
	[2] = { task={5,25},selection = {"",0} },
}

剧情表[100232] = 
{
	npcimg = "spr/头像/武林盟使者.spr",
   [1] = { info = "阁下既能到此，武学修为自是不凡，就请上山观摩华山论剑盛会吧。" ,selection={ {"如此多谢",2},{"歇息片刻",0 } }} ,
	[2] = { task={5,20},selection = {"",0} },
}

-----------------星宿之
-----------------接任务未完成剧情
剧情表[100227] = 
{
	npcimg = "spr/头像/圣火教弟子.spr",
   [1] = { info = "不想死的统统闪开，有我圣火门人在此，哪个还敢上来，若执意不听，休怪手下不留情面。" ,selection={ {"进入战斗",2},{"歇息片刻",0 } }} ,
	[2] = { onClick="OnClickTask50024",selection = {"",0} },
}
-----------------星宿之
-----------------交接任务
剧情表[100223] = 
{
	npcimg = "spr/头像/峨嵋派弟子.spr",
   [1] = { info = "我峨眉派门人，虽都是女流之辈，然武艺却从不输男子，你可自己小心了。" ,selection={ {"进入战斗",2},{"歇息片刻",0 } }} ,
	[2] = { task={4,30},selection = {"",0} },
}

剧情表[100224] = 
{
	npcimg = "spr/头像/武当派弟子.spr",
   [1] = { info = "华山论剑之期十年才一至，武林中人谁不想一窥高手们的对决，在下也绝不会错过这个机会，由此得罪了。" ,selection={ {"进入战斗",2},{"歇息片刻",0 } }} ,
	[2] = { task={4,31},selection = {"",0} },
}

剧情表[100225] = 
{
	npcimg = "spr/头像/圣火教弟子.spr",
   [1] = { info = "不想死的统统闪开，有我圣火门人在此，哪个还敢上来，若执意不听，休怪手下不留情面。" ,selection={ {"进入战斗",2},{"歇息片刻",0 } }} ,
	[2] = { task={4,32},selection = {"",0} },
}

剧情表[100226] = 
{
	npcimg = "spr/头像/武林盟使者.spr",
   [1] = { info = "阁下既能到此，武学修为自是不凡，就请上山观摩华山论剑盛会吧。" ,selection={ {"如此多谢",2},{"歇息片刻",0 } }} ,
	[2] = { task={4,27},selection = {"",0} },
}

