EquipAttIndexMap = {}
EquipAttIndexMap =
{
	[12] = 1,			-- 生命上限		-----
	[13] = 2,			-- 内力上限			|
	[53] = 3,			-- 外功基础			|
	[54] = 4,			-- 外功精通			|
	[55] = 5,			-- 内功基础			|
	[56] = 6,			-- 内功精通		-----
	[57] = 7,			-- 外防基础		-----
	[58] = 8,			-- 外防精通			|
	[59] = 9,			-- 内防基础			|
	[60] = 10,			-- 内防精通			|
	[9] = 11,			-- 杀气			-----
}

EquipAttNameMap = {}
EquipAttNameMap = 
{
	[1] = "生命上限",
	[2] = "内力上限",
	[3] = "外功基础",
	[4] = "外功精通",
	[5] = "内功基础",
	[6] = "内功精通",
	[7] = "外防基础",
	[8] = "外防精通",
	[9] = "内防基础",
	[10] = "内防精通",
	[11] = "杀　　气",
}

EquipQualifyMaterialMap = {}
EquipQualifyMaterialMap =
{
	[1] = {1, 2},
	[2] = {1, 2},
	[3] = {1, 2},
	[4] = {1, 2},
	[5] = {1, 2},
	[6] = {1, 2},
	[7] = {1, 2},
	[8] = {1, 2},
}

EquipQualifyMemoryMap = {}
EquipQualifyMemoryMap =
{
	[1] = {4029, 2},
	[2] = {4029, 2},
	[3] = {4029, 2},
	[4] = {4029, 2},
	[5] = {4029, 2},
	[6] = {4029, 2},
	[7] = {4029, 2},
	[8] = {4029, 2},
}