
------------------------------------------------------------------
--任务配置表
跑环任务配置表={
	最大环数 = 100, 	--最大完成环数
	刷新 = { everyday={17,12}, everyweek={{1,17,5}} }, -- everyday = {hour,min} | everday = hour, everyweek = { {weekway,hour, min}, {weekway, hour}}
	可接次数 = { day=5 },
}

跑环任务配置表[1] = {	
	等级范围 = {1,20},	--等级范围
	需要金钱 = 50, -- money== function() end returnn
	
	主任务库 = 1,
	
	接任务npcid = 2,
	
	额外奖励={
		final = {},		--完成所有环数
		[10] = {30, 2},		-- 完成n环的奖励
	},
	
	完成奖励 = {
		money = 100,	--money = function
		giveExp  = 200,		--exp = function
	},
	
	任务比例 = { 10, 60, 10, 20},	--各类任务的生成比例
} -- 固定奖励


----------------------------------------------------------
--任务库
跑环任务库 = {}
--	任务类型:  1: 找物品(), 2:找NPC, 3：杀怪, 4:属性
跑环任务库[1] = {
	--{任务类型,}
	{3, {"朽木人", 3}},		--配置同kill
	{1, {4000,2}, },	--配置同items
	{2, {2}},				-- {类型, {npcid列表}}
	{2, {5}},
	
	--[[
		--	属性列表 { 属性值 = {GetPlayerData索引, 名字，单位}}
		PropertyTable = { MaxHP = { 26, "生命上限", "点"},
						  MaxMP = { 41, "内力上限", "点"},
						  MaxSP = { 42, "真气上限", "点"},
						  OAttBase = { 43, "外功基础", "点" },
						  IAttBase = { 44, "内功基础", "点"},
						  ODefBase = { 45, "外防基础", "点"},
						  IDefBase = { 46, "内防基础", "点"},
						  AG = { 7, "身法", "点"},
						  Amuck = { 47, "杀气", "点"},
						}

	--]]
	{4, { MaxHP=80,}},			-- {类型, {属性名=属性值}}
	{4, {MaxSP = 2,}}
}

跑环任务库[2] = {
	
}

-------------------------------------------
--任务模版库
跑环任务模版表 = {}
跑环任务模版表[1] = 
{
	任务名称 = "111111",
	任务说明 = "1111111111111111111111111",
	
	pre任务名称 = "你猜",
	pre任务说明 = "你猜,哈哈",
	
	接任务剧情id = 100103,
	交任务剧情id = 100104,
	接任务未完成剧情id = 100105,
}

跑环任务模版表[2] = 
{
	任务名称 = "222222",
	任务说明 = "2222222222222222222222222222222222",
	
	pre任务名称 = "你猜",
	pre任务说明 = "你猜,哈哈",
	
	接任务剧情id = 100103,
	交任务剧情id = 100104,
	接任务未完成剧情id = 100105,

}

跑环任务模版表[3] = 
{
	任务名称 = "333333",
	任务说明 = "3333333333333333333333333333333333",
	
	pre任务名称 = "你猜",
	pre任务说明 = "你猜,哈哈",
	
	接任务剧情id = 100103,
	交任务剧情id = 100104,
	接任务未完成剧情id = 100105,
}

跑环任务模版表[4] = 
{
	任务名称 = "444444",
	任务说明 = "44444444444444444444444444",
	
	pre任务名称 = "你猜",
	pre任务说明 = "你猜,哈哈",
	
	接任务剧情id = 100103,
	交任务剧情id = 100104,
	接任务未完成剧情id = 100105,
}

