--塔罗牌相关配置
TarotCfg = 
{
    --参数依次为：塔罗牌ID，塔罗牌名字，塔罗牌奖励ID
    {1, "女祭司", 1},
    {2, "女皇", 2},
    {3, "皇帝", 3},
    {4, "教皇", 4},
    {5, "恋人", 5},
    {6, "正义", 6},
    {7, "倒吊人", 7},
    {8, "死神", 8},
    {9, "恶魔", 9},
    {10, "月亮", 10},
    {11, "太阳", 11},
    {12, "世界", 12},
}

--翻开每张塔罗牌的几率配置
TurnOnTarotCfg = 
{
    --参数依次为：卡罗牌ID，权重
    {1, 5},
    {2, 20},
    {3, 5},
    {4, 10},
    {5, 5},
    {6, 5},
    {7, 5},
    {8, 20},
    {9, 5},
    {10, 10},
    {11, 5},
    {12, 20},
}

--塔罗牌奖励配置
TarotAwardCfg = 
{
    --参数依次为：奖励ID，道具ID，道具数量
    {1, 190201, 1},
	{2, 720271, 1},
	{3, 190201, 1},
	{4, 720272, 1},
	{5, 190201, 1},
	{6, 720273, 1},
	{7, 190201, 1},
	{8, 720274, 1},
	{9, 190201, 1},
	{10, 720275, 1},
	{11, 720276, 1},
	{12, 720271, 1},
}

--塔罗牌重置时间
TarotResetTime = 3 * 60 * 60

--塔罗牌一天最多能获得的道具数量
TarotMostGetItemNum = 10

--塔罗牌当天获得数量限制的道具ID
TarotMostNumItemID = 190201

--翻开塔罗牌需要消耗1个的道具ID
TurnOnTarotNeedItemID = 720204


--玩家最大能翻开的塔罗牌数量
MaxTurnOnTarotNum = 5