EquiptQuality = 
{
	[130101] = 
	{
		exchangeitem = 130102, 													--品质提升成功以后的道具
		needmaterial = {190101,12,190103,36},						--需要的材料
		needmoney = 7898,														--需要的钱
	},

	[130102] = 
	{
		exchangeitem = 130103, 													--品质提升成功以后的道具
		needmaterial = {190111,18,190113,54},						--需要的材料
		needmoney = 23695,														--需要的钱
	},
	
	[130103] = 
	{
		exchangeitem = 130104, 													--品质提升成功以后的道具
		needmaterial = {190111,18,190113,54},						--需要的材料
		needmoney = 39492,														--需要的钱
	},
	
	[130104] = 
	{
		exchangeitem = 130105, 													--品质提升成功以后的道具
		needmaterial = {190121,36,190123,108},						--需要的材料
		needmoney = 55289,														--需要的钱
	},
	
	[130105] = 
	{
		exchangeitem = 130106, 													--品质提升成功以后的道具
		needmaterial = {190121,36,190123,108},						--需要的材料
		needmoney = 71087,														--需要的钱
	},
	
	[130106] = 
	{
		exchangeitem = 130107, 													--品质提升成功以后的道具
		needmaterial = {190131,72,190133,216},						--需要的材料
		needmoney = 86884,														--需要的钱
	},
	
	[130107] = 
	{
		exchangeitem = 130108, 													--品质提升成功以后的道具
		needmaterial = {190131,72,190133,216},						--需要的材料
		needmoney = 102681,														--需要的钱
	},
	
	[130108] = 
	{
		exchangeitem = 130109, 													--品质提升成功以后的道具
		needmaterial = {190141,144,190143,432},						--需要的材料
		needmoney = 118478,														--需要的钱
	},
	
	[130109] = 
	{
		exchangeitem = 130110, 													--品质提升成功以后的道具
		needmaterial = {190141,144,190143,432},						--需要的材料
		needmoney = 134275,														--需要的钱
	},
	[130110] = 
	{
		exchangeitem = 0, 													--品质提升成功以后的道具
		needmaterial = {0,0,0,0},						--需要的材料
		needmoney = 0,														--需要的钱
	},
	------------------分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线---------------------------------------
	[130201] = 
	{
		exchangeitem = 130202, 													--品质提升成功以后的道具
		needmaterial = {190101,12,190103,36},						--需要的材料
		needmoney = 7898,														--需要的钱
	},

	[130202] = 
	{
		exchangeitem = 130203, 													--品质提升成功以后的道具
		needmaterial = {190111,18,190113,54},						--需要的材料
		needmoney = 23695,														--需要的钱
	},
	
	[130203] = 
	{
		exchangeitem = 130204, 													--品质提升成功以后的道具
		needmaterial = {190111,18,190113,54},						--需要的材料
		needmoney = 39492,														--需要的钱
	},
	
	[130204] = 
	{
		exchangeitem = 130205, 													--品质提升成功以后的道具
		needmaterial = {190121,36,190123,108},						--需要的材料
		needmoney = 55289,														--需要的钱
	},
	
	[130205] = 
	{
		exchangeitem = 130206, 													--品质提升成功以后的道具
		needmaterial = {190121,36,190123,108},						--需要的材料
		needmoney = 71087,														--需要的钱
	},
	
	[130206] = 
	{
		exchangeitem = 130207, 													--品质提升成功以后的道具
		needmaterial = {190131,72,190133,216},						--需要的材料
		needmoney = 86884,														--需要的钱
	},
	
	[130207] = 
	{
		exchangeitem = 130208, 													--品质提升成功以后的道具
		needmaterial = {190131,72,190133,216},						--需要的材料
		needmoney = 102681,														--需要的钱
	},
	
	[130208] = 
	{
		exchangeitem = 130209, 													--品质提升成功以后的道具
		needmaterial = {190141,144,190143,432},						--需要的材料
		needmoney = 118478,														--需要的钱
	},
	
	[130209] = 
	{
		exchangeitem = 130210, 													--品质提升成功以后的道具
		needmaterial = {190141,144,190143,432},						--需要的材料
		needmoney = 134275,														--需要的钱
	},
	[130210] = 
	{
		exchangeitem = 0, 													--品质提升成功以后的道具
		needmaterial = {0,0,0,0},						--需要的材料
		needmoney = 0,														--需要的钱
	},
	
	------------------分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线---------------------------------------
	[130301] = 
	{
		exchangeitem = 130302, 													--品质提升成功以后的道具
		needmaterial = {190101,12,190103,36},						--需要的材料
		needmoney = 7898,														--需要的钱
	},

	[130302] = 
	{
		exchangeitem = 130303, 													--品质提升成功以后的道具
		needmaterial = {190111,18,190113,54},						--需要的材料
		needmoney = 23695,														--需要的钱
	},
	
	[130303] = 
	{
		exchangeitem = 130304, 													--品质提升成功以后的道具
		needmaterial = {190111,18,190113,54},						--需要的材料
		needmoney = 39492,														--需要的钱
	},
	
	[130304] = 
	{
		exchangeitem = 130305, 													--品质提升成功以后的道具
		needmaterial = {190121,36,190123,108},						--需要的材料
		needmoney = 55289,														--需要的钱
	},
	
	[130305] = 
	{
		exchangeitem = 130306, 													--品质提升成功以后的道具
		needmaterial = {190121,36,190123,108},						--需要的材料
		needmoney = 71087,														--需要的钱
	},
	
	[130306] = 
	{
		exchangeitem = 130307, 													--品质提升成功以后的道具
		needmaterial = {190131,72,190133,216},						--需要的材料
		needmoney = 86884,														--需要的钱
	},
	
	[130307] = 
	{
		exchangeitem = 130308, 													--品质提升成功以后的道具
		needmaterial = {190131,72,190133,216},						--需要的材料
		needmoney = 102681,														--需要的钱
	},
	
	[130308] = 
	{
		exchangeitem = 130309, 													--品质提升成功以后的道具
		needmaterial = {190141,144,190143,432},						--需要的材料
		needmoney = 118478,														--需要的钱
	},
	
	[130309] = 
	{
		exchangeitem = 130310, 													--品质提升成功以后的道具
		needmaterial = {190141,144,190143,432},						--需要的材料
		needmoney = 134275,														--需要的钱
	},
	[130310] = 
	{
		exchangeitem = 0, 													--品质提升成功以后的道具
		needmaterial = {0,0,0,0},						--需要的材料
		needmoney = 0,														--需要的钱
	},
	
	------------------分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线---------------------------------------
	[130401] = 
	{
		exchangeitem = 130402, 													--品质提升成功以后的道具
		needmaterial = {190102,12,190104,36},						--需要的材料
		needmoney = 7898,														--需要的钱
	},

	[130402] = 
	{
		exchangeitem = 130403, 													--品质提升成功以后的道具
		needmaterial = {190112,18,190114,54},						--需要的材料
		needmoney = 23695,														--需要的钱
	},
	
	[130403] = 
	{
		exchangeitem = 130404, 													--品质提升成功以后的道具
		needmaterial = {190112,18,190114,54},						--需要的材料
		needmoney = 39492,														--需要的钱
	},
	
	[130404] = 
	{
		exchangeitem = 130405, 													--品质提升成功以后的道具
		needmaterial = {190122,36,190124,108},						--需要的材料
		needmoney = 55289,														--需要的钱
	},
	
	[130405] = 
	{
		exchangeitem = 130406, 													--品质提升成功以后的道具
		needmaterial = {190122,36,190124,108},						--需要的材料
		needmoney = 71087,														--需要的钱
	},
	
	[130406] = 
	{
		exchangeitem = 130407, 													--品质提升成功以后的道具
		needmaterial = {190132,72,190134,216},						--需要的材料
		needmoney = 86884,														--需要的钱
	},
	
	[130407] = 
	{
		exchangeitem = 130408, 													--品质提升成功以后的道具
		needmaterial = {190132,72,190134,216},						--需要的材料
		needmoney = 102681,														--需要的钱
	},
	
	[130408] = 
	{
		exchangeitem = 130409, 													--品质提升成功以后的道具
		needmaterial = {190142,144,190144,432},						--需要的材料
		needmoney = 118478,														--需要的钱
	},
	
	[130409] = 
	{
		exchangeitem = 130410, 													--品质提升成功以后的道具
		needmaterial = {190142,144,190144,432},						--需要的材料
		needmoney = 134275,														--需要的钱
	},
	[130410] = 
	{
		exchangeitem = 0, 													--品质提升成功以后的道具
		needmaterial = {0,0,0,0},						--需要的材料
		needmoney = 0,														--需要的钱
	},
		------------------分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线---------------------------------------
	[130501] = 
	{
		exchangeitem = 130502, 													--品质提升成功以后的道具
		needmaterial = {190102,12,190104,36},						--需要的材料
		needmoney = 7898,														--需要的钱
	},

	[130502] = 
	{
		exchangeitem = 130503, 													--品质提升成功以后的道具
		needmaterial = {190112,18,190114,54},						--需要的材料
		needmoney = 23695,														--需要的钱
	},
	
	[130503] = 
	{
		exchangeitem = 130504, 													--品质提升成功以后的道具
		needmaterial = {190112,18,190114,54},						--需要的材料
		needmoney = 39492,														--需要的钱
	},
	
	[130504] = 
	{
		exchangeitem = 130505, 													--品质提升成功以后的道具
		needmaterial = {190122,36,190124,108},						--需要的材料
		needmoney = 55289,														--需要的钱
	},
	
	[130505] = 
	{
		exchangeitem = 130506, 													--品质提升成功以后的道具
		needmaterial = {190122,36,190124,108},						--需要的材料
		needmoney = 71087,														--需要的钱
	},
	
	[130506] = 
	{
		exchangeitem = 130507, 													--品质提升成功以后的道具
		needmaterial = {190132,72,190134,216},						--需要的材料
		needmoney = 86884,														--需要的钱
	},
	
	[130507] = 
	{
		exchangeitem = 130508, 													--品质提升成功以后的道具
		needmaterial = {190132,72,190134,216},						--需要的材料
		needmoney = 102681,														--需要的钱
	},
	
	[130508] = 
	{
		exchangeitem = 130509, 													--品质提升成功以后的道具
		needmaterial = {190142,144,190144,432},						--需要的材料
		needmoney = 118478,														--需要的钱
	},
	
	[130509] = 
	{
		exchangeitem = 130510, 													--品质提升成功以后的道具
		needmaterial = {190142,144,190144,432},						--需要的材料
		needmoney = 134275,														--需要的钱
	},
	[130510] = 
	{
		exchangeitem = 0, 													--品质提升成功以后的道具
		needmaterial = {0,0,0,0},						--需要的材料
		needmoney = 0,														--需要的钱
	},
	------------------分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线---------------------------------------
	
	[130601] = 
	{
		exchangeitem = 130602, 													--品质提升成功以后的道具
		needmaterial = {190102,12,190104,36},						--需要的材料
		needmoney = 7898,														--需要的钱
	},

	[130602] = 
	{
		exchangeitem = 130603, 													--品质提升成功以后的道具
		needmaterial = {190112,18,190114,54},						--需要的材料
		needmoney = 23695,														--需要的钱
	},
	
	[130603] = 
	{
		exchangeitem = 130604, 													--品质提升成功以后的道具
		needmaterial = {190112,18,190114,54},						--需要的材料
		needmoney = 39492,														--需要的钱
	},
	
	[130604] = 
	{
		exchangeitem = 130605, 													--品质提升成功以后的道具
		needmaterial = {190122,36,190124,108},						--需要的材料
		needmoney = 55289,														--需要的钱
	},
	
	[130605] = 
	{
		exchangeitem = 130606, 													--品质提升成功以后的道具
		needmaterial = {190122,36,190124,108},						--需要的材料
		needmoney = 71087,														--需要的钱
	},
	
	[130606] = 
	{
		exchangeitem = 130607, 													--品质提升成功以后的道具
		needmaterial = {190132,72,190134,216},						--需要的材料
		needmoney = 86884,														--需要的钱
	},
	
	[130607] = 
	{
		exchangeitem = 130608, 													--品质提升成功以后的道具
		needmaterial = {190132,72,190134,216},						--需要的材料
		needmoney = 102681,														--需要的钱
	},
	
	[130608] = 
	{
		exchangeitem = 130609, 													--品质提升成功以后的道具
		needmaterial = {190142,144,190144,432},						--需要的材料
		needmoney = 118478,														--需要的钱
	},
	
	[130609] = 
	{
		exchangeitem = 130610, 													--品质提升成功以后的道具
		needmaterial = {190142,144,190144,432},						--需要的材料
		needmoney = 134275,														--需要的钱
	},
	[130610] = 
	{
		exchangeitem = 0, 													--品质提升成功以后的道具
		needmaterial = {0,0,0,0},						--需要的材料
		needmoney = 0,														--需要的钱
	},
			------------------分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线---------------------------------------
	[130701] = 
	{
		exchangeitem = 130702, 													--品质提升成功以后的道具
		needmaterial = {190102,12,190104,36},						--需要的材料
		needmoney = 7898,														--需要的钱
	},

	[130702] = 
	{
		exchangeitem = 130703, 													--品质提升成功以后的道具
		needmaterial = {190112,18,190114,54},						--需要的材料
		needmoney = 23695,														--需要的钱
	},
	
	[130703] = 
	{
		exchangeitem = 130704, 													--品质提升成功以后的道具
		needmaterial = {190112,18,190114,54},						--需要的材料
		needmoney = 39492,														--需要的钱
	},
	
	[130704] = 
	{
		exchangeitem = 130705, 													--品质提升成功以后的道具
		needmaterial = {190122,36,190124,108},						--需要的材料
		needmoney = 55289,														--需要的钱
	},
	
	[130705] = 
	{
		exchangeitem = 130706, 													--品质提升成功以后的道具
		needmaterial = {190122,36,190124,108},						--需要的材料
		needmoney = 71087,														--需要的钱
	},
	
	[130706] = 
	{
		exchangeitem = 130707, 													--品质提升成功以后的道具
		needmaterial = {190132,72,190134,216},						--需要的材料
		needmoney = 86884,														--需要的钱
	},
	
	[130707] = 
	{
		exchangeitem = 130708, 													--品质提升成功以后的道具
		needmaterial = {190132,72,190134,216},						--需要的材料
		needmoney = 102681,														--需要的钱
	},
	
	[130708] = 
	{
		exchangeitem = 130709, 													--品质提升成功以后的道具
		needmaterial = {190142,144,190144,432},						--需要的材料
		needmoney = 118478,														--需要的钱
	},
	
	[130709] = 
	{
		exchangeitem = 130710, 													--品质提升成功以后的道具
		needmaterial = {190142,144,190144,432},						--需要的材料
		needmoney = 134275,														--需要的钱
	},
	[130710] = 
	{
		exchangeitem = 0, 													--品质提升成功以后的道具
		needmaterial = {0,0,0,0},						--需要的材料
		needmoney = 0,														--需要的钱
	},
	------------------分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线---------------------------------------
	
	[130801] = 
	{
		exchangeitem = 130802, 													--品质提升成功以后的道具
		needmaterial = {190101,12,190103,36},						--需要的材料
		needmoney = 7898,														--需要的钱
	},

	[130802] = 
	{
		exchangeitem = 130803, 													--品质提升成功以后的道具
		needmaterial = {190111,18,190113,54},						--需要的材料
		needmoney = 23695,														--需要的钱
	},
	
	[130803] = 
	{
		exchangeitem = 130804, 													--品质提升成功以后的道具
		needmaterial = {190111,18,190113,54},						--需要的材料
		needmoney = 39492,														--需要的钱
	},
	
	[130804] = 
	{
		exchangeitem = 130805, 													--品质提升成功以后的道具
		needmaterial = {190121,36,190123,108},						--需要的材料
		needmoney = 55289,														--需要的钱
	},
	
	[130805] = 
	{
		exchangeitem = 130806, 													--品质提升成功以后的道具
		needmaterial = {190121,36,190123,108},						--需要的材料
		needmoney = 71087,														--需要的钱
	},
	
	[130806] = 
	{
		exchangeitem = 130807, 													--品质提升成功以后的道具
		needmaterial = {190131,72,190133,216},						--需要的材料
		needmoney = 86884,														--需要的钱
	},
	
	[130807] = 
	{
		exchangeitem = 130808, 													--品质提升成功以后的道具
		needmaterial = {190131,72,190133,216},						--需要的材料
		needmoney = 102681,														--需要的钱
	},
	
	[130808] = 
	{
		exchangeitem = 130809, 													--品质提升成功以后的道具
		needmaterial = {190141,144,190143,432},						--需要的材料
		needmoney = 118478,														--需要的钱
	},
	
	[130809] = 
	{
		exchangeitem = 130810, 													--品质提升成功以后的道具
		needmaterial = {190141,144,190143,432},						--需要的材料
		needmoney = 134275,														--需要的钱
	},
	[130810] = 
	{
		exchangeitem = 0, 													--品质提升成功以后的道具
		needmaterial = {0,0,0,0},						--需要的材料
		needmoney = 0,														--需要的钱
	},
--！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！
--！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！
--！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！
--！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！
--！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！
	[120101] = 
	{
		exchangeitem = 120102, 													--品质提升成功以后的道具
		needmaterial = {190101,12,190103,36},						--需要的材料
		needmoney = 7898,														--需要的钱
	},

	[120102] = 
	{
		exchangeitem = 120103, 													--品质提升成功以后的道具
		needmaterial = {190101,12,190103,36},						--需要的材料
		needmoney = 23695,														--需要的钱
	},
	
	[120103] = 
	{
		exchangeitem = 120104, 													--品质提升成功以后的道具
		needmaterial = {190111,18,190113,54},						--需要的材料
		needmoney = 39492,														--需要的钱
	},
	
	[120104] = 
	{
		exchangeitem = 120105, 													--品质提升成功以后的道具
		needmaterial = {190121,36,190123,108},						--需要的材料
		needmoney = 55289,														--需要的钱
	},
	
	[120105] = 
	{
		exchangeitem = 120106, 													--品质提升成功以后的道具
		needmaterial = {190121,36,190123,108},						--需要的材料
		needmoney = 71087,														--需要的钱
	},
	
	[120106] = 
	{
		exchangeitem = 120107, 													--品质提升成功以后的道具
		needmaterial = {190131,72,190133,216},						--需要的材料
		needmoney = 86884,														--需要的钱
	},
	
	[120107] = 
	{
		exchangeitem = 120108, 													--品质提升成功以后的道具
		needmaterial = {190131,72,190133,216},						--需要的材料
		needmoney = 102681,														--需要的钱
	},
	
	[120108] = 
	{
		exchangeitem = 120109, 													--品质提升成功以后的道具
		needmaterial = {190141,144,190143,432},						--需要的材料
		needmoney = 118478,														--需要的钱
	},
	
	[120109] = 
	{
		exchangeitem = 120110, 													--品质提升成功以后的道具
		needmaterial = {190141,144,190143,432},						--需要的材料
		needmoney = 134275,														--需要的钱
	},
	[120110] = 
	{
		exchangeitem = 0, 													--品质提升成功以后的道具
		needmaterial = {0,0,0,0},						--需要的材料
		needmoney = 0,														--需要的钱
	},
	------------------分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线---------------------------------------
	[120201] = 
	{
		exchangeitem = 120202, 													--品质提升成功以后的道具
		needmaterial = {190101,12,190103,36},						--需要的材料
		needmoney = 7898,														--需要的钱
	},

	[120202] = 
	{
		exchangeitem = 120203, 													--品质提升成功以后的道具
		needmaterial = {190101,12,190103,36},						--需要的材料
		needmoney = 23695,														--需要的钱
	},
	
	[120203] = 
	{
		exchangeitem = 120204, 													--品质提升成功以后的道具
		needmaterial = {190111,18,190113,54},						--需要的材料
		needmoney = 39492,														--需要的钱
	},
	
	[120204] = 
	{
		exchangeitem = 120205, 													--品质提升成功以后的道具
		needmaterial = {190121,36,190123,108},						--需要的材料
		needmoney = 55289,														--需要的钱
	},
	
	[120205] = 
	{
		exchangeitem = 120206, 													--品质提升成功以后的道具
		needmaterial = {190121,36,190123,108},						--需要的材料
		needmoney = 71087,														--需要的钱
	},
	
	[120206] = 
	{
		exchangeitem = 120207, 													--品质提升成功以后的道具
		needmaterial = {190131,72,190133,216},						--需要的材料
		needmoney = 86884,														--需要的钱
	},
	
	[120207] = 
	{
		exchangeitem = 120208, 													--品质提升成功以后的道具
		needmaterial = {190131,72,190133,216},						--需要的材料
		needmoney = 102681,														--需要的钱
	},
	
	[120208] = 
	{
		exchangeitem = 120209, 													--品质提升成功以后的道具
		needmaterial = {190141,144,190143,432},						--需要的材料
		needmoney = 118478,														--需要的钱
	},
	
	[120209] = 
	{
		exchangeitem = 120210, 													--品质提升成功以后的道具
		needmaterial = {190141,144,190143,432},						--需要的材料
		needmoney = 134275,														--需要的钱
	},
	[120210] = 
	{
		exchangeitem = 0, 													--品质提升成功以后的道具
		needmaterial = {0,0,0,0},						--需要的材料
		needmoney = 0,														--需要的钱
	},
	
	------------------分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线---------------------------------------
	[120301] = 
	{
		exchangeitem = 120302, 													--品质提升成功以后的道具
		needmaterial = {190101,12,190103,36},						--需要的材料
		needmoney = 7898,														--需要的钱
	},

	[120302] = 
	{
		exchangeitem = 120303, 													--品质提升成功以后的道具
		needmaterial = {190101,12,190103,36},						--需要的材料
		needmoney = 23695,														--需要的钱
	},
	
	[120303] = 
	{
		exchangeitem = 120304, 													--品质提升成功以后的道具
		needmaterial = {190111,18,190113,54},						--需要的材料
		needmoney = 39492,														--需要的钱
	},
	
	[120304] = 
	{
		exchangeitem = 120305, 													--品质提升成功以后的道具
		needmaterial = {190121,36,190123,108},						--需要的材料
		needmoney = 55289,														--需要的钱
	},
	
	[120305] = 
	{
		exchangeitem = 120306, 													--品质提升成功以后的道具
		needmaterial = {190121,36,190123,108},						--需要的材料
		needmoney = 71087,														--需要的钱
	},
	
	[120306] = 
	{
		exchangeitem = 120307, 													--品质提升成功以后的道具
		needmaterial = {190131,72,190133,216},						--需要的材料
		needmoney = 86884,														--需要的钱
	},
	
	[120307] = 
	{
		exchangeitem = 120308, 													--品质提升成功以后的道具
		needmaterial = {190131,72,190133,216},						--需要的材料
		needmoney = 102681,														--需要的钱
	},
	
	[120308] = 
	{
		exchangeitem = 120309, 													--品质提升成功以后的道具
		needmaterial = {190141,144,190143,432},						--需要的材料
		needmoney = 118478,														--需要的钱
	},
	
	[120309] = 
	{
		exchangeitem = 120310, 													--品质提升成功以后的道具
		needmaterial = {190141,144,190143,432},						--需要的材料
		needmoney = 134275,														--需要的钱
	},
	[120310] = 
	{
		exchangeitem = 0, 													--品质提升成功以后的道具
		needmaterial = {0,0,0,0},						--需要的材料
		needmoney = 0,														--需要的钱
	},
	------------------分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线---------------------------------------
	[120401] = 
	{
		exchangeitem = 120402, 													--品质提升成功以后的道具
		needmaterial = {190102,12,190104,36},						--需要的材料
		needmoney = 7898,														--需要的钱
	},

	[120402] = 
	{
		exchangeitem = 120403, 													--品质提升成功以后的道具
		needmaterial = {190112,18,190114,54},						--需要的材料
		needmoney = 23695,														--需要的钱
	},
	
	[120403] = 
	{
		exchangeitem = 120404, 													--品质提升成功以后的道具
		needmaterial = {190112,18,190114,54},						--需要的材料
		needmoney = 39492,														--需要的钱
	},
	
	[120404] = 
	{
		exchangeitem = 120405, 													--品质提升成功以后的道具
		needmaterial = {190122,36,190124,108},						--需要的材料
		needmoney = 55289,														--需要的钱
	},
	
	[120405] = 
	{
		exchangeitem = 120406, 													--品质提升成功以后的道具
		needmaterial = {190122,36,190124,108},						--需要的材料
		needmoney = 71087,														--需要的钱
	},
	
	[120406] = 
	{
		exchangeitem = 120407, 													--品质提升成功以后的道具
		needmaterial = {190132,72,190134,216},						--需要的材料
		needmoney = 86884,														--需要的钱
	},
	
	[120407] = 
	{
		exchangeitem = 120408, 													--品质提升成功以后的道具
		needmaterial = {190132,72,190134,216},						--需要的材料
		needmoney = 102681,														--需要的钱
	},
	
	[120408] = 
	{
		exchangeitem = 120409, 													--品质提升成功以后的道具
		needmaterial = {190142,144,190144,432},						--需要的材料
		needmoney = 118478,														--需要的钱
	},
	
	[120409] = 
	{
		exchangeitem = 120410, 													--品质提升成功以后的道具
		needmaterial = {190142,144,190144,432},						--需要的材料
		needmoney = 134275,														--需要的钱
	},
	[120410] = 
	{
		exchangeitem = 0, 													--品质提升成功以后的道具
		needmaterial = {0,0,0,0},						--需要的材料
		needmoney = 0,														--需要的钱
	},
		------------------分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线---------------------------------------
	[120501] = 
	{
		exchangeitem = 120502, 													--品质提升成功以后的道具
		needmaterial = {190102,12,190104,36},						--需要的材料
		needmoney = 7898,														--需要的钱
	},

	[120502] = 
	{
		exchangeitem = 120503, 													--品质提升成功以后的道具
		needmaterial = {190102,12,190104,36},						--需要的材料
		needmoney = 23695,														--需要的钱
	},
	
	[120503] = 
	{
		exchangeitem = 120504, 													--品质提升成功以后的道具
		needmaterial = {190112,18,190114,54},						--需要的材料
		needmoney = 39492,														--需要的钱
	},
	
	[120504] = 
	{
		exchangeitem = 120505, 													--品质提升成功以后的道具
		needmaterial = {190122,36,190124,108},						--需要的材料
		needmoney = 55289,														--需要的钱
	},
	
	[120505] = 
	{
		exchangeitem = 120506, 													--品质提升成功以后的道具
		needmaterial = {190122,36,190124,108},						--需要的材料
		needmoney = 71087,														--需要的钱
	},
	
	[120506] = 
	{
		exchangeitem = 120507, 													--品质提升成功以后的道具
		needmaterial = {190132,72,190134,216},						--需要的材料
		needmoney = 86884,														--需要的钱
	},
	
	[120507] = 
	{
		exchangeitem = 120508, 													--品质提升成功以后的道具
		needmaterial = {190132,72,190134,216},						--需要的材料
		needmoney = 102681,														--需要的钱
	},
	
	[120508] = 
	{
		exchangeitem = 120509, 													--品质提升成功以后的道具
		needmaterial = {190142,144,190144,432},						--需要的材料
		needmoney = 118478,														--需要的钱
	},
	
	[120509] = 
	{
		exchangeitem = 120510, 													--品质提升成功以后的道具
		needmaterial = {190142,144,190144,432},						--需要的材料
		needmoney = 134275,														--需要的钱
	},
	[120510] = 
	{
		exchangeitem = 0, 													--品质提升成功以后的道具
		needmaterial = {0,0,0,0},						--需要的材料
		needmoney = 0,														--需要的钱
	},
	------------------分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线---------------------------------------
	
	[120601] = 
	{
		exchangeitem = 120602, 													--品质提升成功以后的道具
		needmaterial = {190102,12,190104,36},						--需要的材料
		needmoney = 7898,														--需要的钱
	},

	[120602] = 
	{
		exchangeitem = 120603, 													--品质提升成功以后的道具
		needmaterial = {190102,12,190104,36},						--需要的材料
		needmoney = 23695,														--需要的钱
	},
	
	[120603] = 
	{
		exchangeitem = 120604, 													--品质提升成功以后的道具
		needmaterial = {190112,18,190114,54},						--需要的材料
		needmoney = 39492,														--需要的钱
	},
	
	[120604] = 
	{
		exchangeitem = 120605, 													--品质提升成功以后的道具
		needmaterial = {190122,36,190124,108},						--需要的材料
		needmoney = 55289,														--需要的钱
	},
	
	[120605] = 
	{
		exchangeitem = 120606, 													--品质提升成功以后的道具
		needmaterial = {190122,36,190124,108},						--需要的材料
		needmoney = 71087,														--需要的钱
	},
	
	[120606] = 
	{
		exchangeitem = 120607, 													--品质提升成功以后的道具
		needmaterial = {190132,72,190134,216},						--需要的材料
		needmoney = 86884,														--需要的钱
	},
	
	[120607] = 
	{
		exchangeitem = 120608, 													--品质提升成功以后的道具
		needmaterial = {190132,72,190134,216},						--需要的材料
		needmoney = 102681,														--需要的钱
	},
	
	[120608] = 
	{
		exchangeitem = 120609, 													--品质提升成功以后的道具
		needmaterial = {190142,144,190144,432},						--需要的材料
		needmoney = 118478,														--需要的钱
	},
	
	[120609] = 
	{
		exchangeitem = 120610, 													--品质提升成功以后的道具
		needmaterial = {190142,144,190144,432},						--需要的材料
		needmoney = 134275,														--需要的钱
	},
	[120610] = 
	{
		exchangeitem = 0, 													--品质提升成功以后的道具
		needmaterial = {0,0,0,0},						--需要的材料
		needmoney = 0,														--需要的钱
	},
			------------------分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线---------------------------------------
	[120701] = 
	{
		exchangeitem = 120702, 													--品质提升成功以后的道具
		needmaterial = {190102,12,190104,36},						--需要的材料
		needmoney = 7898,														--需要的钱
	},

	[120702] = 
	{
		exchangeitem = 120703, 													--品质提升成功以后的道具
		needmaterial = {190102,12,190104,36},						--需要的材料
		needmoney = 23695,														--需要的钱
	},
	
	[120703] = 
	{
		exchangeitem = 120704, 													--品质提升成功以后的道具
		needmaterial = {190112,18,190114,54},						--需要的材料
		needmoney = 39492,														--需要的钱
	},
	
	[120704] = 
	{
		exchangeitem = 120705, 													--品质提升成功以后的道具
		needmaterial = {190122,36,190124,108},						--需要的材料
		needmoney = 55289,														--需要的钱
	},
	
	[120705] = 
	{
		exchangeitem = 120706, 													--品质提升成功以后的道具
		needmaterial = {190122,36,190124,108},						--需要的材料
		needmoney = 71087,														--需要的钱
	},
	
	[120706] = 
	{
		exchangeitem = 120707, 													--品质提升成功以后的道具
		needmaterial = {190132,72,190134,216},						--需要的材料
		needmoney = 86884,														--需要的钱
	},
	
	[120707] = 
	{
		exchangeitem = 120708, 													--品质提升成功以后的道具
		needmaterial = {190132,72,190134,216},						--需要的材料
		needmoney = 102681,														--需要的钱
	},
	
	[120708] = 
	{
		exchangeitem = 120709, 													--品质提升成功以后的道具
		needmaterial = {190142,144,190144,432},						--需要的材料
		needmoney = 118478,														--需要的钱
	},
	
	[120709] = 
	{
		exchangeitem = 120710, 													--品质提升成功以后的道具
		needmaterial = {190142,144,190144,432},						--需要的材料
		needmoney = 134275,														--需要的钱
	},
	[120710] = 
	{
		exchangeitem = 0, 													--品质提升成功以后的道具
		needmaterial = {0,0,0,0},						--需要的材料
		needmoney = 0,														--需要的钱
	},
	------------------分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线---------------------------------------
	
	[120801] = 
	{
		exchangeitem = 120802, 													--品质提升成功以后的道具
		needmaterial = {190101,12,190103,36},						--需要的材料
		needmoney = 7898,														--需要的钱
	},

	[120802] = 
	{
		exchangeitem = 120803, 													--品质提升成功以后的道具
		needmaterial = {190101,12,190103,36},						--需要的材料
		needmoney = 23695,														--需要的钱
	},
	
	[120803] = 
	{
		exchangeitem = 120804, 													--品质提升成功以后的道具
		needmaterial = {190111,18,190113,54},						--需要的材料
		needmoney = 39492,														--需要的钱
	},
	
	[120804] = 
	{
		exchangeitem = 120805, 													--品质提升成功以后的道具
		needmaterial = {190121,36,190123,108},						--需要的材料
		needmoney = 55289,														--需要的钱
	},
	
	[120805] = 
	{
		exchangeitem = 120806, 													--品质提升成功以后的道具
		needmaterial = {190121,36,190123,108},						--需要的材料
		needmoney = 71087,														--需要的钱
	},
	
	[120806] = 
	{
		exchangeitem = 120807, 													--品质提升成功以后的道具
		needmaterial = {190131,72,190133,216},						--需要的材料
		needmoney = 86884,														--需要的钱
	},
	
	[120807] = 
	{
		exchangeitem = 120808, 													--品质提升成功以后的道具
		needmaterial = {190131,72,190133,216},						--需要的材料
		needmoney = 102681,														--需要的钱
	},
	
	[120808] = 
	{
		exchangeitem = 120809, 													--品质提升成功以后的道具
		needmaterial = {190141,144,190143,432},						--需要的材料
		needmoney = 118478,														--需要的钱
	},
	
	[120809] = 
	{
		exchangeitem = 120810, 													--品质提升成功以后的道具
		needmaterial = {190141,144,190143,432},						--需要的材料
		needmoney = 134275,														--需要的钱
	},
	[120810] = 
	{
		exchangeitem = 0, 													--品质提升成功以后的道具
		needmaterial = {0,0,0,0},						--需要的材料
		needmoney = 0,														--需要的钱
	},
--！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！
--！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！
--！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！
--！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！
--！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！
	[110101] = 
	{
		exchangeitem = 110102, 													--品质提升成功以后的道具
		needmaterial = {190101,12,190103,36},						--需要的材料
		needmoney = 7898,														--需要的钱
	},

	[110102] = 
	{
		exchangeitem = 110103, 													--品质提升成功以后的道具
		needmaterial = {190101,12,190103,36},						--需要的材料
		needmoney = 23695,														--需要的钱
	},
	
	[110103] = 
	{
		exchangeitem = 110104, 													--品质提升成功以后的道具
		needmaterial = {190111,18,190113,54},						--需要的材料
		needmoney = 39492,														--需要的钱
	},
	
	[110104] = 
	{
		exchangeitem = 110105, 													--品质提升成功以后的道具
		needmaterial = {190121,36,190123,108},						--需要的材料
		needmoney = 55289,														--需要的钱
	},
	
	[110105] = 
	{
		exchangeitem = 110106, 													--品质提升成功以后的道具
		needmaterial = {190121,36,190123,108},						--需要的材料
		needmoney = 71087,														--需要的钱
	},
	
	[110106] = 
	{
		exchangeitem = 110107, 													--品质提升成功以后的道具
		needmaterial = {190131,72,190133,216},						--需要的材料
		needmoney = 86884,														--需要的钱
	},
	
	[110107] = 
	{
		exchangeitem = 110108, 													--品质提升成功以后的道具
		needmaterial = {190131,72,190133,216},						--需要的材料
		needmoney = 102681,														--需要的钱
	},
	
	[110108] = 
	{
		exchangeitem = 110109, 													--品质提升成功以后的道具
		needmaterial = {190141,144,190143,432},						--需要的材料
		needmoney = 118478,														--需要的钱
	},
	
	[110109] = 
	{
		exchangeitem = 110110, 													--品质提升成功以后的道具
		needmaterial = {190141,144,190143,432},						--需要的材料
		needmoney = 134275,														--需要的钱
	},
	[110110] = 
	{
		exchangeitem = 0, 													--品质提升成功以后的道具
		needmaterial = {0,0,0,0},						--需要的材料
		needmoney = 0,														--需要的钱
	},
	------------------分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线---------------------------------------
	[110201] = 
	{
		exchangeitem = 110202, 													--品质提升成功以后的道具
		needmaterial = {190101,12,190103,36},						--需要的材料
		needmoney = 7898,														--需要的钱
	},

	[110202] = 
	{
		exchangeitem = 110203, 													--品质提升成功以后的道具
		needmaterial = {190101,12,190103,36},						--需要的材料
		needmoney = 23695,														--需要的钱
	},
	
	[110203] = 
	{
		exchangeitem = 110204, 													--品质提升成功以后的道具
		needmaterial = {190111,18,190113,54},						--需要的材料
		needmoney = 39492,														--需要的钱
	},
	
	[110204] = 
	{
		exchangeitem = 110205, 													--品质提升成功以后的道具
		needmaterial = {190121,36,190123,108},						--需要的材料
		needmoney = 55289,														--需要的钱
	},
	
	[110205] = 
	{
		exchangeitem = 110206, 													--品质提升成功以后的道具
		needmaterial = {190121,36,190123,108},						--需要的材料
		needmoney = 71087,														--需要的钱
	},
	
	[110206] = 
	{
		exchangeitem = 110207, 													--品质提升成功以后的道具
		needmaterial = {190131,72,190133,216},						--需要的材料
		needmoney = 86884,														--需要的钱
	},
	
	[110207] = 
	{
		exchangeitem = 110208, 													--品质提升成功以后的道具
		needmaterial = {190131,72,190133,216},						--需要的材料
		needmoney = 102681,														--需要的钱
	},
	
	[110208] = 
	{
		exchangeitem = 110209, 													--品质提升成功以后的道具
		needmaterial = {190141,144,190143,432},						--需要的材料
		needmoney = 118478,														--需要的钱
	},
	
	[110209] = 
	{
		exchangeitem = 110210, 													--品质提升成功以后的道具
		needmaterial = {190141,144,190143,432},						--需要的材料
		needmoney = 134275,														--需要的钱
	},
	[110210] = 
	{
		exchangeitem = 0, 													--品质提升成功以后的道具
		needmaterial = {0,0,0,0},						--需要的材料
		needmoney = 0,														--需要的钱
	},
	------------------分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线---------------------------------------
	[110301] = 
	{
		exchangeitem = 110302, 													--品质提升成功以后的道具
		needmaterial = {190101,12,190103,36},						--需要的材料
		needmoney = 7898,														--需要的钱
	},

	[110302] = 
	{
		exchangeitem = 110303, 													--品质提升成功以后的道具
		needmaterial = {190101,12,190103,36},						--需要的材料
		needmoney = 23695,														--需要的钱
	},
	
	[110303] = 
	{
		exchangeitem = 110304, 													--品质提升成功以后的道具
		needmaterial = {190111,18,190113,54},						--需要的材料
		needmoney = 39492,														--需要的钱
	},
	
	[110304] = 
	{
		exchangeitem = 110305, 													--品质提升成功以后的道具
		needmaterial = {190121,36,190123,108},						--需要的材料
		needmoney = 55289,														--需要的钱
	},
	
	[110305] = 
	{
		exchangeitem = 110306, 													--品质提升成功以后的道具
		needmaterial = {190121,36,190123,108},						--需要的材料
		needmoney = 71087,														--需要的钱
	},
	
	[110306] = 
	{
		exchangeitem = 110307, 													--品质提升成功以后的道具
		needmaterial = {190131,72,190133,216},						--需要的材料
		needmoney = 86884,														--需要的钱
	},
	
	[110307] = 
	{
		exchangeitem = 110308, 													--品质提升成功以后的道具
		needmaterial = {190131,72,190133,216},						--需要的材料
		needmoney = 102681,														--需要的钱
	},
	
	[110308] = 
	{
		exchangeitem = 110309, 													--品质提升成功以后的道具
		needmaterial = {190141,144,190143,432},						--需要的材料
		needmoney = 118478,														--需要的钱
	},
	
	[110309] = 
	{
		exchangeitem = 110310, 													--品质提升成功以后的道具
		needmaterial = {190141,144,190143,432},						--需要的材料
		needmoney = 134275,														--需要的钱
	},
	[110310] = 
	{
		exchangeitem = 0, 													--品质提升成功以后的道具
		needmaterial = {0,0,0,0},						--需要的材料
		needmoney = 0,														--需要的钱
	},
	------------------分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线---------------------------------------
	[110401] = 
	{
		exchangeitem = 110402, 													--品质提升成功以后的道具
		needmaterial = {190102,12,190104,36},						--需要的材料
		needmoney = 7898,														--需要的钱
	},

	[110402] = 
	{
		exchangeitem = 110403, 													--品质提升成功以后的道具
		needmaterial = {190102,12,190104,36},						--需要的材料
		needmoney = 23695,														--需要的钱
	},
	
	[110403] = 
	{
		exchangeitem = 110404, 													--品质提升成功以后的道具
		needmaterial = {190112,18,190114,54},						--需要的材料
		needmoney = 39492,														--需要的钱
	},
	
	[110404] = 
	{
		exchangeitem = 110405, 													--品质提升成功以后的道具
		needmaterial = {190122,36,190124,108},						--需要的材料
		needmoney = 55289,														--需要的钱
	},
	
	[110405] = 
	{
		exchangeitem = 110406, 													--品质提升成功以后的道具
		needmaterial = {190122,36,190124,108},						--需要的材料
		needmoney = 71087,														--需要的钱
	},
	
	[110406] = 
	{
		exchangeitem = 110407, 													--品质提升成功以后的道具
		needmaterial = {190132,72,190134,216},						--需要的材料
		needmoney = 86884,														--需要的钱
	},
	
	[110407] = 
	{
		exchangeitem = 110408, 													--品质提升成功以后的道具
		needmaterial = {190132,72,190134,216},						--需要的材料
		needmoney = 102681,														--需要的钱
	},
	
	[110408] = 
	{
		exchangeitem = 110409, 													--品质提升成功以后的道具
		needmaterial = {190142,144,190144,432},						--需要的材料
		needmoney = 118478,														--需要的钱
	},
	
	[110409] = 
	{
		exchangeitem = 110410, 													--品质提升成功以后的道具
		needmaterial = {190142,144,190144,432},						--需要的材料
		needmoney = 134275,														--需要的钱
	},
	[110410] = 
	{
		exchangeitem = 0, 													--品质提升成功以后的道具
		needmaterial = {0,0,0,0},						--需要的材料
		needmoney = 0,														--需要的钱
	},
		------------------分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线---------------------------------------
	[110501] = 
	{
		exchangeitem = 110502, 													--品质提升成功以后的道具
		needmaterial = {190102,12,190104,36},						--需要的材料
		needmoney = 7898,														--需要的钱
	},

	[110502] = 
	{
		exchangeitem = 110503, 													--品质提升成功以后的道具
		needmaterial = {190102,12,190104,36},						--需要的材料
		needmoney = 23695,														--需要的钱
	},
	
	[110503] = 
	{
		exchangeitem = 110504, 													--品质提升成功以后的道具
		needmaterial = {190112,18,190114,54},						--需要的材料
		needmoney = 39492,														--需要的钱
	},
	
	[110504] = 
	{
		exchangeitem = 110505, 													--品质提升成功以后的道具
		needmaterial = {190122,36,190124,108},						--需要的材料
		needmoney = 55289,														--需要的钱
	},
	
	[110505] = 
	{
		exchangeitem = 110506, 													--品质提升成功以后的道具
		needmaterial = {190122,36,190124,108},						--需要的材料
		needmoney = 71087,														--需要的钱
	},
	
	[110506] = 
	{
		exchangeitem = 110507, 													--品质提升成功以后的道具
		needmaterial = {190132,72,190134,216},						--需要的材料
		needmoney = 86884,														--需要的钱
	},
	
	[110507] = 
	{
		exchangeitem = 110508, 													--品质提升成功以后的道具
		needmaterial = {190132,72,190134,216},						--需要的材料
		needmoney = 102681,														--需要的钱
	},
	
	[110508] = 
	{
		exchangeitem = 110509, 													--品质提升成功以后的道具
		needmaterial = {190142,144,190144,432},						--需要的材料
		needmoney = 118478,														--需要的钱
	},
	
	[110509] = 
	{
		exchangeitem = 110510, 													--品质提升成功以后的道具
		needmaterial = {190142,144,190144,432},						--需要的材料
		needmoney = 134275,														--需要的钱
	},
	[110510] = 
	{
		exchangeitem = 0, 													--品质提升成功以后的道具
		needmaterial = {0,0,0,0},						--需要的材料
		needmoney = 0,														--需要的钱
	},
	------------------分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线---------------------------------------
	
	[110601] = 
	{
		exchangeitem = 110602, 													--品质提升成功以后的道具
		needmaterial = {190102,12,190104,36},						--需要的材料
		needmoney = 7898,														--需要的钱
	},

	[110602] = 
	{
		exchangeitem = 110603, 													--品质提升成功以后的道具
		needmaterial = {190102,12,190104,36},						--需要的材料
		needmoney = 23695,														--需要的钱
	},
	
	[110603] = 
	{
		exchangeitem = 110604, 													--品质提升成功以后的道具
		needmaterial = {190112,18,190114,54},						--需要的材料
		needmoney = 39492,														--需要的钱
	},
	
	[110604] = 
	{
		exchangeitem = 110605, 													--品质提升成功以后的道具
		needmaterial = {190122,36,190124,108},						--需要的材料
		needmoney = 55289,														--需要的钱
	},
	
	[110605] = 
	{
		exchangeitem = 110606, 													--品质提升成功以后的道具
		needmaterial = {190122,36,190124,108},						--需要的材料
		needmoney = 71087,														--需要的钱
	},
	
	[110606] = 
	{
		exchangeitem = 110607, 													--品质提升成功以后的道具
		needmaterial = {190132,72,190134,216},						--需要的材料
		needmoney = 86884,														--需要的钱
	},
	
	[110607] = 
	{
		exchangeitem = 110608, 													--品质提升成功以后的道具
		needmaterial = {190132,72,190134,216},						--需要的材料
		needmoney = 102681,														--需要的钱
	},
	
	[110608] = 
	{
		exchangeitem = 110609, 													--品质提升成功以后的道具
		needmaterial = {190142,144,190144,432},						--需要的材料
		needmoney = 118478,														--需要的钱
	},
	
	[110609] = 
	{
		exchangeitem = 110610, 													--品质提升成功以后的道具
		needmaterial = {190142,144,190144,432},						--需要的材料
		needmoney = 134275,														--需要的钱
	},
	[110610] = 
	{
		exchangeitem = 0, 													--品质提升成功以后的道具
		needmaterial = {0,0,0,0},						--需要的材料
		needmoney = 0,														--需要的钱
	},
			------------------分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线---------------------------------------
	[110701] = 
	{
		exchangeitem = 110702, 													--品质提升成功以后的道具
		needmaterial = {190102,12,190104,36},						--需要的材料
		needmoney = 7898,														--需要的钱
	},

	[110702] = 
	{
		exchangeitem = 110703, 													--品质提升成功以后的道具
		needmaterial = {190102,12,190104,36},						--需要的材料
		needmoney = 23695,														--需要的钱
	},
	
	[110703] = 
	{
		exchangeitem = 110704, 													--品质提升成功以后的道具
		needmaterial = {190112,18,190114,54},						--需要的材料
		needmoney = 39492,														--需要的钱
	},
	
	[110704] = 
	{
		exchangeitem = 110705, 													--品质提升成功以后的道具
		needmaterial = {190122,36,190124,108},						--需要的材料
		needmoney = 55289,														--需要的钱
	},
	
	[110705] = 
	{
		exchangeitem = 110706, 													--品质提升成功以后的道具
		needmaterial = {190122,36,190124,108},						--需要的材料
		needmoney = 71087,														--需要的钱
	},
	
	[110706] = 
	{
		exchangeitem = 110707, 													--品质提升成功以后的道具
		needmaterial = {190132,72,190134,216},						--需要的材料
		needmoney = 86884,														--需要的钱
	},
	
	[110707] = 
	{
		exchangeitem = 110708, 													--品质提升成功以后的道具
		needmaterial = {190132,72,190134,216},						--需要的材料
		needmoney = 102681,														--需要的钱
	},
	
	[110708] = 
	{
		exchangeitem = 110709, 													--品质提升成功以后的道具
		needmaterial = {190142,144,190144,432},						--需要的材料
		needmoney = 118478,														--需要的钱
	},
	
	[110709] = 
	{
		exchangeitem = 110710, 													--品质提升成功以后的道具
		needmaterial = {190142,144,190144,432},						--需要的材料
		needmoney = 134275,														--需要的钱
	},
	[110710] = 
	{
		exchangeitem = 0, 													--品质提升成功以后的道具
		needmaterial = {0,0,0,0},						--需要的材料
		needmoney = 0,														--需要的钱
	},
	------------------分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线分割线---------------------------------------
	
	[110801] = 
	{
		exchangeitem = 110802, 													--品质提升成功以后的道具
		needmaterial = {190101,12,190103,36},						--需要的材料
		needmoney = 7898,														--需要的钱
	},

	[110802] = 
	{
		exchangeitem = 110803, 													--品质提升成功以后的道具
		needmaterial = {190101,12,190103,36},						--需要的材料
		needmoney = 23695,														--需要的钱
	},
	
	[110803] = 
	{
		exchangeitem = 110804, 													--品质提升成功以后的道具
		needmaterial = {190111,18,190113,54},						--需要的材料
		needmoney = 39492,														--需要的钱
	},
	
	[110804] = 
	{
		exchangeitem = 110805, 													--品质提升成功以后的道具
		needmaterial = {190121,36,190123,108},						--需要的材料
		needmoney = 55289,														--需要的钱
	},
	
	[110805] = 
	{
		exchangeitem = 110806, 													--品质提升成功以后的道具
		needmaterial = {190121,36,190123,108},						--需要的材料
		needmoney = 71087,														--需要的钱
	},
	
	[110806] = 
	{
		exchangeitem = 110807, 													--品质提升成功以后的道具
		needmaterial = {190131,72,190133,216},						--需要的材料
		needmoney = 86884,														--需要的钱
	},
	
	[110807] = 
	{
		exchangeitem = 110808, 													--品质提升成功以后的道具
		needmaterial = {190131,72,190133,216},						--需要的材料
		needmoney = 102681,														--需要的钱
	},
	
	[110808] = 
	{
		exchangeitem = 110809, 													--品质提升成功以后的道具
		needmaterial = {190141,144,190143,432},						--需要的材料
		needmoney = 118478,														--需要的钱
	},
	
	[110809] = 
	{
		exchangeitem = 110810, 													--品质提升成功以后的道具
		needmaterial = {190141,144,190143,432},						--需要的材料
		needmoney = 134275,														--需要的钱
	},
	[110810] = 
	{
		exchangeitem = 0, 													--品质提升成功以后的道具
		needmaterial = {0,0,0,0},						--需要的材料
		needmoney = 0,														--需要的钱
	},

}
