--竞技场奖励配置
ArenaRewardConfig = {}
ArenaRewardConfig = 
{
    {
        levelstage = {1,1}, --，奖励等级阶段,表示第1名
        rewardlist = {190311,1,190401,1,190411,1,190311,1,190311,1},
    },
	{
        levelstage = {2,2}, --，奖励等级阶段,表示第1名
         rewardlist = {190311,1,190401,1,190411,1,190311,1,190311,1},
    },
	{
        levelstage = {3,3}, --，奖励等级阶段,表示第1名
         rewardlist = {190311,1,190401,1,190411,1,190311,1,190311,1},
    },
	{
        levelstage = {4,4}, --，奖励等级阶段,表示第1名
        rewardlist = {190500,70,190501,70,190502,70,190503,70,190504,70},
    },
	{
        levelstage = {5,5}, --，奖励等级阶段,表示第1名
        rewardlist = {190500,60,190501,60,190502,60,190503,60,190504,60},
    },
	{
        levelstage = {6,6}, --，奖励等级阶段,表示第1名
        rewardlist = {190500,50,190501,50,190502,50,190503,50,190504,50},
    },
	{
        levelstage = {7,7}, --，奖励等级阶段,表示第1名
        rewardlist = {190500,40,190501,40,190502,40,190503,40,190504,40},
    },
	{
        levelstage = {8,8}, --，奖励等级阶段,表示第1名
        rewardlist = {190500,30,190501,30,190502,30,190503,30,190504,30},
    },
	{
        levelstage = {9,9}, --，奖励等级阶段,表示第1名
        rewardlist = {190500,20,190501,20,190502,20,190503,20,190504,20},
    },
	{
        levelstage = {10,10}, --，奖励等级阶段,表示第1名
        rewardlist = {190500,11,190501,11,190502,11,190503,11,190504,11},
    },
	{
        levelstage = {11,50}, --，奖励等级阶段,表示第2名
        rewardlist = {190500,10,190501,10,190502,10,190503,10,190504,10},
    },
	{
        levelstage = {51,100}, --，奖励等级阶段,表示第2名
        rewardlist = {190500,9,190501,9,190502,9,190503,9,190504,9},
    },	
	{
        levelstage = {101,150}, --，奖励等级阶段,表示第2名
        rewardlist = {190500,1,190501,1,190502,1,190503,1,190504,1},
    },
	{
        levelstage = {151,200}, --，奖励等级阶段,表示第2名
        rewardlist = {190500,8,190501,8,190502,8,190503,8,190504,8},
    },
	{
        levelstage = {201,250}, --，奖励等级阶段,表示第2名
        rewardlist = {190500,7,190501,7,190502,7,190503,7,190504,7},
    },
    {
        levelstage = {251,300}, --，奖励等级阶段,表示第2名
        rewardlist = {190500,6,190501,6,190502,6,190503,6,190504,6},
    },
	{
        levelstage = {301,400}, --，奖励等级阶段,表示第1名
         rewardlist = {190311,1,190401,1,190411,1,190311,1,190311,1},
    },
	{
        levelstage = {401,500}, --，奖励等级阶段,表示第1名
       rewardlist = {190311,1,190401,1,190411,1,190311,1,190311,1},
    },
		{
        levelstage = {501,700}, --，奖励等级阶段,表示第1名
        rewardlist = {190311,1,190401,1,190411,1,190311,1,190311,1},
    },
    {
        levelstage = {701,1000}, --，奖励等级阶段
        rewardlist = {190311,1,190401,1,190411,1,190311,1,190311,1},
    },
	{
        levelstage = {1001,2001}, --，奖励等级阶段,表示第1名
        rewardlist = {190311,1,190401,1,190411,1,190311,1,190311,1},
    },	
}


ArenaConReConfig = {} --竞技场连胜奖励
ArenaConReConfig = 
{
    [10] = {190311,2,190401,2,190411,2},--连胜1场奖励
}